[{"title":"断占总诀篇四 | 梅花易数","date":"2017-10-17T15:56:58.000Z","path":"2017/10/17/yi-meihua-12/","text":"断占总诀篇之四 占卜十应诀 凡占卜，以体卦为主，用为事应，固然矣。但体卦既为主，用互卦相应，参看祸福。然今日得此一卦，体用互变中决之如此；明日复得此卦，体用一般，岂可又复以此决之？然则若何而可？必得十应之说而后可也。盖十应之说，有正应、互应、变应、日应、刻应、外应、天时应、地理应、人事应、所谓十应也。夫正应者，正卦之应也。互应者，互卦之应也。变应者，变卦之应也。此二卦之诀也。占者俱用之以断吉凶矣。至于诸应之理，人有不知者，故必得诸用之诀，卦无不验。不得其诀而占卜吉凶，或验或不验矣。得此诀者，宜秘之。 正应 正应者，即体用二卦决吉凶 互应 互应者，即互卦中决吉凶 变应 变应者，即变卦中决吉凶 方应 方应者，以体为主，看来占之人在何方位上，即看其所坐立之方位。宜生体卦，又宜与体比和，则吉；如克体卦则凶，如体卦生之，亦不吉矣。 日应 日应者，以体卦为主，看所占属何卦，及体卦与本日衰旺如何。盖卦宜生体，宜比和；不宜克体，亦不宜体卦生之也。本日所属卦气如寅卯木、巳午火、申酉金、亥子水、辰戌丑未土也。 刻应 刻应者，即三要之诀也。占卜之顷，随所闻所见吉凶之兆以为吉凶之应。 外应 外应者，外卦之应也。占卜之际，偶见外物之来者，即看其物属何卦。如火得离、水得坎之类。如见老人、马、金玉圆物，得乾。见老妇、牛、土瓦物，得坤之类。 又如见此者，为外应之卦。并看其卦与体卦生克比和之理，以决吉凶。 天时应 天时之应，占卜之际，晴明为离，雨雪为坎，风为巽，雷为震。如离为体，宜晴。坎为体，宜雨。巽为体，宜风。震为体，宜雷。火见雷为比和，参之生克，以定吉凶。 地理应 地理之应，占卜之时，在竹林间，为震、巽之地；在江河溪涧池沼之上为坎；在五金之处为乾、兑之乡；在窑灶炉火之所为离；在土瓦之所为坤、艮，并为体卦，论生克比和之理以诀之。 人事应 人事之应，即三要中人事之克应也。盖占卜之际，偶遇人事之吉为吉，偶遇人事之凶为凶。如闻笑语，主有吉庆之事；遇哭泣，主有悲愁之事，又以人事之属于卦者论之：老人为乾，老妇为坤，少男为艮，少女为兑。并看此人事之卦与体卦生克比和，以决吉凶。 此十应之理，凡占卜之际，耳闻目见以决吉凶，并以体卦为主，而详见生克比和之理。如占病症，互变中俱有克体之卦，而本卦中又无生体之卦者，断不吉也。又看体衰旺，若体旺则庶几有望，体衰则无复生理。如是，又看诸应有生体者，险中有救；有克体则不可望安矣。其余占卜，并以类推之。 论事十大应（论日辰秘文） 一行：问官事，属木，旺木有文书；属火，有官司；财金，财有至。有客至问病，人火潮热，金水米浆。 二立：官司不发，木土无金，大小口舌，病不凶。财水土，有贵人至，文书发动。 三坐：问官司，有讼不成。主财属火，主和劝。金败财，木得财。病却月，又有犯林木神，有祸不凶。 四卧：问官司侧睡者，欲起必作，主陰人事。金有财，火事发破财。土水无财难就。土木有财。 五担：官司被人自惊，与面说人成口舌。问信见水土得财。金木客至。病有犯，四肢沉重不能起。 六券：官司不成，火有财，水土有灾。心下不安，有贵人，主口舌，不凶。 七裹头：官司立见口舌。火，大官司；水土比和。财无，小人分上。口舌呕气。病主陰人小口灾。 八跣足：官司破财，外人欺，心下惊慌。火主破财，土不凶。病有孝至。 九喜：官司自己无主，外人有请，劝官司。有酒肉，别人事。口舌纷纷，求财不许。不凶。 十怒：官司主外人欺凌，不见官，主破财。倚人脱卸，火惊病凶。 卦应（与前八卦类象，大同小异，观者可以互参） 乾为天、为圆、为君、为父、为首、为金、为玉、为寒、为冰、为大赤、为良马、为老马、为瘠马、为驳马、为木果。《九家易》云：“为龙、为直、为衣、为言。”如姤、遁、否、履、无妄、讼、同人七卦，乾在上，刚在外。如大有、泰、大壮、夬、需、大畜、小畜七卦，乾在下，刚于内。乾坤刚柔，四发变八，惟六动随时有异，不拘于一。乾性温而刚直，位西北，不居子午而居戌亥。附于礼王，则为刚善，为明；不附于礼法，则为刚恶，为凶暴。 天文：雪、老陽。 天气：寒。 凶盗：军弓手、贼、强横、停尸。 官贵：朝贵、盐司、大守、座主。 身体：顶、面颊、頄辅。 性情：刚健正直、尊重、好高、战吉。 声音：正、清、商。 信音：朝信改、召命、荐举、关升、义亲。 事意：上卦为形象之家，下卦为强横之辈。 疾病：于太陽脉弦紧，天威所罚、上壅目熟、寒热。 附药：丸子。 坤为地、为母、为布、为釜、为吝啬、为均、为子母牛、为大舆、为文、为众、为柄、其于地也为黑。 震为雷、为龙、为玄黄、为旉、为大涂、为长子、为决躁、为苍筤竹、为萑苇、其于马也、为善鸣、为＄足、为作足、为的颡、其于稼也、为反生、其究为健、为蕃鲜。 巽为木、为风、为长女、为绳直、为工、为白、为长、为高、为进退、为不果、为臭、其于人也、为寡发、为广颡、为多白眼、为近利市三位、其究为躁卦。 坎为水、为沟渎、为隐伏、为矫輮、为弓轮、其于人也、为加忧、为心病、为耳痛、为血卦、为赤、其于马也、为美脊、为亟心、为下首、为薄蹄、为曳、其于舆也、为多眚、为通、为月、为盗、其于木也、为坚多心。 离为火、为日、为电、为中女、为甲胄、为戈兵、其于人也、为大腹、为乾卦、为鳖、为蟹、为蠃、为蚌、为龟、其于木也、为科上槁。 艮为山、为径路、为小石、为门阙、为果蓏、为阍寺、为指、为狗、为鼠、为黔喙之属、其于木也、为坚多节。 兑为泽、为少女、为巫、为口舌、为毁折、为附决、其于地也、为刚卤、为妾、为羊。"},{"title":"断占总诀篇三 | 梅花易数","date":"2017-10-17T15:56:54.000Z","path":"2017/10/17/yi-meihua-11/","text":"断占总诀篇之三 诸卦反对性情 乾刚坤柔反其义，比卦欢欣困忧虑。 临逢百物观求之，蒙卦难明屯不失。 大畜其卦福之生，无妄若遇祸之始。 升者去而不复回，萃者聚而终不去。 谦卦自尊豫怠人，震则动而艮则止。 兑主外遇祸之藏，随前坎后偷安矣。 剥体消烂复自生，蛊改前非而已矣。 明夷内朗又逢伤，晋主外明并通理。 益拟茂盛损象衰，咸速恒迟涣远遁。 同人内亲睽外疏，解卦从容蹇难启。 离文美丽艮光明，遁退回身姤相遇。 大有曰众丰曰多，坎卦履险震卦起。 需不进兮讼不宁，既济一定无后虑。 未济之卦男之终，归妹之辞归之始。 否遭大往而小来，泰卦大来而小去。 革去旧故鼎从新，小畜曰寡噬嗑食。 旅羁其外大过颠，夬卦分明曰快利。 要将字字考精详，杂卦性情反对是。 占物类例 凡看物数，看其成卦，观其爻辞。如得乾，曰“潜龙勿用”，乃曰不可用之物；“见龙在田”，乃曰田中之物；“或跃在渊”，乃曰水中之物；“亢龙有悔”，乃废物也。如得坤之“直、方、大”，乃曰直而方大之器物：“括囊无咎”，乃曰包裹之物；“黄裳元吉”，乃曰黄色衣服之物；“其血玄黄”，乃石物或逢石而破；“困于株林”，乃曰木物。又言爻辞，不言物类，而不能决者，须以八卦所属之象察之。 又诀，体用断物之妙，生克制化之妙，于诸诀中此极为美验。其所以生体者，为可食之物；克体者，为可近人之秽物。体生者，为不成之器；体克者，为破碎损折之物；比和者，乃有用成器之物，又生体象者为贵物，克体象者为贱物，所泄为废物也。 又诀，凡算此数，以体卦为主，看其刚柔。用卦看其有用无用。体生方圆曲直，可作可用，如用生体，乃可食。用变互卦，看其色与数目。此互卦决其物之数目也。如互见乾、兑，决为一二之数。互见艮、坤，为七八之数也。但互卦重乾、重艮、重坤、重坎、重离之属，皆是两件。物乘旺，物数多，衰而物少。离为中虚之物，或空手无物。又决物之数者，如互艮卦，先天七数，后天亦不出八数之外。 物数为体诀 凡算物数者，不但以体卦为体，凡卦之多者，皆可为体。如乾金多，以金为体，则多刚；坤多以土为体，多柔。乾卦体卦乾而互又是乾。固曰：金为体而刚矣，便是圆健刚硬之物。非金非石，此为体矣。观物有体互变卦，并无生旺之气者，为不入五行物。观物观爻，如八卦中陽爻多，乃多刚之物；陰爻多，乃多柔之物。 又诀，观物变在五六爻，多是能飞动之物。 观物看变爻为主 凡观物，以变卦为主，应用之应验也。如得乾，初爻变为巽，金刀削过之木物。二爻动，变为离，乃火中锻炼之金。三爻动，变为兑，乃毁折五金之器，虽圆而破处多也。 观物克应法 凡算物之成败，又看体卦克应如何。成卦未决之际，有见圆物相遇，即断圆物。见有负土者过，即断为土中之物。见刚健之物，即言是刚健之物。见有柔腐之物，即言是柔腐之物。 观物趣时诀 凡算物，趣时察理，无有不验。以春得震、离为花，夏得震为有声之物，秋得兑为毁折成器之物，冬得坤为无用土物也。 观物用易例 有人以笼盛物者，算得地天泰之初变升，互见震、兑，曰此必是草木类而生土中也。色青根黄，当连根之草木也。盖爻辞曰：“拔茅茹，以其汇。”乃曰：此乃干根之草木也，视之乃草木连根，新采于土中也。互震为清色，兑为黄根也。 又有以钟覆物者，令占之，得火风鼎之雷风恒。乃曰：此有声价气势之物，虽圆而今毁缺矣。其色白而可用。盖其辞曰：“鼎玉铉，大吉。”互见乾、兑，虽圆面毁也。开视之，乃玉绦环，果破矣。 万物戏验 凡猜手中物，乾金为圆白之物。其色白，其性刚，为宝货之物，有气为无价物。坎为黑色，性柔，近水之物。又艮为土中之物，瓦石之类，有气为成器之物，其色黄。逢兑克，无气，折伤之物。又巽、震为竹木，有气为有用之物，为可食之物；无气为竹木之属。遇兑之属可食，当时之果物，色青。有气柔，无气刚。震、巽遇坎为污湿物，或有气；如无气，为烂朽之木。离色亦，性柔，有水有木，而火焚之，必炭之类。有气，为价值可货之物。坤为土中之物，色黄而性温。兑为毁折之物，带口。凡占物，以春震巽、夏离、秋乾兑、冬坎皆当以为可用之物，成器之物。否则为无用之物。值六虚冲破，则必无物而空手矣。"},{"title":"断占总诀篇二 | 梅花易数","date":"2017-10-17T15:56:50.000Z","path":"2017/10/17/yi-meihua-10/","text":"断占总诀篇之二 万物赋 人禀陰陽，卦分先后。达时务者，近取诸身，远取诸物。观物理者，静则乎地，动则乎天。原夫万物有数，易数无穷。动静可知，不出于玄天之外。吉凶必见，莫逃乎爻象之中。未成卦以前，必虚心而求应；既成卦以后，复观刻应以为断。声音言语，傍人谶兆，当遇形影往来，我心指实皆是，及其六爻以定，三天既生，始寻卦象之端，终测刻应之理。是以逢吉兆而终知有喜，见凶识而不免乎凶。故欲知他人家之事，必须凭我耳目之闻见。未成卦而闻见之，乃已生之事。既定卦而观察之，乃未来之机。或闻何处喧闹，主有斗争；或听此间笑语，必逢吉庆；见妇啼叹，其家陰小有灾；东至军来，必有官司词讼；或逢枷锁而枷锁临身；倘遇鞭杖而鞭杖必至。若屠而负肉，此为骨肉有灾；倘逢血光，而又恐灾于孳畜。师巫乐饵，病患临门。见詖则有犯家先，逢酒则欠神愿。陰人至则女子有厄，陽人至则男子当灾。又须八卦中分，不可一例而论。卦吉而爻象又吉，祸患终无；卦凶而识兆又凶，灾殃难免。披麻带孝，必然孝服临头；持杖而号，定主号泣满室。其人忧终是为忧，其人喜还须有喜。故当观色察形，以为决意断心。其或鼓乐声喧，又见酒杯器皿，若不迎婚嫁娶，定须会客宴酣。欲知应在何日，须观爻象值数。巽五日而坤八日，离三朝而坎六朝。又观远近克应，以断得买之相期。应远，则全卦相同；应近，而各时同断。假如天地否卦，上天一而下地八；设若泽火革卦，上兑二而下离三。依此推之，万无一失。此人物之兆，察之可推也。及其鸟兽之应，仍验之有准。鹊噪而喜色已动，鸦鸣而祸事将来。牛羊猪犬，日晨不见，金日遇之，六畜有损。木日见猪养猪，必成。庚日见鸡鸣，丁日见羊过，此乃凶刃之杀。己日值马来，壬日猪过，此皆食禄之兆。见吉兆而百事亨通，逢凶谶而诸事阻滞。或若求财问利，须凭克应。以言柜箱为藏财之用，绳索为穿钱之物。逢金帛宝货之类，理必有成。遇刀刃剑具之器，损而无益。又看原卦，不可执一。逢财而有财，无财而无益。凡物成器，方系得全，缺损破碎，有之不足。或问婚姻，理亦相似。物团圆，指日而成；物破损，中逢阻折。此又是一家，闻奥理明，万事昭然。逢柴炭主忧，折麦主悲。米必奇，豆必伤。末与鞋，万事和谐；棋与药，与人期约。斧锯必有修造，粮储必有远行。闻禽鸣，谋事虚说。听鼓声，交易空虚。拭目润睫，内有哭泣之事；持刃见血，外有虫毒之讲。克应既明，饮食同断。见水为饮食酒汤，遇火为煎炮烤炙。见米为一饭之得，提壶为酌杯之礼。水乃鱼暇水中物味，土乃牛羊土内菜蔬。姜面为辛味辣羹，刀砧乃董腥美味。此三天之克应，万物之枢机。能达此者尚其秘之。 饮食篇 夫乾之为象也，圆坚而味辛，取象乎卯，为牲之首，为马为猪，秋得之而食禄盛，夏得之而食禄衰。春为时新之物，水果蔬菜之属；冬为冷物，隔宿之食。有坎乃江湖海味，有水而蔬果珍羞。 艮为土物同烹，离乃火边煎炙。秋为蟹，春为马。凡内必多肉，其味必辛，盛有瓦器，伴有金樽。其于菜也为芹，其于物也带羽。克生生回，食必鹅鸭。生出克入，野菜无名。 坤其于坤也，远客至，故人来，所用必瓦器，所食米果之味。静则梨枣茄芋，动则鱼虾鲜羊。无骨肉脯，杀亦为藏，藏亦为肚肠。遇客必妇人，克此必主口舌。克出生回，乃牲之味；克入生物，乃集物之烹。见乾、兑，细切薄披；见震、巽而新生旧煮，其色黑黄，其味甘甜，水火并之，蒸炊而已。四时皆为米麦之味，必带麻姜。仔细推详必有验也。 巽之为卦，主文书柬约之间，讲论之际，外客婚姻，故人旧交。或主远信近期，其色白青，其性曲直，其味酸，其象长。桃李木瓜，斋辣素食，为鱼为鸡，其豆其面，非济执而得之，必锄掘而得之。有乾、兑，食之而致病，有坤，得之非难。炊为炒菜蔬，离为炒茶，带坎于中，酒汤其食。其无生，半斋半荤。其在艮也，会邻里，有贵人。食物不多，适口而已。其桔油菜果蔬，斫伐于山林带节，虎狗兔鹿，渔捕网罗，米麻面麦。克入集食，克出羊肉。克入口舌，是非陰灾，极不可食。其味甘甜，其色玄黄。坎为水象也，水近信至海内，味香有细鳞，或四足。凡曰水族，必可饮食也。或闻箫鼓之声，或在礼乐之所，其色黑，其味咸。克出饮酒，回食鱼。为豕为目，为耳为血。羹汤物味，酒食水酱。遇离而说文书，逢乾而为海味。 震之为卦，木属也。酒友疏狂，虚轻怪异。大树之果，园林之蔬，其色青而味酸，其数多，会客少。或有膻臭之气，或有异香之肴。同离多，主盐茶；见坎或为盐醋。 离则文书交易，亲戚师儒，坐中多礼貌之人，筵上总英才之士。其物乃煎烤炙烧，其间或茶盐。白日之夕，虽之以烛，春夏之际。凡物带花，老人莫食。心事不宁，少者宜之。宜讲论，即有益。为鸡为雉，为蟹为蛇，色赤味苦，性热而气香。逢坎而酒请之争，逢巽则炒菜而已。 兑之为卦，其属白金，其味辛而色白。或远客暴至，或近交争来。凡动物刀砧，凡味必有辛辣，凡包里腌藏。其于暴也，为菲为菱；其于菜也，为葱为韭。盛而有腥臭，旺而有羊鹅。坐间有潜越之人，或有歌娼之女。单则必然口舌，重则必然欢喜。生出多食，克出好事。 夫算其饮食，必须察其动静。故动则有，静则无。以体卦下卦为己卦，上为人卦。下为变为客，互之上为酒，下为食物。取象体之下为食何物，变为客体，下食之不终，生体下吉。互克体之不得食。他人克应亦难食。他人生，他人请，己生体生下，己请人。互受生后不计杯杓。上体受生客不计数。变生互，客有后至者；互生克，有先去者。取其日时，以互卦用矣。 观物玄妙歌诀 观物戏验者，虽云无益于世，学者以此验数，而知圣人作《易》之灵耳。物之于世，必有数焉。故天圆地方，物之形也；天玄地黄，物之色也；天动地静，物之性也；天上地下，物之位也；乾刚坤柔，物之体也。故乾之为卦，刚而圆，贵而坚，为金为玉，为赤为圆，为大为首，为上之果物。见兑为毁拆，逢坎而沉溺，见离为炼煆之金，震为有动之物，巽为木果为圆，坤、艮土中之石，得火而成器。兑为剑锋之锐，秋得而价高，夏得之而衰矣。 坤之为卦，其形直而方，其色黑而黄。为文为布，为舆为金。其物象牛，其性恶动。得乾乃可圆可方，可贵可贱。震、巽为长器，离为文章，兑为土中出之金，艮为带刚之土石也。 震之为卦，其色玄黄而多青，为木为声，为竹为萑苇，为蕃鲜及生形。上柔下刚，是性震动而可惊。得乾乃为声价之物，得兑为无用之木，见艮山林间之石，见坎有气之类，巽为有枝叶，见离为带花。 巽之为卦，其色白，其气香。为草木，为刚为柔。见离为文书，见兑、乾为不用，乃遇金刀之物。坤、艮为草木之类，坎、兑为可食之物。为长为直，并震而春生夏长，草木之果蔬。 坎之为卦，其色黑，亦可圆可方物。为柔为腐，内则刚物。得之卑湿之所，多为水中之物。见乾亦圆，见兑亦毁。又乃污湿，得震、巽而可食；离、水火既济，假水而出，假火而成。又为滞于物，兑为带口也。震、巽为带枝叶，为带花也。 离之为卦也，其色黄而青，体燥，其性则上刚下柔。为山石之物，土瓦之类，小石于大山，为门途之处。为物见乾而刚，兑而毁折，坤而土块，巽为草之物，而震为木物类也。坎并为河岸之物，离并为瓦器，震、巽并见篱壁之物。 兑之为卦，其色白，其性少柔多刚。为毁折而下，全带口而圆。见乾先圆后缺，见艮则金石废器，见震、巽为剥削之物，见坎为水之类。得乾而多刚，得坤而多柔，长于凯撒之内。于水中之类，得柔而成器也。 诸事响应歌 混沌开辟立人极，吉凶回应尤难避。 先贤遗下预知音，《皇极》《观梅》出《周易》。 玄微浩瀚总无涯，各述繁言人莫记。 大抵体宜用卦生，旺相谋为终有益。 比和为吉克为凶，生用亦为凶兆矣。 问雨天晴无坎兑，亢旱言之终则是。 天时连雨问晴明，艮离贲卦回应耳。 乾明坤晦巽多风，震主雷霆定莫疑。 凡占人事体克用，诸事亨通须有幸。 比和为妙克为凶，又看其中体卦证。 乾主公门是老人，坤遇陰人曰土应。 震为东方或山林，巽亦山林蔬果品。 坎为北方并水姓，酒货鱼盐才取定。 离言文书炉冶利，亦日南方颜色亦。 艮为东北山林材，兑曰西方喜悦是。 生体克体亦同方，编记以为诸事应。 凡问家宅体为主，旺相须知进田土。 生用须云耗散财，比和家世安居处。 克体为凶决断之，生产以体为其母。 两宜生旺不宜衰，奇偶之中察男女。 乾卦为陽坤为陰，又有来人爻内取。 陰多生女陽生男，此数分明具易理。 婚姻生用必难成，比和克用大吉利。 若问饮食和生体，必知肴馔丰厚喜。 生用克体饮食难，克用必无比和美。 坎兑为酒震为鱼，八卦推求衰旺取。 求谋称意是比和，克用谋为迟可已。 求名克用名可求，生体比和俱可取。 求财克用日有财，生体比和俱称意。 交易生体及比和，有利必成无后虑。 出行克用用生体，所至其方多得意。 坎则乘舟离旱途，乾震动则坤艮止。 行人克用必来迟，生体比和人即至。 成远恒迟升不回，艮阻坎险君须记。 若去谒人体克用，速可追寻依卦断。 相生比和终可寻，兑临残缺并井畔。 离为冶所及南方，坤主方器凭推看。 疾病最宜体旺相，克用易安药有效。 比和凶则有救星，体卦受克为凶兆。 离宜服热坎服冷，卦见坤土温补亨。 亦把鬼神卦象推，震主娇怪为状貌。 巽为自缢井锁枷，坤艮落水及血刃。 凡占公讼用宜克，体卦旺相终得理。 比和助解最为奇，非止全仗他人力。 若问墓穴在何地，坤则平陽巽林里。 乾宜高葬艮临山，离近人烟兑兴废。 比和生体宜葬之，克用尤为大吉利。 若人临问听傍言，笑语鸡鸣亦吉美。 美物是为祥端推，略举片言通万类。"},{"title":"断占总诀篇一 | 梅花易数","date":"2017-10-17T15:56:45.000Z","path":"2017/10/17/yi-meihua-9/","text":"观梅数诀序 嗟呼，《易》岂易言哉！盖《易》之为书，至精微，至玄妙。然数者，不外乎易理也。有先后天之殊，有叶音取音之辨，明忧虞得失之机，取互变迟速之应。数有前定，祸福难测。易理灼然可察，予求得先天、玄黄、灵应诸篇，外采《易辞》，曰：“观梅数诀，列图明五行生克衰旺之理，分例指避凶趋吉之道。后学群子幸鉴焉。”《易辞》曰：“易有太极，是生两仪，两仪生四象，四象生八卦，八卦生万物。”邵子曰：“一分为二，二分为四，四分为八也。”《说卦传》曰：“易逆数也。”邵子曰：“乾一、兑二、离三、震四、巽五、坎六、艮七、坤八，自乾至坤，皆得未生之卦，若逆推四时之比也。后天六十四卦仿此。” 八卦定陰陽次序 乾为父，震长男，坎中男，艮少男； 坤为母，巽长女，离中女，兑少女。 变卦式八则 泽火革 体金，互巽木变泽山咸 离卦初爻，陽动变陰，变艮卦兑金，为少女，离火克之。巽为股，乾金克之，曰：伤股。得艮土生，入兑金，断曰：不至于死。 体用于变爻，作动静取之。动者为用，静者为体。 地雷复 体土、用金，变地泽临 木是用爻，断出软物，文章之体也。 天泽履 体金、用金，互卦木火变乾卦 此卦断出是铁器之物 泽火革 用金、体火，互卦金木变火雷噬嗑 此卦乃用金体火，夏火得旺，能出土，必是土物也。 雷泽归妹 用木、体金，互卦水火变火泽睽 用爻属木变火，体卦属金。四爻变卦成艮，土能生金，断出是铁。 泽天夬 体金、用金，互卦金变兑卦 此卦非金是石，断是破磁碟也。 泽火革 互卦金木变艮卦 本卦得泽火革，为少女，近物为口，远取羊。内离为中女，近日，远取雉。初爻变艮卦为土，土能生金，则扶起兑金之妹。次除去初爻，移上四爻，又成巽木，断得伤股之灾。得初爻变艮土生兑金，是故有救而不至于死也。 “近取诸身”，乾头、坤腹、震足、巽股、坎耳、离目、兑口、艮手，人身；“远取诸物”，乾马、坤牛、震龙、巽鸡、坎豕、离雉、艮狗、兑羊，畜道。 天水讼卦 变兑 ，欲要求财。盖卦是体生，而乃泄已之气，其财空望。次得离卦属火，能克金。其日午时，客来食去酒，返自消耗也。 占卦诀 又如占卦问吉事，则看卦中有生体之卦，则吉事应之必速。便看生体之卦，于八卦时序类决其日时。如生体是用卦，则事即成。生体是互卦，则渐成。生体是变卦，则稍迟耳。若有生体之卦，又有克体之卦，则事有阻节，好中不足产。便看克体卦气阻于几日，若乾克体，阻一日，兑克体，阻二日之类推之。如占吉事，无生体之卦，有克体之卦，则事不谐矣。无克体之卦。则吉事必可成就矣。 又如占不吉之事，卦中有生体之卦，则有救无害；如无生体之卦，事必不吉矣。若以日期而论，看卦中有生体之卦，则事应于生体卦气之日；有克体之卦，则事败于克体卦气之日。要在活法取用也。 体用互变之诀 大凡占卜，以体为其主，互用变皆为应。卦用最紧，互次之，变卦又次之。故曰用为占之即应，互为中间之应，变为事占之终应。然互卦则分其有体之互，有用之互。如体在上，则上互为体之互，下互为用之互，体卦在下，则下互为体之互，上互为用之互。体互最紧，用互次之。 例如观梅恒卦，互兑、乾，兑为体，互见女子折花。若乾为体，互则老人折花矣。盖兑、乾皆克体，但取兑而不取乾，此体互用之分。 大凡占卦，变卦克体，事于末后，必有不吉。变生体及比和，则事事临终有吉利。此用互变之诀也。 体用生克之诀 占卦即以卦分体用互变，即以五行之理断其吉凶。然生克之理，于内卦体用互变，一定之生克。若外卦，则须明其真生真克之五行，以分轻重，则祸福立应。何也？假如乾、兑之金为体，见火则克，然有真火之体，有火之形色。真火能克金，形色则不能克。能克则不吉，不能克则不顺而已。盖见炉中火，窑灶之火，真火也。烈焰巨炷，真火也。乾、兑为体，遇之不吉。若色之红紫，形之中虚，槁木之离，日火之火，则灶之形色，非真火也，乾、兑之体，不为深忌。又若一盏之灯，一炬之烛，虽曰真火，微细而轻，小不利耳。又若震、巽之木体，遇金则克，然钗钏之金，金铂之金，成锭之银，杯盘之银，与器之锡，琐屑之钢铁皆金也。此等之金，岂能克木？木之所忌者，快刀锐刃，巨斧大锯。震、巽之体，值之必有不吉。又若离火为体，见真水能克。然但见色之黑者，见体之湿者，与夫血之类，皆坎之属，终忌而不深害也。余卦为体，所值外应，克者皆以轻重断之。若夫生体之卦，亦当分辨。土与瓦器皆坤土，金遇之，土能生金，瓦不能生也。树木柴薪，皆木也。离火值之，柴薪生火之捷，树木之末伐者，生炎之迟也。木为体，真水生木之福重，如豕如血虽坎之属，生木之类轻也。其余五行生克，并以类而推之。 体用衰旺之诀 凡体卦宜乘旺，克体之卦宜衰。盖体卦之气，如春木、夏火、秋金、冬水、四季之月土，此得令之卦，乘旺之气，虽有他卦克之，亦无大害。用互变卦，乘旺皆吉，但不要克体之卦气旺。而体卦气衰是不吉之占。占者有此，若问病必死，问讼必败。若非问讼与病而常占，则防有官病之事。末临其期，在于克体卦气之月日也。若卦体旺而复有生体之卦，吉事之来，可刻期而至矣。若内卦外卦有生体者，体卦虽衰，亦无大害也。内外并也生体，虽体之卦党多，皆是衰卦，终不吉也。故体用之卦，必须详其盛衰也。 体用动静之诀 占卦体用互变既分，必以内外之卦察其动不动。不动不占，亦不断。其吉凶悔吝，生乎动也。夫体卦为静，互卦为静，用卦变卦则动也，此内卦之动静也。以外卦言之，方应之卦，天地地理之卦，应皆静，若人事之应，器物之类，则有动者矣。器物本静，人持其器物而来，则动矣。若乾马、坤牛，皆动者矣。盖水之井沼，土之山岩石，皆静者矣。人汲水担水而前，水之动也。又人持石负土而前，土之动也。于外卦之应，观其动静而审其吉凶，动而吉者，应吉之速；动而凶者，应凶之速；不动而应者，吉凶之末见也。此则外卦体用之动静也。 若夫起卦之动静，亦以我之中静而观其动者而占之。如雀之争坠，如牛鸡之衰鸣，如枯木之坠，皆物之动者，我以静而占之也。 又若我坐，则事应之迟；我行而事应之速；我立而半迟半速，此皆动静之理也。 占卜坐端之诀 坐端之诀，以我之所坐为中，八位列于八方，占卦决断之。须虚心待应，坐而端之，察其八卦八方应兆，以为占卜事端之应。随其方卦有生克之应者，以定所占之家吉凶也。 如乾上有土生之，或乾宫有诸吉兆，则尊长老人分上，见吉庆大事。若乾上有火克之，或有凶兆，则主长上老人有忧。 坤有火生之，或坤上有吉兆，则主母亲分上或主陰人有吉利之喜。坤宫见克，或有凶兆，则主老母陰人有灾厄。 震宫有水生之，及东方震宫有吉兆，则喜在长子长孙；见克而或见凶，则长子长孙不利。 坎宫宜见五金及有吉利之谶，则喜在中男之位；若土克，若见凶，则忧在中男矣。 离宫喜木生之，或有可喜之应，则中女有喜；若遇克或见凶，则中女有厄矣。 艮为少男之位，宜火生之，见吉则少男之喜；若遇克，或见凶，则灾及少男。问产必不育矣。 兑为少女，土宜生之，见吉则少女有喜，或有欢悦之事。若问病，如乾卦受克，病在头。坤宫见克，病在腹，推之震足、巽股、离目、坎耳及血、艮手指、兑口齿，于其克者定见其病。 至于八端之中，有奇占巧卜者，则在乎人。此引其端为之例也。 占卜克应之诀 克应者，所谓克期应验也。占卜之道，无此诀，则吉凶成败之事不知应于何时。故克应为卦之切要也。然克则最难，有以数而克之者，有以理而克之者，皆要论也。以数而刻期，必详其理，如算屋宅之初创，男女之始婚，坟之方葬，器物之新置，俱以年月日时加事物之数而起卦。卦成，则于体用互变之中，视全卦之数，以为约定之期，审其事端之迟速而刻之，如屋宅坟墓永久者也。屋宅则以全卦之数刻其期。如屋宅之终应，盖屋宅有朽坏之期也。坟墓亦有损坏，然占墓但占吉凶，不计成败也。男女之婚，远亦不过数年。年内之事，全卦之数可决，又不如屋宅之久也。然婚姻亦不过卜其吉凶，不必刻其期也。若吉凶之期，但以生体及比和之年月为吉期，克体之年月为不吉之期也。器物之占，则金石之质终远，草木之质终不久也。远者，以全卦之数为年期；近者，以全卦之数为月期。又近者，以全卦为日期也。如置砚，则全卦之数为岁。计笔墨亦可以全卦为岁计。笔墨之小者，以日卦之数可也。此器物刻期之占也。如先天观梅与牡丹二花，俱旦夕之事，故以卦理推，则不必决其远日也。如后天老年、少年、鸡牛之占，以方卦物卦之数合而计之。老少、鸡牛之占，以方卦物卦之数合而计之。老少、鸡牛之占，亦只可以日计也。若永远之占，则以日为月，以月为年矣。占者详吉，必又寻常之占事刻期，则于全卦中细观生体之卦为吉，应决期克体之卦为凶。应之期远，则以年，近则以月，又近则以日也。如问求名则乾为体，看卦中有坤、艮，则断其辰、戌、丑、未之土月日。盖乾、兑，金体也。此为吉事生体之应。若问病而乾卦为体，则看卦中有离，又看卦中无坤、艮，及有凶犯，则其体死于巳午火日，此克体为凶事之期也。又若问行人，以生体之日为归期，无生体比和之日，则归必迟。若此例者，具难尽载，学者审焉。"},{"title":"体用生克篇五 | 梅花易数","date":"2017-10-17T15:39:36.000Z","path":"2017/10/17/yi-meihua-8/","text":"体用生克篇之五 观物洞玄歌 洞玄歌者，洞达玄妙之说也。此歌多为占宅气而发。昔牛思晦尝入人家，知其吉凶先兆，盖此术云。是故家之兴衰必有祯祥妖孽之谶(chen)，识者鉴之，不识者昧之。故此歌发其蕴奥，皆理之必然者，切勿以浅近目之也。世问万事无非数，理在其中，吉凶悔吝有其机，祸福可先知。其五行，金、木、水、火、土，生克先为主；青、黄、赤、黑、白五形辨，察要分明。 人家吉凶何堪见？只向玄中判。 入门辨察见闻时，于此察兴衰。 若还宅气如春意，家室生和气。 若然冷落似秋时，从此渐衰微。 自然馨香如兰室，福至无虚日。 鸡豚猫犬秽薰猩，贫病至相侵。 男妆女饰皆齐整，此去门风盛。 家人垢面与蓬头，定见有悲忧。 鬼啼妇叹情怀悄，祸害道陰小。 老人无故泣双垂，不日见愁悲。 门前墙壁缺，家道中渐歇。 溜漕水势向门流，财帛永难收。 忽然屋上生奇草，益荫人家好。 门户幽爽绝尘埃，必定出高才。 偶悬破履当门户，必有奴欺主。 常常破碎在边门，断不利家君。 遮门临井桃花艳，内有风情染。 屋前屋后有高桐，离别主人翁。 井边倘种高梨树，长有离乡土。 祠堂神主忽焚香，火厄恐相招。 檐前瓦片当门堕，诸事愁崩破。 若施破碗厕坑中，从此见贫穷。 白昼不宜灯在地，死者还相继。 公然鼠向日中来，不日耗资财。 牝难司晨鸣咿啼，人眷有灾厄。 清晨鹊噪连声继，远行人将至。 蟒蛇偶尔入人家，人病见妖邪。 雀群争遂当门盛，口舌纷纷定。 偶然鹏鸟叫当门，人口有灾逢。 入门若见有群羊，家主病瘟黄。 舟船若安在平地，虽稳成淹滞。 他家树陰过墙来，多得横来财。 阶前石砌多残折，成事多衰灭。 入门茶果应声来，中馈主塚财。 三餐时候炊烟早，家道渐基好。 连宵宿火不成时，人散与财离。 千门万户难详备，理在吾心地。 斯文引路发先天，深奥入玄玄。 此《洞玄歌》与《灵应》，同出而小异。彼篇多为占卜而诀，盖占卜之际，随所出所见，以为克应之兆。此歌则不特为占卜之事，一时而入人家，有此事，必有此理。盖多寓观察之宋也。然有数端，人家可得警戒而趋避之，或可转祸为福。偶不知所因而宥于数中，俾吾见之，则善恶不逃乎明鉴矣。 起卦加数例 寅年十二月初一日午时，有数家起造，俱在邻市之间。有三家以此年月日时求占于先生，若同一卦，则吉凶莫辨矣。先生以各姓而加数，遂断之而皆验。盖三家求占，有田姓者，王姓者，韩姓者。若寅年三数、十二与一，共十六，加王姓四画，得二十数，去八一十六，得四，震为上卦；又加午时，七数，总二十七数，去三八二十四，得三，离为下卦。二十七中去四六二十四，余三为初爻，得丰变震，互见兑、巽。其田姓加以田字六画，得水风井，变升，互见离、兑；其韩姓加入二十一画之数，得益变中孚，互见艮、坤。乃以各家之姓起数，随各家之卦断之也。不特起屋之年月日时加姓也，凡冠婚及葬事皆加一姓可矣。若婚姻，则男女大事，必加二姓可也。极北之人无姓，亦必有名，不辨其字，则数声音。又无名，则随所寓也。 屋宅之占诀 寅年十二月初一日午时起屋者，其家田姓，其占水风井，变地风升，互见离、兑，巽木为体，用卦坎水生也，虽兑金克木，得有离火，火虽无气，终是制金。然有兑金，酉年月日，亦当有损失之忧。亥子水年月日，当有进益，或得水边之财，坎生体巽也。寅卯年当大快意，比和之气也。但家必多口舌之聒，亦为兑也。木体近春。喜逢坎水，此居必能发旺。二十九年后，此屋当毁。盖二十九年者，全卦之成数也。若非有兑在中，虽再见二十九年，屋当无恙也。 同时王姓家起造，得雷火丰，变震，互见兑、巽。震木为体，离为用卦。兑为体之互，克体亦切。虽得离火制兑金，亦不纯美。用火泄体之气，破耗资财。每遇火年月日，主见此事，或因妇人而有损失。家中亦多女子是非。亥子寅卯之年月，却主进益田财。盖震木为体，虽不见坎，终是利水年。生体之气，不见震巽，亦逢寅、卯，为体卦得局之时也。凡有震有巽，寅卯与木之气运年月，此居必大得意。亦主得长子之力，变重震也。二十二年复为火所焚。 韩姓之居，得益变中孚。巽体，互见艮、坤，变兑克本。此居必有官讼，见于酉年月日。申酉年连见病患，所喜用卦其震与巽体比和，当见寅卯年月后。申酉年后凶。三十一年之后，遇申酉年，此居当毁。若非有兑，或有一坎，再三十一年，此居亦无恙也。 器物占 大抵占器物，并不喜见兑卦，盖兑为毁折也。若坎为体，则见兑无伤。乾卦为体亦无害。其余卦体，逢兑不久即破。木之器物，或震巽为体，见兑为用，必不禁耐用矣。破器之日，必申酉与占卜之年月日也。又畜养之物，又不宜乾、兑克体。种植之物，乾、兑克体，必不成，即成，亦有斧戕之厄。种植之物，宜见坎也。 又凡见器物，欲知其成毁，亦看卦体，无克者则久长。体逢克则不久，视其器物之气数，可久者，以全卦之年数断之；不可久者，以月数断之；至速者，以日数断之也。"},{"title":"体用生克篇四 | 梅花易数","date":"2017-10-17T15:39:32.000Z","path":"2017/10/17/yi-meihua-7/","text":"体用生克篇之四 十应奥论 十应固出于三要，而妙乎三要。但以耳目所得，如见吉兆而终须吉，若逢凶谶不免乎凶，理之自然也。然以此而遇吉凶，亦有未然者也。黄金白银，为世之宝，三要得之，必以为祥。十应之决，遇金有不吉者，利刃锐兵，世谓凶器，三要得之，亦以为凶；十应之说，遇兵刃反有吉者。又若占产见少男，三要得之为生子之喜，十应见少男则凶。占病遇棺，三要占之必死；十应以为有生意。例多若此，是占卜物者，不可无应也。 十应目论 十应并以体卦为主，诸用卦为用。每以内分外体，用卦参观为妙。内卦不吉而外卦又吉，可以解其不吉；内卦吉而外卦不吉，反破其吉。若内外卦全吉，则断然吉。全凶则断然凶。其内吉外凶，内凶外吉，又须详理以断吉凶，慎不可胶柱鼓瑟也。外卦十应之目，则有天时、地理及写字等，其十一类之应，并以体卦为主，而随其所应以为用也。 复明天时之应 如天无云翳，明朗之际，为乾之时。乾、兑为体，则比和而吉；坎为体，则逢生而大吉。坤、艮为体，则泄气。震、巽为体，则见克而不吉矣。晴霁日中，为离之时，坤、兑为体则吉。雨雪为坎之时，震、巽为体则吉，离为体则不吉。雷风为震、巽之时，离为体则吉，坤、艮为体则不吉。此天时之应也。 复明地理之应 茂树秀竹，为震之地。离与震、巽为体则吉，坤、艮为体则凶。江湖、河池、川泽、溪涧为坎之地，震、巽与坎为体则吉，而离为体则不吉。窑灶之地为离，坤、艮并离为体则吉，而乾、兑为体则不吉。岩穴之地为艮、乾、兑与艮为体则吉，坎为体则不吉。此地理之应也。 复明人事之应 人事有论卦象五行者，有不论卦象五行者。论卦象，则老人属乾，老妇属坤，艮为少男，兑为少女之类。五行生克，比和之理，与前天时、地理之卦同断。其不分卦象五行者，则以人事之纷，了见杂出，有吉有凶，此应则随其吉凶而为之兆也。又观其事则亦为某人。此人事之应也。 复明时令之应 时令不必论卦象，但详其令，月日值之五行衰旺之气。旺者，如寅卯之月日则木旺，巳午之月日火旺，申酉之月日金旺，亥子之月日水旺，辰戌丑未之月日土旺。衰者，如木旺则土衰，土旺则水衰，水旺火衰，火旺则金衰，金旺则木衰。是故生体卦气，宜值时之旺气，不宜衰气。如克体卦气，则宜乘衰。此时令之应也。 复明方卦之应 即分方之卦。如离南、坎北、震东、兑西、巽东南、乾西北、艮东北、坤西南类也。论吉凶者，看来占之人在何卦位，而以用卦参详。如坎为用卦，宜在坎与震、巽之位，在离则不吉。离为用卦，宜在离与坤、艮之位，在乾、兑二位则不吉矣。盖宜在本卦之方，为用卦生之方，不宜受用卦克也。若夫气在之卦所在之方，又当审之。如水从坎来，为坎卦气旺。水从坤、艮来，则坎之卦气衰。火从南来，为离卦气旺，如从北来，则离之卦气衰。余皆仿此。大抵本卦之方，生为旺，受克为衰。宜以体卦参之。生体卦气，宜受旺方；克体卦气，宜受克方。此方卦之应也。又震、巽之方，不论坤、艮。坤、艮之方不论坎。坎方不论离。离方不论乾。乾、兑之方，不论震、巽。以其寓卦受方卦之克也。 复明动物之应 动物有论卦象者。乾为马，坤为牛，震为龙，巽为鸡，坎为豕，离为雉，艮为狗，兑为羊，又螺蚌龟鳖为离之象，鱼类为坎之属，此动物之卦，以体详与。又不论卦象五行者，如乌鸦报灾，灵鹊报喜，渔雁主有书信，蛇虫防有毒害，鸡唱为家音，马嘶为动意。此动物之应也。 复明静物之应 器物之类，有论卦象者。如水属坎，火属离，水之气属震、巽，金之气属乾、兑，土之气属坤、艮，为体卦，要参详。其不分卦象者，但观其器物之兆，如物之圆者，事成；器之缺者，事败。又详其器物是何物，如笔砚主文书之事，袍笏主官职之事，樽俎之具有宴集，枷锁之具防官灾。百端不一，审其物器。此静物之应也。 复明言语之应 闻人言语，不论卦象，但详其所言之事绪而占卜之。应闻吉语则吉，闻凶语则凶，若闻闹丛言语喧集，难以决断。若定人少之处，或言语可辨其事绪，则审其所言何事，心领而意会之。如说朝廷迁选，可以求名；论江湖州郡，主出行；言争讼之事，主官司；言喜庆之事，利婚姻。事绪不一，随所闻以依之。此言语之应也。 复明声音之应 耳所闻之声音而论卦象，则雷为震，风声为巽，雨声为坎，水声为坎，鼓拍槌拆之声出于木者，皆属震、巽，钟声、铃铙之声出于金者，皆属乾、兑。此声音之论卦象。若为体，参详决之，如闻声音有欢笑之声，主有喜；悲愁之声，主有忧；歌唱之声，主快乐；怒号之声，主争喧。至若物声，则鸦声报灾，鹊声传喜，鸿雁声主远信，鸡凫之声为佳音。此类推声音之应也。 复明五色之应 五色不论卦象，但以所见之色推五行。青碧绿色属木，红紫赤色属火，白属金，黑属水，黄属土。外应之五行，详于内卦。体用生克、比和，吉凶可见。此五色之应也。 复明写字之应 淡中浓墨名为淬，浓墨中间薄似云，点画误书名鬼笔，定知贼在暗中缠。涕为流泪防丧服，定主忧惊梦里眠。鬼笔误书防窃盗，定知方位与通传。此写字之应验也。 遗论 万物卦数，本由于《易》。今观此书，止用五行生克之理。十应三要之诀，例不同《易》，何也？盖未有《易》书，先有《易》理。《易》书作于四圣之后，《易》理着于四圣之先。人心皆有《易》理，则于《易》也，占卜无所用卦，卦即《易》也。若得《易》卦爻，观其爻辞，以断吉凶悔吝，更为妙也，未尝不用《易》。又观寓物卦数，起例之篇，止用内卦，不用外卦，何也？盖泛泛起卦之诀，十应为传授之诀。若观梅例曰“今日观梅得革，知女折花，有伤股”，明日观梅得革，亦谓女子折花，可乎？占牡丹例曰：“今日算牡丹为马践毁”，异日算牡丹亦为马所践，可乎？是必明其理。又于地风升卦，无饮食之兆而知有人相请。此要外应诀之。 体用 凡占卜成卦，即画成三重：本卦、互卦、变卦也。使于本卦分体用，此一体一用也。以卦五行明生克比和之理，此一用卦。最切看互卦变卦，互变亦用也。此内之体用也。又次看应卦，亦用也。此合内外之体用也。然则不止一体一用，所谓体一用百也。生克即分体用，则论生克。生体则吉，克体则凶，比和则吉，不必论矣。生体多者则愈吉，克体多者则愈凶。然此卦生体，诸卦有克此卦者，彼灭其吉。此卦克体，诸卦又有克此卦者，稍解其穷。有生此卦者吉，有克此卦者凶。此体用之生克，然卦之生克，有不论体用者。如占天时，有震则有雷，有巽则有风，逢坎则有雨，逢离则晴。此一定之理。又有不然者，如论卦中乾、兑多，则震无雷，巽亦无风，又必有此诀也，皆隐然外卦之意。如观梅有女折花，算牡丹有马践，地风升有饮食兆。此又非外应之兆不能决也。 体用论 心易寓物之用，以体为主。然人如一体一用之常，不知一体百用之变。并体之变，全卦为内，卦内亦不知一用，而互变皆用也。三要十应之卦，外卦也，外亦不一，无非用也。学寓物者，得体用以为至术，十应则罕有之，后则三要以为全术。且谓体用自体用，三要自三要，遂以体用决吉凶，以三要为吉凶之兆。孰知三要、十应、体用之致？呜乎！体用不可无三要，十应不可无体用。体用、三要、十应，理无间然也。如此者，是谓心易之全术，而可以尽占卜之道也。又如乾、兑多则巽无风；坤、艮多则坎无雨；坎多，则离亦不晴。盖以乾、兑之金，克震、巽之木；坤、艮之土，克坎水；坎水克离火也。此又须通变而推验之。又若占饮食，有坎则有酒，有兑则有食。如遇坤、艮，则坎亦无酒，离值则兑亦无食。余皆可以类推。故举此二类，为心易生克之例耳。 衰旺论 既明生克，当看衰旺。旺者，如春震、巽木，夏离火，秋乾、兑金，冬坎水，四季之月坤、艮土是也。衰者，如春坤、艮，夏乾、兑，秋震、巽，冬离，四季之月坎是也。凡占卜，体卦宜盛旺。气旺而又逢生则吉，重遇克则凶。若体衰而逢克，则其凶甚矣。体衰而有生体之卦，则衰稍解。大抵体之卦宜旺，生体之卦气亦宜旺。克体之卦气宜衰。此心易论衰旺之诀也。 内外论 凡占卜，体用为内，诸应卦为外卦，此占卜之例也。诸应卦与三要之应，与十应之应，必合内外卦而断之也。苟不知合内外卦为断，谓体用自体用，三要十应自三要十应，如此则鲜见其有验者。然十应罕有知者，如前“奥论”云：金银为世宝，三要为吉者，若震、巽为体，则金克木，反为不吉。兵刃为世凶，三要为凶者，若坎为体，则金生水，反为不凶。占产见男子，谓有生子兆，设坎为体，少男为艮土，土克水，产反不吉。占疾见棺必死，若遇离体，则木生火而反吉。似此之类，则内卦不可无外卦，外卦不可无内卦。占卜之精者，无非合内外之道也。 动静 凡占决，虽明动静之机，然有理之常，有事之变。陽动而陰静，一动一静者，理之常；此静而彼动，一静百动者，事之变也。天下之事物，纷纷群动。我则以一静而待之。事物之动，各有其端，我则以一静而测之。不动不占，不因事不占。占卜之际，察其群物之事，物动而凶者，兆吾卦之凶；物动而吉者，兆吾卦之吉。然于闹喧市缠之地，人物杂扰，群物满前，何事拓何物为吉？吾占卜之应，此又推乎理而合其事。盖于群动之中，或观其身临吾耳目之近者，可以先见者，或以群事分明者，或吾之一念所在者，此发占之所用。若求名，则于群动之中，或于官府，或有文书及袍笏仪卫之物，则为得官之应。若占讼事，而忽逢笞杖枷锁之具，则讼终不吉。占病而不见衰麻棺椁之物者，病当无恙。凡此，所谓事事相关，物物相应，是以验吾占卦之切要也。至若坐则应迟，行则应速，走则愈速，卧则愈迟，此则察其动之端也。吾心本静，人来占卜，起念以应之，即动也。以此动而测彼动，于此之念而求彼之验，诚而神知之。知此者，可以知动静之机矣。 向背 凡占卜求应，必须审其向背。向者，为事物之应，相向而来。背者，谓事物之应，相背而去也。如鸦报灾，鸦飞适来，其灾将至；鸦飞而去，则灾已过去也。如鹊报喜，鹊飞适来，其喜将至；鹊飞已去，则喜已过去也。至于外应之卦皆然。其克体之卦，器物方来，其祸将至，去则祸散。其生体之卦，器物方来则吉，去则吉已过矣。其他应兆皆然。此为占卦向背至当理也。 静占 凡占在静室，无所闻见，则无外卦，即不论外卦。但以全卦年月日值五行衰旺之气，以体用决之。"},{"title":"体用生克篇三 | 梅花易数","date":"2017-10-17T15:39:26.000Z","path":"2017/10/17/yi-meihua-6/","text":"体用生克篇之三 三要灵应篇序 夫《易》者，性理之学也。性理，具于人心者也。当其方寸湛然，灵台皎洁，无一毫之干，无一尘之累，斯时也，性理具在而《易》存吾心，浑然是《易》也，其先天之《易》也。乃夫虑端一起，事根忽萌，物之着心，如云之蔽室，如尘之蒙镜，斯时也，汩没茫昧，而向之《易》存吾心者，泯焉尔。故三要之妙，在于运耳、目、心三者之虚灵，俾应于事物也，耳之聪，目之明，吾心实总乎聪明。盖事根于心，心该乎事，然事之未萌也，虽鬼神莫测其端，而吉凶祸福，无门可入。故先师曰：“思虑未动，鬼神不知；不由乎我，更由乎谁？”故事萌于心，鬼神知之矣。吉凶悔吝有其数，然吾预知之，何道欤？必曰：“求诸吾心易之妙而已矣。”于是寂然不动，静虑诚存，观变玩占，运乎三要，必使视之不见，吾见之；听之不闻者，吾闻之；如形之见视，如音之见告，吾之了然鉴之。则《易》之为卜筮之道，而《易》在吾心矣。三要不虚，而灵应之妙斯得也。是道也，寓至精至神之理，百姓日用而不知，安得圆通三昧者，与之论欤！此先师刘先生（江夏人，号湛然子）得之王屋山人高处士云岩。 宝庆四年，仲夏既望，清灵子朱虚拜首序 三要灵应篇 三要者，运耳、目、心三者之要也。灵应者，灵妙而应验也。夫耳之于听，目之于视，心之于思，三者为人一身之要，而万物之理不出于视听之外。占决之际，寂闻澄虑，静观万物，而听其音，知吉凶，见其形，知善恶，察其理，知祸福，皆可为占卜之验。如谷之应声，如影之随形，灼然可见也。其理出于《周易》“远取诸物，近取诸身”之法。是编则出于先贤先师，采世俗之语为例用之者：鬼谷子、严君平、东方朔、诸葛孔明；继而得者：邵康节、邵伯温、刘伯温、牛思晦、牛思继、高处士、刘湛然、富寿子、泰然子、朱清灵子。其年代相传不一，而不知其姓名者不与焉。 原夫天高地厚，万物散殊，陰浊陰清，五气顺布，祸福莫逃乎数，吉凶皆有其机。人为万物之灵，心乃一身之主，目寓而为形于色，耳得而为音于声，三要总之，万物备矣。 此乃天地万物之灵，而耳、目、心三者之要，故曰三要也。 是以遇吉兆而有吉，见凶识而不免乎凶。物之圆者事成，缺事败。此理断然，夫复何疑？ 此乃占物克应，见吉则吉，遇凶则凶。 是以云开见日，事必增辉；烟雾障空，物当失色。忽颠风而飘荡，遇震雷以虚惊。月忽当面，宜近清光。雨可沾衣，可蒙恩泽。 此乃仰观天文，以验人事。 重山为阻隔之际，重泽为浸润之深。水流而事通，土积而事滞。石乃坚心始得，沙乃放手即开。浪激主波涛之惊，坡崩主田土之失。旱沼之旁，心力俱竭，枯林之下，相貌皆衰。 此来俯察地理，以验人事。 适逢人品之来，实为事体之应。故荣宦显官，宜见其贵；富商匠贾，可问乎财。儿童哭泣忧子孙，吏卒叫嚣忌官讼。二男二女，重婚之义；一僧一道，独处之端。妇人笑语，则陰喜相逢；女子牵连，则陰私见累。匠氏，主门庭改换；宰夫，则骨肉分离。逢猎者，得野外之财；见渔者，有水边之利。见妊妇，则事荫于内；遇瞽者，则虑根于心。 此乃人品之应，以验人事。 至于摇手而莫为，或掉头而不肯，拭目而喷嚏者方泣；搔首而弹垢者有忧。足动者有行，交臂者有失。屈指者多阻节，嘘气者主悲忧。舌出掉者有是非，背相向者防闪失。偶攘臂者，争夺乃得；偶下膝者，屈抑而求。 此乃“近取诸身”之应。 若逢童子授书，有词讼之端；主翁笞仆，防责罚之事。讲论经史，事体徒间于虚说；语歌词曲，谋为转见悠扬。见博赌，主争斗之财；遇题写，主文书之事。偶携物者，受人提携；适挽手者，遇事牵连。 此乃人事之应。 及夫舟楫在水，凭其接引而行；车马登途，藉之负戴而往。张弓挟矢者，必领荐；有箭无弓者，未可试。持刀执刃，须求快利之方。披甲操戈，可断刚强之柄。缫丝者，事务繁冗。围棋者，眼目众多。妆花刻果，终非结实之因。书影描形，皆为装点之类。络绎将成，可以问职。笔墨俱在，可以求文。偶倾盖者，主退权。忽临镜者，可赴诏。抱贵器者，有非常之用。负大木者，有不小之财。升斗宜量料而前，尺剪可裁度以用。见蹴球，有人发剔。开锁钥，遇事疏通。逢补器，终久难坚。值磨镜，再成始得。顽斧磨钢者，迟钝得利。快刀砍木者，利事伤财。裁衣服者，破后方成。造瓦器者，成后乃破。奕棋者，取之以计。张纲者，摸之以空。或持斧锯恐有伤，或涤壶觞恐有饮。或挥扇者，有相招之义。或污衣者，防谋害之侵。 此乃器物之应，即“远取诸物”之意。 虽云草木之无情，亦与卜筮而有应。故芝兰为物之瑞，松柏为寿之坚。遇椿桧，则岁久年深；遇苗菰，则朝生暮死。占产占病，得之即死之兆。枝叶飘零当萎谢，根核流落主牵连。奇葩端的虚花，嘉果可以结实。 此乃草木之应。 至于飞走，最有祯祥。故乌鸦报灾，喜虫报喜，鸿雁主朋友之信，蛇虺防毒害之谋。鼠啮衣，有小口之灾；雀噪檐，有远行之至。犬斗恐招盗贼，鸡斗主有喧争。牵羊者，喜庆将临，骑马者，出入皆利。猿猴攀木，身心不定；鲤鱼出水，变化不凡。绳拴马，疾病难安；架陷禽，囚人末脱。 此乃禽兽之应。 酒乃忘忧之物，药乃怯病之方。故酒樽忽破，乐极生悲；医师道逢，难中有救。藤萝之类堪依倚，虎豹之象可施威。耕田锄地者，事势必翻。破竹剖竿者，事势必顺。春花秋月，虽无实而关景，夏绵冬葛，虽有用而背时。凉扇，多主弃捐；晴伞，渐逢闲废。泡沙电光，虚幻难信；蛛丝蚕茧，巧计方成。 此乃杂见观物之应。 若见物形，可知字体。故石逢皮则破；人傍木为休；笠漂水畔，泣字分明。火入山林，焚形可见。三女有奸私之扰，三牛有奔走之忧。一木两火，荣耀之光。一水四鱼，鳏寡之象。人继牛倒防失脱，人言犬中忧狱囚。一斗入空门者，斗争。两丝挂白木者，乐事。一人立门，诸事有闪。二人夹木，所问必来。 此为拆字之应。 复指物名，以叶音义。如见鹿可以问禄，见蜂可以言封。梨主分别，桃主逃走。见李则问讼得理，逢冠则问名得官。鞋为百事和谐，阖则诸事可合。难以详备，在于变通。 此即物叶音之义。 及夫在我之身，实为彼事之应。故我心忧者，彼事亦忧；我心乐者，彼事亦乐。我适闲，彼当从容；我值忙，彼当窘迫。 此即自己之应，“近取诸身”之义。 欲究观人之道，须详系《易》之辞。将叛者，其辞惭；将疑者，其辞支。吉人之辞寡，躁人之辞多。诬善之人，其辞游；失其守者，其辞屈。 此一动一静之应，“近取诸身”之义。 又推五行，须详八卦。卦吉而应吉终吉，卦凶而应凶终凶。卦应一吉一凶，事体半吉半凶。明生克之理，察动静之机，事事相关，物物相合，此五行八卦及克应动静之理。活法更存乎方寸，玄机又在于师传。纵万象之纷纭，惟一理而融贯。务要相机而发，须要临事而详。 此言占卜之理在于变通之妙。 嗟夫，方朔覆射，知事物之隐微。诸葛马前，定吉凶于顷刻。皇甫坐端之妙，淳风鸟觉之占，虽所用之有殊，诚此理之无异。 此言三要灵应妙处。 可以契鬼神之妙，可以会着龟之灵。然人非三世，莫能造其玄；心非七窍，莫能悟其奥。故得其说者，宜秘；非其人者，莫传。轻泄天机，重遭陰谴。造之深，可以入道。用之久，可以通神。 此言灵应之妙，不可轻传妄授，宜秘之一人，之以重斯道也。"},{"title":"题目汇总 | 梅花易数","date":"2017-10-16T08:36:11.000Z","path":"2017/10/16/yi-meihua-timu/","text":"观梅占 辰年十二月十七日申时，康节先生偶观梅，见二雀争枝坠地。先生曰：“不动不占，不因事不占。今二雀争枝坠地，怪也。”因占之，辰年五数，十二月十二数，十七日十七数，共三十四数，除四八三十二，余二，属兑，为上卦，加申时九数，总得四十三数，五八除四十，余得三数，为离，作下卦。又上下总四十三数，以六除，六七四十二，余一为动爻，是为泽火革。初爻变咸，互见乾巽。 断之曰：“详此卦，明晚当有女子折花，园丁不知而逐之，女子失惊坠地，逐伤其股。右兑金为体，离火克之。互中巽木，复三起离火，则克体之卦气盛。兑为少女，因知女子之被伤，而互中巽木，又逢乾金兑金克之，则巽木被伤，而巽为股，故有伤股之应。幸变为艮土，兑金得生，知女子但被伤，而不至凶危也。”（年月日时占例） 牡丹占 巳年三月十六日卯时，先生与客往司马公家共观牡丹。时值花开甚盛，客曰：“花盛如此，亦有数乎？”先生曰：“莫不有数。且因问而可占矣。”逐占之。以巳年六数，三月三数，十六日十六数，总得二十五数，除三八二十四数，余一数为乾，为上卦。卯时四数，共得二十九数，又除三八二十四数，余五为巽卦，作下卦，得天风姤。又以总计二十九数，以六除之，四六除二十四，得五爻动，变鼎卦，互见重乾。逐与客曰：“怪哉，此花明日午时，当为马所践毁。”众客愕然不信，次日午时，果有贵官观牡丹，二马相啮，群至花间驰骤，花尽为之践毁。 断之曰：“巽木为体，乾金克之，互卦又见重乾，克体之卦多矣，卦中无生意，固知牡丹必为践毁。所谓马者，乾为马也。午时者，离明之象，是以知之也。” 邻夜扣门借物占 冬夕酉时，先生方拥炉，有扣门者，初扣一声而止，继而又扣五声，且云借物。先生令勿言，令其子占之所借何物。以一声属乾为上卦，以五声属巽为下卦，又以一乾五巽共六数，加酉时数共得十六数，以六除之，二六一十二，得天风姤。第四爻变巽卦，互见重乾。卦中三乾金，二巽木，为金木之物也，又以乾金短，而巽木长，是借斧也。 子乃断曰：“金短木长者，器也，所借锄也。”先生曰：“非也。必斧也。”闻之，果借斧，其子问何故？先生曰：“起数又须明理。以卦推之，斧亦可也，锄亦可也；以理推之，夕晚安用锄？必借斧。盖斧切于劈柴之用耳。推数又须明理，为卜占之切要也。推数不推理，是不得也。学数者志之！”（系闻声占例） 今日动静如何 有客问曰：“今日动静如何？”逐将此六字占之。以乎分“今日动”三字为上卦。“今”平声，一数；“日”入声，四数；“动”去声，三数，共八数，得坤为上卦。以“静如何”为下卦，“静”去声，三数；“如”平声，一数；“何”平声，一数，共五数，得巽，为下卦。又以八五总为十三数，除二六一十二，余得一数，为地风升。初爻动，变泰卦，互见震、兑。逐为客曰：“今日有人相请，客不多，酒不醉，味至黍鸡而已。”至晚果然。 断曰：“升者，有升阶之义，互震、兑，有东西席之分。卦中兑为口，坤为腹，为口腹之事，故知有人相请。客不多者，坤土独立，无同类之卦气也。酒不醉，卦中无坎。味止黍鸡者，坤为黍稷耳。盖卦无相生之义，故知酒不多，食品不丰也。”（系声音占例） 西林寺牌额占 先生偶见西林寺之额，“林”字无两勾，因占之，以西字七画为艮，作上卦；以林八画为坤，作下卦。以上七画下八画总十五画，除二六一十二，余数得三，是山地剥卦。第三爻动，变艮，互见重坤。 断曰：寺者，纯陽之所居，今卦得重陰之爻，而又有群陰剥陽之兆。详此，则寺中当有陰人之祸。询之果然，逐谓寺僧曰：“何不添‘林’字两勾，则自然无陰人之祸矣。”僧信然，即添‘林’字两勾，寺果无事。 又，纯陽之人，所居得纯陰之卦，故不吉。又有群陰剥陽之义，故有陰人之祸。若添“林”字两勾，则十画，除八得二为兑卦，合上艮，是为山泽损。第五爻变，动为中孚卦，互卦见坤、震，损者益之，用互俱生体，为吉卦。可以得安矣。 以上并是先得数，以数起卦，所谓先天之数也。（系字画占例） 老人有忧色占 己丑日卯时，偶在途行，有老人往巽方，有忧色。问其何以有忧，曰无。怪而占之，以老人属乾为上卦，巽方为下卦，是天风姤；又以乾一巽五之数，加卯时四数，总十数，除六得四为动爻，是为天风姤之九四。《易》曰：“包无鱼，起凶。”是易辞不吉矣。以卦论之，巽木为体，乾金克之，互卦又见重乾，俱是克体，并无生气，且时在途行，其应速。逐以成卦之数中分而取其半，谓老人虫：“汝于五日内谨慎出入，恐有重祸。”果五日，此老赴吉席，因鱼骨鲠而终。 又凡占卜，克应之期看自己之动静，以决事之迟速，故行则应速，以逐成卦之数，中分而取其半也。坐则事应迟，当倍其成卦之数而定之也。立则半迟半速，止以成卦之数定之可也。虽然如是，又在变通，如占牡丹及观梅之类，则二日花皆朝夕之故，岂特成数之久也。（端法占例） 少年有喜色占 壬申日午时，有少年从离方来，喜形于色，问有何喜，曰无。逐占之，以少年属艮为上卦，离为下卦，得山火贲。以艮七离三加午时七，总十七数，除十二，余五为动爻，贲之六五爻曰：“贲于丘园，束帛戋戋，吝，终吉。”易辞已吉矣。卦则贲之家人，互见震、坎，离为体，互变俱生之。断曰：子于十七日内必有聘币之喜。至期，果然定亲。 牛哀鸣占 癸卯日午时，有牛鸣于坎方，声极悲，因占之。牛属坤，为上卦，坎方为下卦。坎六坤八，加午时七，共二十一数，除三六一十八，三爻动得地水师之三爻。《易辞》曰：“师或舆尸，凶。”卦则师变升，互坤、震，乃坤为体，互变俱克之，并无生气。 断曰：此牛二十一日内必遭屠杀。后二十日，人果买此牛，杀以犒众，悉皆异之。 鸡悲鸣占 甲申日卯时，有鸡鸣于乾方，声极悲怆，因占之。鸡属巽，为上卦，乾方为下卦，得风天小畜。以巽五乾一共六数，加卯时四数，总十数，除六得四，爻动变乾，是为小畜之六四。《易》曰：“有孚，血去惕出，无咎。”推之，割鸡之义。卦则小畜之乾，互见离、兑。乾金为体，离火克之。卦中巽木离火，有烹饪之象。 断曰：此鸡十日当烹。果十日客至，有烹鸡之验。 枯枝坠地占 戊子日辰时，偶行至中途，有树蔚然，无风，枯枝自坠地于兑方。占之，槁木为离，作上卦，兑方为下卦，得火泽睽。以兑二离三，加辰时五数，总十数，去六余四，变山泽损，是睽之九四。《易》曰：“睽孤，遇元夫。”卦火泽睽变损，互见坎、离，兑金为体，离火克之，且睽损卦名，俱有伤残之义。 断曰：此树十日当伐。果十日，伐树起公榭，而匠者适字“元夫”也。 以上诸占例，并是先得卦，以卦起数，所谓后天之数也。"},{"title":"知识 | 梅花易数","date":"2017-10-16T08:17:00.000Z","path":"2017/10/16/yi-meihua-zhi/","text":"乾，一；兑，二；离，三；震，四；巽，五；坎，六；艮，七；坤，八。 五行生克 金生水，水生木，木生火，火生土，土生金； 金克木，木克土，土克水，水克火，火克金。 八宫所属五行 乾、兑，金；坤、艮，土；震、巽，木；坎，水；离，火。 卦气旺 震、巽木旺于春，离火旺于夏，乾、兑金旺于秋，坎水旺于冬，坤、艮土旺于辰戌丑未月。 卦气衰 春坤、艮，夏乾、兑，秋震、巽，冬离，辰戌丑未坎。 十天干 甲乙东方木，丙丁南方火，戊己中央土，庚辛西方金，壬癸北方水。 十二地支 子水鼠，丑土牛，寅木虎，卯木兔，辰土龙，巳火蛇，午火马，未土羊，申猴金，酉金鸡，戌土犬，亥水猪。 八卦象例 乾三连，坤六断，震仰盂，艮覆碗，离中虚，坎中满，兑上缺，巽下断。 卦以八除，爻以六除 互卦只用八卦，不必取六十四卦名。互卦以重卦去了初爻及第六爻，二三四为下卦，三四五为上卦，看得何卦。 子年一数，丑年二数，直至亥年十二数。月如正月一数，直至十二月，亦作十二数。日数如初一一数，直至三十日，为三十数，子时一数直至亥时十二数 凡见有可数之物，即以此数起作上卦，以时数配作下卦。即以卦数并时数总除六取动爻。 二字为两仪平分。以一字为上卦，一字为下卦。 三字为三才。以一字为上卦，二字为下卦。 凡占群物之动，不可起卦。 凡占静物，有如江河山石，不可起卦。 若至屋宅、树木之类，则屋宅初创之时，树木初置之时，皆可起卦。至于器物，则置成之时可占，如枕、椅之类是矣。余则无故不占。 后天端法：以物为上卦，方位为下卦，合物卦之数与方卦之数加时数以取动爻。 离南坎北，震东兑西，人则介乎其中。 成卦之后先看《周易》爻辞，以断吉凶。如乾初九“潜龙勿用”，则诸事未可为，宜隐伏之类；九二“见龙在田，利见大人”，则宜谒见贵人之类。余皆仿此。 次看卦之体用，以论五行生克。体用即动静之说。体为主，用为事。应用生及比和，则吉；体生用及克体，则不吉。 又次看克应。如闻吉说见吉兆，则吉；闻凶说见凶兆，则凶。见圆物，事易成；见缺物，事终毁之类。 复验己身之动静。坐则事应迟，行则事应速，走则愈速，卧则愈迟之类。数者既备，可尽占卜之道，必须以易卦为主，克应次之。俱吉则大吉；俱凶则大凶；有凶有吉。则详审卦辞，及克用体应之类，以断吉凶也。要在圆机，不可执。 数说当也，必以理论之而后备。苟论数而不论理，则拘其一见而不验矣。且如饮食得震，则震为龙。以理论之，龙非可取，当取鲤鱼之类代之。又以天时之得震，当有雷声，若冬月占得震，以理论之，冬月岂有雷声，当有风撼震动之类。既知以上数条之诀，复明乎理，则占卜之道无余蕴矣。 故后天起卦定爻必加时而后可。又先天之卦，定事应之期，则取之卦气 凡占卜决断，固以体用为主，然有不拘体用者。如起例中西林寺额得山地剥，体用互变，俱比和，则为吉，而乃不吉，何也？盖寺者，纯陽人居之地，而纯陰爻象，则群陰剥陽之义显然也。此理甚明，不必拘体用也。盖用《易》断卦，当用理胜处验之，不可拘执于一也。 心易之数，得之者众，体用之诀，有之者罕。其要在于分体用之卦，察其五行生克、比和之理，而明乎吉凶悔吝之机也。 体卦为主，用卦为事，互卦为事之中间，刻应变卦为事之终。 凡占天时，不分体用，全观诸卦，详推五行。 人事之占，详观体用。体卦为主，用卦为宾。用克体不宜，体克用则吉。用生体有进益之喜，体生用有耗失之患。体用比和，谋为吉利。 占婚姻以体为主，用为婚姻。用生体，婚易成，或因婚有得；体生用，婚难成，或因婚有失。体克用，可成但成之迟；用克体，不可成，成亦有害。体用比和，婚姻吉利。 占婚，体为所占之家，用为所婚之家。体卦旺，则此家门户胜；用卦旺，则彼家资盛。生体，则得婚姻之财；或彼有相就之意；体生，则无嫁奁之资，或此去求婚方谐。若体用比和，则彼此相就，良配无疑。 三要者，运耳、目、心三者之要也。灵应者，灵妙而应验也。夫耳之于听，目之于视，心之于思，三者为人一身之要，而万物之理不出于视听之外。占决之际，寂闻澄虑，静观万物，而听其音，知吉凶，见其形，知善恶，察其理，知祸福，皆可为占卜之验。如谷之应声，如影之随形，灼然可见也。其理出于《周易》“远取诸物，近取诸身”之法。 十应固出于三要，而妙乎三要。但以耳目所得，如见吉兆而终须吉，若逢凶谶不免乎凶，理之自然也。然以此而遇吉凶，亦有未然者也"},{"title":"揲蓍法 | 易经","date":"2017-10-14T05:08:33.000Z","path":"2017/10/14/yi-pu-dayan/","text":"大衍之数五十，其用四十有九。分而为二以象两，挂一以象三，揲之以四以象四时，归奇于扐以象闰。五岁再闰，故再扐而后挂。天一，地二；天三，地四；天五，地六；天七，地八；天九，地十。天数五，地数五。五位相得而各有合，天数二十有五，地数三十，凡天地之数五十有五，此所以成变化而行鬼神也。乾之策二百一十有六，坤之策百四十有四，凡三百有六十，当期之日。二篇之策，万有一千五百二十，当万物之数也。是故四营而成《易》，十有八变而成卦，八卦而小成。引而伸之，触类而长之，天下之能事毕矣。显道神德行，使顾客易于酬酢，可与祐神矣。"},{"title":"体用生克篇二 | 梅花易数","date":"2017-10-14T05:03:30.000Z","path":"2017/10/14/yi-meihua-5/","text":"体用生克篇之二 天时占第一 凡占天时，不分体用，全观诸卦，详推五行。离多主晴，坎多主雨，坤乃陰晦，乾主晴明，震多则春夏雷轰，巽多则四时风烈，艮多则久雨必晴，兑多则不雨亦陰。夏占离多而无坎，则亢旱炎炎。冬占坎多而无离，则雨雪飘飘。 全观诸卦者，谓互变卦。五行属离属火，主晴；坎为水，主雨；坤为地气，主陰；乾为天，主晴明；震为雷，巽为风，秋冬震多无制，亦有非常之雷，有巽佐之，则为风撼雷动之应；艮为山云之气，若雨久，得艮则当止。艮者，止也，亦土克水之义。兑为泽，故不雨亦陰。夫以造化之辨固难测，理数之妙亦可凭，是以乾象乎天，四时晴明；坤体乎地，一气惨然。乾、坤两同，晴雨时变。坤、艮两并，陰晦不常。卜数有陽有陰，卦象有奇有偶。陰雨陽晴，奇偶暗重。坤为老陰之极，久晴必雨；乾为老陽之极，久雨必晴。若逢重坎重离，亦日时晴时雨。坎为水，必雨；离为火，必晴。乾、兑为金，秋明晴；坎之水，冬雪凛冽；坤、艮之土，春雨泽，夏火炎蒸。《易》曰：“云从龙，风从虎”。又曰：“艮为云，巽为风。”艮、巽重逢，风云际会，飞沙走石，蔽日藏山，不以四时，不必二用。坎在艮上，布雾兴云，若在兑上，凝霜作雪。乾、兑为霜雪雹霰，离火为日电虹霓。离为电，震为雷，重会而雷电俱作。坎为雨，巽为风，相逢而风雨骤兴。震卦重逢，雷惊百里。坎爻叠见，润泽九垓。故卦体之两逢，亦爻象之总断。地天泰，水天需，昏蒙之象。天地否，水地比，黑暗之形。爻纯离，夏必旱，四季皆晴。爻纯坎，冬必寒，四时必雨。久雨不晴，逢艮必止。久晴不雨，得此亦然。又若水火既济、火水未济，四时不测风云；风泽中孚，泽风大过，三冬必然雨雪。水山蹇，山水蒙，百步必须执盖。地风升，风地观，四时不可行船。离在艮上，暮雨朝晴，离互艮宫，暮晴朝雨。巽、坎互离，虹霞乃见，巽、离互坎，造化亦同。又须推测四时，不可执迷一理。震、离为电、为雷，应在夏天，乾、兑为霜、为雪，验于冬月。天地之理大矣哉！得斯文者，当敬宝之。 人事占第二 人事之占，详观体用。体卦为主，用卦为宾。用克体不宜，体克用则吉。用生体有进益之喜，体生用有耗失之患。体用比和，谋为吉利。更详观互卦、变卦，以断吉凶；复究盛衰，以明休咎。 人事之占，则以全体用总章向决吉凶。若有生体之卦，即看前章八卦中生体之卦有何吉；又看克体之卦有何凶，即看前章克体之卦。无生克，止断本卦。 家宅占第三 凡占家宅，以体为主，用为家宅。体克用，则家宅多吉，用克体，则家宅多凶。体生用，多耗散，或防失盗之忧。用生体，多进益，或有馈送之喜。体用比和，家宅安稳。如有生体之卦，即以前章人事占断之。 屋舍占第四 凡占屋舍，以体为主，用为屋舍。体克用，居之吉，用克体，居之凶。体生用，主资财衰退；用生体，则门户兴隆。体用比和，自然安稳。 婚姻占第五 占婚姻以体为主，用为婚姻。用生体，婚易成，或因婚有得；体生用，婚难成，或因婚有失。体克用，可成但成之迟；用克体，不可成，成亦有害。体用比和，婚姻吉利。 占婚，体为所占之家，用为所婚之家。体卦旺，则此家门户胜；用卦旺，则彼家资盛。生体，则得婚姻之财；或彼有相就之意；体生，则无嫁奁之资，或此去求婚方谐。若体用比和，则彼此相就，良配无疑。 乾：端正而长 坎：邪婬、黑色、嫉妒、奢侈 艮：色黄多巧 震：美貌难犯 巽：发少稀疏，丑陋心贪 离：短赤色，性不常 坤：貌丑，大腹而黄 兑：高长，语话喜悦，白色 生产占第六 占生产，以体为母，用为生。体用俱宜乘旺，不宜乘衰。宜相生，不宜相克。体克用不利于子；用克体不利于母。体克用而用卦衰，则子难完；用克体而体卦衰，则母难保。用生体，利于母；体生用，利于子。体用比和，生育顺快。若欲辨其男女，当于前卦审之。陽卦陽爻多者则生男，陰卦陰爻多者生女。陰陽卦爻相生，则察所占左右人之奇偶以证之。如欲决其日辰，则以用卦之气数参决之。所谓卦之气数者，即看何为用卦，于八卦时序之类次之。 饮食占第七 凡占饮食，以体为主，用为饮食。用生体，饮食必丰；体生用，饮食难就。体克用，则饮食有阻；用克体，饮食必无。体用比和，饮食丰足。又卦中有坎则有酒，有兑则有食。无坎无兑，则皆无。兑、坎生体，酒肉醉饱。欲知所食何物，以饮食推之。欲知席上何人，以互卦人事推之。 饮食人事类者，即前八卦内万物属类是也。 求谋占第八 占求谋，以体为主，用为所谋之事。体克用，谋虽可成，但成迟。用克体，求谋不成，谋亦有害。用生体。不谋而成；体生用，多谋少遂。体用比和，求谋称意。 求名占第九 凡占求名，以体为主，用为名。体克用，名可成，但成迟。用克体，名不可成。体生用，名不可就，或因名有丧。用生体，名易成，或因名有得。体用比和，功名称意。欲知名成之日，生体之卦气详之。欲知职任之处，变卦之方道决之。若无克体之卦，则名易就，止看卦体时序之类，以定日期。若在任占卜，最忌见克体之卦，如卦有克体者，即居官见祸，轻则上司责罚，重则削官退居。其日期，看克体之卦气者，于八卦所属时序类中断之。 求财占第十 占求财，以体为主，以用为财。体克用，有财；用克体，无财。体生用，财有损耗之忧；用生体，财有进益之喜。体用比和，财利快意。欲知得财之日，生体之卦气定之。欲知破财之日，克体卦气定之。 又若卦中有体克用之卦，及生体之卦，则有财，此卦气即见财之日。若卦中有克体之卦，及体生用之卦，即破财，此卦气破财之日。 交易占第十一 占交易，以体为主，用为财。体克用，有财；用克体，不成。体生用，难成，或因交易有失。用生体，即成，成必有财。体用比和，易成。 出行占第十二 占出行，以体为主，用为所行之应。体克用，可行，所至多得意。用克体，出则有祸。体生用，出行有破耗之失；用生体，有意外之财。体用比和，出行顺快。 又凡出行，体宜乘旺，诸卦宜生体。体卦乾、震多，主动。坤、艮多，不动。巽宜舟行，离宜陆行。坎妨失脱，兑主纷争。 行人占第十三 占行人，以体为主，用为行人。体克用，行人归迟；用克体，行人不归。体生用，行人未归；用生体，行人即归。体用比和，归期不日矣。 又以用卦看行人在外之情况。逢生，在外顺快；逢衰受克，在外灾殃。震多不宁，艮多有阻。坎有险难，兑主纷争。 谒见占第十四 占谒见，以体为主，用为所见之人。体克用，可见；用克体，不见。体生用，难见，见之而无益；用生体，可见，见之且有得。体用比和，欢然相见。 失物占第十五 占失物，以体为主，用为失物。体克用，可寻迟得；用克体，不可寻。体生用，物难见；用生体，物易寻。体用比和，物不失矣。 又以变卦为失物之所在。如变是乾，则觅于西北或公榭楼阁之所，或金石之傍，或圆器之中，或高亢之地。变卦是坤，则觅于西南方，或田野之所，或仓禀之处，或稼穑之处，或土窖穴藏之所，或瓦器方器之中。震则寻于东方，或山林之所，或丛棘之内，钟鼓之傍，或闹市之地，或大途之所。巽则寻于东南方，或山林之所，或寺观之地，或菜蔬之园，或舟居之间，或木器之内。坎则寻于北方，多藏于水边或溪井沟渠之处，或酒醋之边，或鱼盐之地。离则寻于南方，或疱厨之间，或炉冶之傍，或在明窗，或遗虚室，或在文书之侧，或在烟火之地。艮则寻于东北方，或山林之内，或近路边，或岩石傍，或藏土穴。兑则寻于西方，或居泽畔，或败垣破壁之内，或废井缺沼之中。 疾病占第十六 凡占疾病，以体为病人，用为病症。体卦宜旺不宜衰，体宜逢生，不宜见克。用宜生体，不宜克体。体克用，病易安；体生用，病难愈。体克用者，勿药有喜；用克体者，虽药无功。若体逢克而乘旺，犹为庶几。体遇克而更衰，断无存日。欲知凶中有救，生体之卦存焉。体生用者，迁延难好；用生体者，即愈。体用比和，疾病易安。若究和平之日，主卦决之。若详危厄之期，克体之卦定之。若论医药之属，当看生体之卦。如离卦生体，宜服热药；坎卦生体，宜服冷药，如艮温补；乾、兑凉药是也。 又有信鬼神之说，虽非《易》道，然不可谓《易》道之不该。姑以理推之。如卦有克体者，即可测其鬼神。乾卦克体，主有西北方之神，或兵刀之鬼，或天行时气，或乘正之邪神。坤则西南之神，或旷野之鬼，或连亲之鬼，或水土里社之神，或犯方隅，或无主之祟。震则东方之神，或木下之神，或妖怪百端，或影响时见。巽则东南之鬼，或自缢戕生，或枷锁致命。坎则北方之鬼，或水旁之神，或没溺而亡，或血疾之鬼。离则南方之鬼，或猛勇之神，或犯灶司，或得衍于香火，或焚烧之鬼。或遇热病而亡。艮则东北之神，或是山林之祟，或山魈木客，或土怪石精。兑则西方之神，或阵亡之鬼，或废疾之鬼，或刎颈戕生之鬼。卦中无克体之卦者，不必论之。 又问乾上坤下，占病如何断，尧夫曰：“乾上坤下第一爻动，便是生体之义。变为震木，互见巽艮，俱是生成之义，是谓不灾，逢生之日即愈。” 又问：“第二爻动如何？”曰：“是变为坎水，乃泄体败金之义。金入水乡，互见巽、离，乃为风火扇炉，俱为克体之义。更看占时外应如何，即为焚尸之象，断之死无疑矣。以春夏秋冬四季推之，更见详理。”又曰：“第三爻动，坤变艮土，俱在生体之义，不问互卦，亦断其吉无疑。”又曰：“第四爻动，乾变巽木，金木俱有克体之义，互吉亦凶。木有扛尸之义，金为砖椁之推。是必定之推，必定之理。”又曰：“第五爻动，乾变离，反能生体，互变俱生体，是其吉无疑。更有吉兆则愈吉。其断明矣。”又曰：“第六爻动，乾变兑，则能泄体，互见巽、艮，一凶一吉，其病非死必危。亦宜看兆吉凶，吉则言吉，凶则言凶。此断甚明。余卦皆仿此断，则心易无不验矣。” 官讼占第十七 占官讼，以体为主，用为对辞之人与官讼之应。体卦宜旺，用卦宜衰。体宜用生，不宜生用。宜生体，不宜克体。是故体克用者，已胜人；用克体者，人胜己。体生用，非为失理，或因官有所丧；用生体，不止得理，或因讼有所得。体用比和，官讼最吉。非但扶持之力，必有主和之义。 坟墓占第十八 占坟墓以体为主，用为坟墓。体克用，葬之吉；用克体，葬之凶。体生用，葬之主运退；用生体，葬之主兴隆，有荫益后嗣。体用比和，乃为吉地。大宜葬，葬之吉昌。 上为用体之诀，始发十八章占例，以示后学之法则。然庶务之多，岂止十八占而已乎！然此十八占，乃大事之切要者，占者以类而推之可也。"},{"title":"体用生克篇一 | 梅花易数","date":"2017-10-14T05:02:18.000Z","path":"2017/10/14/yi-meihua-4/","text":"卷二 体用生克篇之一 心易占卜玄机 天下之事有吉凶，托占以明其机。天下之理无形迹，假像以显其义。故乾有健之理，于马之类见之。故占卜寓吉凶之理，于卦象内见之。然卦象一定不易之理，而无变通之道，不可也。易者，变易而已矣。至如今日观梅复得革兆，有女子折花，异日果有女子折花，可乎。今日算牡丹得姤(gou)兆，为马所践，异日果为马所践毁，可乎。且兑之属，非止女子。乾之属，非止马。谓他人折花有毁，皆可切验之真，是必有属矣。嗟乎！占卜之道，要变通。得变通之道者，在乎心易之妙耳！ 占卜总决 大抵占卜之法，成卦之后先看《周易》爻辞，以断吉凶。如乾初九“潜龙勿用”，则诸事未可为，宜隐伏之类；九二“见龙在田，利见大人”，则宜谒见贵人之类。余皆仿此。 次看卦之体用，以论五行生克。体用即动静之说。体为主，用为事。应用生及比和，则吉；体生用及克体，则不吉。 又次看克应。如闻吉说见吉兆，则吉；闻凶说见凶兆，则凶。见圆物，事易成；见缺物，事终毁之类。 复验己身之动静。坐则事应迟，行则事应速，走则愈速，卧则愈迟之类。数者既备，可尽占卜之道，必须以易卦为主，克应次之。俱吉则大吉；俱凶则大凶；有凶有吉。则详审卦辞，及克用体应之类，以断吉凶也。要在圆机，不可执。 占卜论理诀 数说当也，必以理论之而后备。苟论数而不论理，则拘其一见而不验矣。且如饮食得震，则震为龙。以理论之，龙非可取，当取鲤鱼之类代之。又以天时之得震，当有雷声，若冬月占得震，以理论之，冬月岂有雷声，当有风撼震动之类。既知以上数条之诀，复明乎理，则占卜之道无余蕴矣。 先天后天论 先天卦断吉凶，止以卦论，不甚用《易》之爻辞。后天则用爻辞，兼用卦辞，何也？盖先天者未得卦、先得数，是未有《易》书，先有《易》理，辞前之《易》也。故不必用《易》书之辞，专以卦断。后天则以先得卦，必用卦画，辞后之《易》也。故用爻之辞，兼《易》卦辞以断之也。又后天起卦，与先天不同，其数不一。今人多以坎一、坤二、震三、巽四、中五、乾六、兑七、艮八、离九之数为用。盖圣人作《易》画卦，始乙太极、两仪、四象、八卦加一倍，数自成乾一、兑二、离三、震四、巽五、坎六、艮七、坤八。故占卜起卦，合以此数为用。又今人起后天卦，多不加时，得此一卦，止此一爻动，更无移易变通之道。故后天起卦定爻必加时而后可。又先天之卦，定事应之期，则取之卦气，如乾、兑则应如庚、辛及申金之日，或坤为戌、亥之日时，兑为酉日时。如震、巽当应于甲、乙及支木之日，或震取卯，巽取辰之类。后天则以卦数加时数，总之而分行卧坐立之迟速，以为事应之期。卦数时类，应近而不能决诸远者，必合先后之卦数取诀可也。又凡占卦中决断吉凶，其理洞见，止于全卦体用生克之理，及参《易》辞，斯可矣。今日以后天卦，却于六十甲子之日取其对方之魁，破败亡灭迹等以助断决。盖历象选时，并于《周易》不相干涉，不可用也。 卦断遗论 凡占卜决断，固以体用为主，然有不拘体用者。如起例中西林寺额得山地剥，体用互变，俱比和，则为吉，而乃不吉，何也？盖寺者，纯陽人居之地，而纯陰爻象，则群陰剥陽之义显然也。此理甚明，不必拘体用也。又若有人问：“今日动静如何？”得地风升，初爻动，用克体卦，俱无饮食矣，而亦有人相请，虽饮食不丰而终有请，何也？此人当时必有当日之应，又有“如何”二安带口，为重兑之义。又有用不生体，互变生之而吉者，若少年有喜色，占得山火贲(ben)是也。又有用不生体，互变俱克之而凶者，如牛哀鸣占得地水师是也。盖少年有喜色，占则略知其有喜，而《易辞》又有“束帛戋戋”之吉，是二者俱吉，互变俱生，愈见其吉矣。虽用不生体不吉，不为其害也。牛鸣之哀，则略知其有凶，而易爻复有“舆尸”之凶，互变俱克，愈见其凶。虽用爻不克，不能掩其凶也。盖用《易》断卦，当用理胜处验之，不可拘执于一也。 八卦心易体用诀 心易之数，得之者众，体用之诀，有之者罕。余幼读《易》书，长参数学，始得心易卦数。初见起例，以知占其吉凶。如以蠡(li)测海，茫然无涯。后得智人见授体用心易之诀，而后占事之诀，疑始有定。据验则验。如繇(yao)基射的，百发百中。其要在于分体用之卦，察其五行生克、比和之理，而明乎吉凶悔吝之机也。于是易数之妙始见，而《易》道之卦义备矣。乃世有真实，人罕遇之耳。得此者，幸甚秘之！ 体用总诀 体用云者，如易卦具卜筮之道，则易卦为体，以卜筮用之，此所谓体用者，借体用二字以寓动静之卦，以分主客之兆，以为占例之准则也。大抵体用之说，体卦为主，用卦为事，互卦为事之中间，刻应变卦为事之终。应体之卦气宜盛不宜衰。盛者如春震、巽、秋乾、兑，夏离，冬坎，四季之月坤、艮是也。衰者，春坤、艮，秋震、巽，夏乾兑，冬离，四季之月坎是也。 宜受他卦之生，不宜他卦之克。他卦者，谓用互变也。生者，如乾、兑金体，坤、艮生之，坤、艮土体，离火生之。离，火体，震巽木生之。余皆仿此。克者，如金体火克，火体水克之类。体用之说，动静之机，八卦主宾。五行生克，体为己身之兆，用为应事之端。体宜受用卦之生，用宜见卦体之克。体盛则吉，体衰则凶。用克体固不宜，体生用亦非利。体党多而体势盛，用党多则体势衰。如卦体是金，而互变皆金，则是体之党多。如用卦是金，而互变皆金，则是用之党多。体生用，为之泄气，如夏火逢土，亦泄气。 体用之间，比和则吉，互乃中间之应，变乃末后之期。故用吉变凶者，先吉后凶；用凶变吉者，先凶后吉。体克用，诸事吉；用克体，诸事凶。体生用，有耗失之患；用生体，有进益之喜。体用比和，则百事顺遂。又卦中有生体之卦，看是何卦。 乾卦生体，则主公门中有喜益，或功名上有喜，或因官有财，或问讼得理，或有金宝之利，或有老人进财，或尊长惠送，或有官贵之喜。 坤卦生体，主有田土之喜，或有田土进财，或得乡人之益，或得陰人之利，或有果谷之利，或有布帛之喜。 震卦生体，则主山林之益，或因山林得财，或进东方之财，或因动中有喜，或有木货交易之利，或因草木姓氏人称心。 巽卦生体，亦主山林之益，或因山林得财，或于东南得财，或因草木姓人而进利，或以茶果得利，或有茶果菜蔬之喜。 坎卦生体，有北方之喜，或受北方之财，或水边人进利，或因点水人称心，或有因鱼盐酒货文书交易之利，或有馈送鱼盐酒之喜。 离卦生体，主有南方之财，或有文书之喜，或有炉冶场之利，或因火姓人而得财。 艮卦生体，有东北方之财，或山田之喜，或因山林田土获财，或得宫音带土人之财。物当安稳，事有终始。 兑卦生体，有西方之财，或喜悦事，或有食物金玉货利之源，或商音之人，或带口之人欣逢，或主宾之乐，或朋友讲习之事。 又看卦中有克体之卦者，看是何卦。如乾卦克体，主有公事之忧，或门户之忧，或有财宝之失，或于金谷有损，或有怒于尊长，或得罪于贵人。 坤卦克体，主有田土之忧，或于田土有损，或有陰人之侵，或有小人之害，或失布帛之财，或丧谷粟之利。 震卦克体，主有虚惊，常多恐惧，或身心不能安静，或家宅见妖灾，或草木姓氏之人相侵，或于山林有所失。 巽卦克体，亦有草木姓人相害，或于山林上生忧。谋事，乃东南方之人； 处家，忌陰人小口之厄。 坎卦克体，主有险陷之事，或寇盗之忧，或失意于水边人，或生灾于酒后，或点水人相害，或北方人见殃。 离卦克体，主文书之忧，或失火之惊，或有南方之忧，或火人相害。 艮卦克体，诸事多违，百谋中阻。或有山林田土之失，或带土人相侵，防东北方之祸害，或忧坟墓不当。 兑卦克体，不利西方，主口舌事之纷争。或带口人侵欺，或有毁折之患，或因饮食而生忧。生克不逢，则止以本卦而论之。"},{"title":"象数义理篇三 | 梅花易数","date":"2017-10-14T05:01:16.000Z","path":"2017/10/14/yi-meihua-3/","text":"象数易理篇之三 八卦类象 乾：玄黄、大赤色、金玉、宝珠、镜、狮、圆物、木果、贵物、冠、象、马、天鹅、刚物。 坎：水、带子带核之物、豕鱼、弓轮、水具、水中之屋、盐、酒、黑色。 艮：土石、黄色、虎、狗、土中之物、瓜果、百禽、鼠、黔喙之属。 震：竹木、青碧绿色、龙、蛇、 苇、竹木乐器、草、蕃鲜之物。 巽：木、蛇、长物、青碧绿色、山木之禽鸟、、香、鸡、直物、竹木之器、工巧之器。 离：火、文书、干戈、雉、龟、蟹、槁木、甲胄、螺、蚌、鳖、赤色。 坤：土、方物、五谷、柔物、丝绵、百禽、牛、布帛、舆、金、瓦器、黄色。 兑：金刃、金器、乐器、泽中之物、白色、有口缺之物、羊。 八卦万物属类 乾卦 一 金 乾为天 天风姤 天山遁 天地否 风地观 山地剥 火地晋 火天大有 天时：天、冰、雹、霰。 地理：西北方、京都、大郡、形胜之地、高亢之所。 人物：君、父、大人、老人、长者、官宦、名人、公门人。 人事：刚健武勇、果决、多动少静、高上下屈。 身体：首、骨、肺。 时序：秋、九十月之交、戌亥年月日时、一四九年月日时。 动物：马、天鹅、狮、象。 静物：金玉、宝珠、圆物、水果、刚物、冠、镜。 屋舍：公廨、楼台、高堂、大厦、驿舍、西北向之居。 家宅：秋占宅兴隆、夏占有祸、冬占冷落、春占吉利。 婚姻：贵官之眷、有声名之家、秋占宜成、冬夏占不利。 饮食：马肉、珍味、多骨、肝肺、干肉、水果、诸物之首、圆物、辛辣之物。 生产：易生、秋占生贵子，夏占有损，坐宜向西北。 求名：有名、宜随朝内任、刑官、武职、掌权、天使、驿官、宜西北方之任。 谋旺：有成、利公门、宜动中有财、夏占不成、冬占多谋少遂。 交易：宜金、玉珍宝珠贵货、易成、夏占不利。 求利：有财、金、玉之利、公门中得财、秋占大利、夏占损财、冬占无财。 出行：利于出行、宜入京师、利西北之行、夏占不利。 谒见：利见大人、有德行之人、宜见官贵、可见。 疾病：头面之疾、肺疾、筋骨疾、上焦疾、夏占不安。 官讼：健讼、有贵人助、秋占得胜、夏占失理。 坟墓：宜向西北、宜乾山气脉、宜天穴、宜高、秋占出贵、夏占大凶。 方道：西北。 五色：大赤色、玄色。 姓字：带金旁者、商音、行位一四九。 数目：一、四、九。 五味：辛、辣。 坤卦 八 土 坤为地 地雷复 地泽临 地天泰 雷天大壮 泽天决 水天需 水地比 天时：云陰、雾气。 地理：田野、乡里、平地、西南方。 人物：老母、后母、农夫、乡人、众人、大腹人。 人事：吝啬、柔顺、懦弱、众多。 身体：腹、脾、胃、肉。 时序：辰戌丑未月、未申年月日时、八五十月日。 静物：方物、柔物、布帛、丝绵、五谷、舆釜、瓦器。 动物：牛、百兽、牝马。 屋舍：西南向、村居、田舍、矮屋、土阶、仓库。 家宅：安稳、多陰气、春占宅舍不安。 饮食：牛肉、土中之物、甘味、野味、五谷之味、芋笋之物、腹脏之物。 婚姻：利于婚姻、宜税产之家、乡村之家、或寡妇之家、春占不利。 生产：易产、春占难产、有损、或不利于母、坐宜西南方。 求名：有名、宜西南方或教官、农官守土之职、春占虚名。 交易：宜利交易、宜田土交易、宜五谷、利贱货、重物、布帛、静中有财、春占不利。 求利：有利、宜土中之利、贱货重物之利、静中得财、春占无财、多中取利。 谋旺：利求谋、乡里求谋、静中求谋、春占少遂、或谋于妇人。 出行：可行、宜西南行、宜往乡里行、宜陆行、春占不宜行。 谒见：可见、利见乡人、宜见亲朋或陰人、春不宜见。 疾病：腹疾、脾胃之疾、饮食停伤、谷食不化。 官讼：理顺、得众情、讼当解散。 坟墓：宜向西南之穴、平陽之地、近田野、宜低葬、春不可葬。 姓字：宫音、带土姓人、行位八五十。 数目：八、五、十。 方道：西南。 五味：甘。 五色：黄、黑。 震卦 四 木 震为雷 雷地豫 雷水解 雷风恒 地风升 水风井 泽风大过 泽雷随 天时：雷。 地理：东方、树木、闹市、大途、竹林、草木茂盛之所。 人物：长男。 人事：起动、怒、虚惊、鼓动噪、多动少静。 身体：足、肝、发、声音。 时序：春三月、卯年月日时、四三八月日。 静物：木竹、萑苇、乐器（属竹木者）、花草繁鲜之物。 动物：龙、蛇。 屋舍：东向之居、山林之处、楼阁。 家宅：宅中不时有虚惊、春冬吉、秋占不利。 饮食：蹄、肉、山林野味、鲜肉、果酸味、菜蔬。 婚姻：可、有成、声名之家、得长男之婚、秋占不宜婚。 求利：山林竹木之财、动处求财、或山林、竹木茶货之利。 求名：有名、宜东方之任、施号发令之职、掌刑狱之官、竹茶木税课之任、或闹市司货之职。 生产：虚惊、胎动不安、头胎必生男、坐宜东向、秋占必有损。 疾病：足疾、肝经之疾、惊怖不安。 谋旺：可旺、可求、宜动中谋、秋占不遂。 交易：利于成交、秋占难成、动而可成、山林、木竹茶货之利。 官讼：健讼、有虚惊、行移取甚反复。 谒见：可见、在山林之人、利见宜有声名之人。 出行：宜行、利于东方、利山林之人、秋占不宜行、但恐虚惊。 坟墓：利于东向、山林中穴、秋不利。 姓字：角音、带木姓人、行位四八三。 数目：四、八、三。 方道：东。 五味：甘、酸味。 五色：青、绿、碧 巽卦 五 木 巽为风 风天小畜 风火家人 风雷益 天雷无妄 火雷噬嗑 山雷颐 山风蛊 天时：风。 地理：东南方之地、草木茂秀之所、花果菜园。 人物：长女、秀士、寡妇之人、山林仙道之人。 人事：柔和、不定、鼓舞、利市三倍、进退不果。 身体：肱、股、气、风疾。 时序：春夏之交、三五八之时月日、辰巳月日时。 静物：木香、绳、直物、长物、竹木、工巧之器。 动物：鸡、百禽、山林中之禽、虫。 屋舍：东南向之居、寺观楼台、山林之居。 家宅：安稳利市、春占吉、秋占不安。 饮食：鸡肉、山林之味、蔬果酸味。 婚姻：可成、宜长女之婚、秋占不利。 生产：易生、头胎产女、秋占损胎、宜向东南坐。 求名：有名、宜文职有风宪之力、宜为风宪、宜茶果竹木税货之职、宜东南之任。 求利：有利三倍、宜山林之利、秋占不利、竹货木货之利。 交易：可成、进退不一、利山林交易、山林木茶之利。 谋旺：可谋旺、有财可成、秋占多谋少遂。 出行：可行、有出入之利、宜向东南行、秋占不利。 谒见：可见、利见山林之人、利见文人秀士。 疾病：股肱之疾、风疾、肠疾、中风、寒邪、气疾。 姓字：角音、草木旁姓氏、行位五三八。 官讼：宜和、恐遭风宪之责。 坟墓：宜东南方向、山林之穴、多树木、秋占不利。 数目：五、三、八。 方道：东南。 五味：酸味。 五色：青、绿、碧、洁白。 坎卦 六 水 坎为水 水泽节 水雷屯 水火既济 泽火革 雷火丰 地火明夷 地水师 天时：月、雨、雪、霜、露。 地理：北方、江湖、溪涧、泉井、卑湿之地（沟渎、池沼、凡有水处）。 人物：中男、江湖之人、舟人、资贼。 人事：险陷卑下、外示以柔、内序以利、漂泊不成、随波逐流。 身体：耳、血、肾。 时序：冬十一月、子年月日时、一六月日。 静物：水带子、带核之物、弓轮、矫揉之物、酒器、水具。 屋舍：向北之居、近水、水阁、江楼、花酒长器、宅中混地之处。 饮食：豕肉、酒、冷味、海味、汤、酸味、宿食、鱼、带血、掩藏、有带核之物、水中之物、多骨之物。 家宅：不安、暗昧、防盗。 婚姻：利中男之婚、宜北方之婚、辰戌丑未月婚不可。 生产：难产有险、宜次胎、中男、辰戌丑未月有损、宜北向。 求名：艰难、恐有灾险、宜北方之任、鱼盐河泊之职。 求利：有财失、宜水边财、恐有失陷、宜鱼盐酒货之利、防遗失、防盗。 交易：不利成交、恐防失陷、宜水边交易、宜鱼盐货之交易、或点水人之交易。 谋旺：不宜谋旺、不能成就、秋冬占可谋旺。 出行：不宜远行、宜涉舟、宜北方之行、防盗、恐遇险陷溺之事。 谒见：难见、宜见江湖之人、或有水旁姓氏之人。 疾病：耳痛、心疾、感寒、肾疾、胃冷、水泻、痼冷之病、血病。 官讼：不利、有陰险、有失、因讼、失陷。 坟墓：宜北向之穴、近水傍之墓、不利葬。 姓字：羽音、点水旁之姓氏、行位一六。 数目：一、六。 方道：北方。 五味：咸、酸。 五色：黑。 离卦 三 火 离为火 火山旅 火风鼎 火水末济 山水蒙 风水涣 天水讼 天火同人 天时：日、电、虹、霓、霞。 地理：南方、干亢之地、窖灶、炉冶之所、刚燥厥地、其地面陽。 人物：中女、文人、大腹、目疾人、甲胄之士。 人事：文画之所、聪明才学、相见虚心、书事。 身体：目、心、上焦。 时序：夏五月、午火年月日时、三二七日。 静物：火、书、文、甲胄、干戈、槁衣、干燥之物、赤色之物。 动物：雉、龟、鳖、蟹、螺、蚌。 屋舍：南舍之居、陽明之宅、明窗、虚室。 家宅：安稳、平善、冬占不安、克体主火灾。 饮食：雉肉、煎炒、烧炙之物、干脯之体、热肉。 婚姻：不成、利中女之婚、夏占可成、冬占不利。 生产：易生、产中女、冬占有损、坐宜向南。 求名：有名、宜南方之职、文官之任、宜炉冶亢场之职。 求利：有财宜南方求、有文书之财、冬占有失。 谋旺：可以谋旺、宜文书之事。 交易：可成、宜有文书之交易。 出行：可行、宜向南方、就文书之行、冬占不宜行、不宜行舟。 谒见：可见南方人、冬占不顺、秋见文书考案之士。 官讼：易散、文书动、辞讼明辨。 疾病：目疾、心疾、上焦热病、夏占伏暑、时疫。 坟墓：南向之幕、无树木之所、陽穴。夏占出文人、冬占不利。 姓字：徵音、立人旁士姓氏、行位三二七。 数目：三、二、七。 方道：南。 五色：赤、紫、红。 五味：苦。 艮卦 七 土 艮为山 山火贲 山天大畜 山泽损 火泽睽 天泽履 风泽中孚 风山渐 天时：云、雾、山岚。 地理：山径路、近山城、丘陵、坟墓、东北方。 人物：少男、闲人、山中人。 人事：阻隔、守静、进退不决、反背、止住、不见。 身体：手指、骨、鼻、背。 时序：冬春之月、十二月丑寅年月日时、七五十数月日、土年月日时。 静物：土石、瓜果、黄物、土中之物。 动物：虎、狗、鼠、百兽、黔啄之物。 家宅：安稳、诸事有阻、家人不睦、春占不安。 屋舍：东北方之居、山居近石、近路之宅。 饮食：土中物味、诸兽之肉、墓畔竹笋之属、野味。 婚姻：阻隔难成、成亦迟、利少男之婚、春占不利、宜对乡里婚。 求名：阻隔无名、宜东北方之任、宜土官山城之职。 求利：求财阻隔、宜山林中取财、春占不利、有损失。 生产：难生、有险阻之厄、宜向东北、春占有损。 交易：难成、有山林田土之交易、春占有失。 谋旺：阻隔难成、进退不决。 出行：不宜远行、有阻、宜近陆行。 谒见：不可见、有阻、宜见山林之人。 疾病：手指之疾、脾胃之疾。 官讼：贵人阻滞、官讼未解、牵连不决。 坟墓：东北之穴、山中之穴、春占不利、近路旁有石。 数目：五、七、十。 方道：东北方。 五色：黄。 五味：甘。 兑卦 二 金 兑为金 泽水困 泽地萃 泽山咸 水山蹇 地山谦 雷山小过 雷泽归妹 天时：雨泽、新月、星。 地理：泽、水际、缺池、废井、山崩破裂之地、其地为刚卤。 人物：少女、妾、歌妓、伶人、译人、巫师。 人事：喜悦、口、谗毁、谤说、饮食。 身体：舌、口喉、肺、痰、涎。 时序：秋八月、酉年月日时、二四九月日。 静物：金刀、金类、乐器、废物、缺器。 动物：羊、泽中之物。 屋舍：西向之居、近泽之居、败墙壁宅、户有损。 家宅：不安、防口舌、秋占喜悦、夏占家宅有祸。 饮食：羊肉、泽中之物、宿味、辛辣之味。 婚姻：不成、秋占可成、有喜、主成婚之吉、利婚少女、夏占不利。 生产：不利、恐有损胎或则生女、夏占不利、宜坐向西。 求名：难成、因名有损、利西之任、宜刑官、武职、伶官、译官。 求利：无利、有损、财利、主口舌、秋占有财喜、夏占破财。 出行：不宜远行、防口舌、或损失、宜西行、秋占宜行有利。 交易：难利、防口舌、有争竞、夏占不利、秋占有交易之财。 谋旺：难成、谋中有损、秋占有喜、夏占不遂。 谒见：利行西方、见有咒诅。 疾病：口舌、咽喉之疾、气逆喘疾、饮食不飧。 坟墓：宜西向、防穴中有水、近泽之墓、夏占不宜、或葬废穴。 官讼：争讼不已、曲直未决、因讼有损、防刑、秋占为体得理胜讼。 姓字：商音、带口带金字旁姓氏、行位四二九。 数目：四、二、九。 方道：西方。 五色：白。 五味：辛、辣。 右万物之象，庶事之多不止于此。占者宜各以其类而推之耳。"},{"title":"象数义理二 | 梅花易数","date":"2017-10-14T05:00:14.000Z","path":"2017/10/14/yi-meihua-2/","text":"象数易理篇之二 物卦起例（端法后天起卦） 后天端法：以物为上卦，方位为下卦，合物卦之数与方卦之数加时数以取动爻。 八卦万物属类（并为上卦） 乾：天、父、老人、官贵、头、骨、马、金宝、珠玉、水果、圆物、冠、镜、刚物、大赤色、水寒。 坤：地、母、老妇、土、牛、金、布帛、文章、舆辇、方物、柄、黄色、瓦器、腹、裳、黑色、黍稷、书、米、谷。 震：雷、长男、足、发、龙、百虫、蹄、竹、萑苇、马鸣、馵足、的颡、稼、乐器之类、草木、青碧绿色、树、木核、柴、蛇。 巽：风、长女、僧尼、鸡、股、百禽、百草、臼、香气、臭、绳、眼、羽毛、帆、扇、枝叶之类、仙道工匠、直物、工巧之器。 坎：水、雨、雪、工、豕、中男、沟渎、弓轮、耳、血、月、盗、宫律、栋、丛棘、狐、蒺藜、桎梏、水族、鱼、盐、酒、醢、有核之物、黑色。 离：火、雉、日、目、电、霓霞、中女、甲胄、戈兵、文书、槁木、炉、兽、鳄龟蟹蚌、凡有壳之物、红赤紫色、花纹人、干燥物。 艮：山、土、少男、童子、狗、手指、径路、门阙、果、蓏、阍寺、鼠、虎、狐、黔喙之属、木生之物、藤生之物、爪、鼻。黄色。 兑：泽、少女、巫、舌、妾、肺、羊、毁折之物、带口之器、属金者、废缺之物、奴仆、婢。 八卦方位图 离南坎北，震东兑西，人则介乎其中。 观梅占 辰年十二月十七日申时，康节先生偶观梅，见二雀争枝坠地。先生曰：“不动不占，不因事不占。今二雀争枝坠地，怪也。”因占之，辰年五数，十二月十二数，十七日十七数，共三十四数，除四八三十二，余二，属兑，为上卦，加申时九数，总得四十三数，五八除四十，余得三数，为离，作下卦。又上下总四十三数，以六除，六七四十二，余一为动爻，是为泽火革。初爻变咸，互见乾巽。 断之曰：“详此卦，明晚当有女子折花，园丁不知而逐之，女子失惊坠地，逐伤其股。右兑金为体，离火克之。互中巽木，复三起离火，则克体之卦气盛。兑为少女，因知女子之被伤，而互中巽木，又逢乾金兑金克之，则巽木被伤，而巽为股，故有伤股之应。幸变为艮土，兑金得生，知女子但被伤，而不至凶危也。”（年月日时占例） 牡丹占 巳年三月十六日卯时，先生与客往司马公家共观牡丹。时值花开甚盛，客曰：“花盛如此，亦有数乎？”先生曰：“莫不有数。且因问而可占矣。”逐占之。以巳年六数，三月三数，十六日十六数，总得二十五数，除三八二十四数，余一数为乾，为上卦。卯时四数，共得二十九数，又除三八二十四数，余五为巽卦，作下卦，得天风姤。又以总计二十九数，以六除之，四六除二十四，得五爻动，变鼎卦，互见重乾。逐与客曰：“怪哉，此花明日午时，当为马所践毁。”众客愕然不信，次日午时，果有贵官观牡丹，二马相啮，群至花间驰骤，花尽为之践毁。 断之曰：“巽木为体，乾金克之，互卦又见重乾，克体之卦多矣，卦中无生意，固知牡丹必为践毁。所谓马者，乾为马也。午时者，离明之象，是以知之也。” 邻夜扣门借物占 冬夕酉时，先生方拥炉，有扣门者，初扣一声而止，继而又扣五声，且云借物。先生令勿言，令其子占之所借何物。以一声属乾为上卦，以五声属巽为下卦，又以一乾五巽共六数，加酉时数共得十六数，以六除之，二六一十二，得天风姤。第四爻变巽卦，互见重乾。卦中三乾金，二巽木，为金木之物也，又以乾金短，而巽木长，是借斧也。 子乃断曰：“金短木长者，器也，所借锄也。”先生曰：“非也。必斧也。”闻之，果借斧，其子问何故？先生曰：“起数又须明理。以卦推之，斧亦可也，锄亦可也；以理推之，夕晚安用锄？必借斧。盖斧切于劈柴之用耳。推数又须明理，为卜占之切要也。推数不推理，是不得也。学数者志之！”（系闻声占例） 今日动静如何 有客问曰：“今日动静如何？”逐将此六字占之。以乎分“今日动”三字为上卦。“今”平声，一数；“日”入声，四数；“动”去声，三数，共八数，得坤为上卦。以“静如何”为下卦，“静”去声，三数；“如”平声，一数；“何”平声，一数，共五数，得巽，为下卦。又以八五总为十三数，除二六一十二，余得一数，为地风升。初爻动，变泰卦，互见震、兑。逐为客曰：“今日有人相请，客不多，酒不醉，味至黍鸡而已。”至晚果然。 断曰：“升者，有升阶之义，互震、兑，有东西席之分。卦中兑为口，坤为腹，为口腹之事，故知有人相请。客不多者，坤土独立，无同类之卦气也。酒不醉，卦中无坎。味止黍鸡者，坤为黍稷耳。盖卦无相生之义，故知酒不多，食品不丰也。”（系声音占例） 西林寺牌额占 先生偶见西林寺之额，“林”字无两勾，因占之，以西字七画为艮，作上卦；以林八画为坤，作下卦。以上七画下八画总十五画，除二六一十二，余数得三，是山地剥卦。第三爻动，变艮，互见重坤。 断曰：寺者，纯陽之所居，今卦得重陰之爻，而又有群陰剥陽之兆。详此，则寺中当有陰人之祸。询之果然，逐谓寺僧曰：“何不添‘林’字两勾，则自然无陰人之祸矣。”僧信然，即添‘林’字两勾，寺果无事。 又，纯陽之人，所居得纯陰之卦，故不吉。又有群陰剥陽之义，故有陰人之祸。若添“林”字两勾，则十画，除八得二为兑卦，合上艮，是为山泽损。第五爻变，动为中孚卦，互卦见坤、震，损者益之，用互俱生体，为吉卦。可以得安矣。 以上并是先得数，以数起卦，所谓先天之数也。（系字画占例） 老人有忧色占 己丑日卯时，偶在途行，有老人往巽方，有忧色。问其何以有忧，曰无。怪而占之，以老人属乾为上卦，巽方为下卦，是天风姤；又以乾一巽五之数，加卯时四数，总十数，除六得四为动爻，是为天风姤之九四。《易》曰：“包无鱼，起凶。”是易辞不吉矣。以卦论之，巽木为体，乾金克之，互卦又见重乾，俱是克体，并无生气，且时在途行，其应速。逐以成卦之数中分而取其半，谓老人虫：“汝于五日内谨慎出入，恐有重祸。”果五日，此老赴吉席，因鱼骨鲠而终。 又凡占卜，克应之期看自己之动静，以决事之迟速，故行则应速，以逐成卦之数，中分而取其半也。坐则事应迟，当倍其成卦之数而定之也。立则半迟半速，止以成卦之数定之可也。虽然如是，又在变通，如占牡丹及观梅之类，则二日花皆朝夕之故，岂特成数之久也。（端法占例） 少年有喜色占 壬申日午时，有少年从离方来，喜形于色，问有何喜，曰无。逐占之，以少年属艮为上卦，离为下卦，得山火贲。以艮七离三加午时七，总十七数，除十二，余五为动爻，贲之六五爻曰：“贲于丘园，束帛戋戋，吝，终吉。”易辞已吉矣。卦则贲之家人，互见震、坎，离为体，互变俱生之。断曰：子于十七日内必有聘币之喜。至期，果然定亲。 牛哀鸣占 癸卯日午时，有牛鸣于坎方，声极悲，因占之。牛属坤，为上卦，坎方为下卦。坎六坤八，加午时七，共二十一数，除三六一十八，三爻动得地水师之三爻。《易辞》曰：“师或舆尸，凶。”卦则师变升，互坤、震，乃坤为体，互变俱克之，并无生气。 断曰：此牛二十一日内必遭屠杀。后二十日，人果买此牛，杀以犒众，悉皆异之。 鸡悲鸣占 甲申日卯时，有鸡鸣于乾方，声极悲怆，因占之。鸡属巽，为上卦，乾方为下卦，得风天小畜。以巽五乾一共六数，加卯时四数，总十数，除六得四，爻动变乾，是为小畜之六四。《易》曰：“有孚，血去惕出，无咎。”推之，割鸡之义。卦则小畜之乾，互见离、兑。乾金为体，离火克之。卦中巽木离火，有烹饪之象。 断曰：此鸡十日当烹。果十日客至，有烹鸡之验。 枯枝坠地占 戊子日辰时，偶行至中途，有树蔚然，无风，枯枝自坠地于兑方。占之，槁木为离，作上卦，兑方为下卦，得火泽睽。以兑二离三，加辰时五数，总十数，去六余四，变山泽损，是睽之九四。《易》曰：“睽孤，遇元夫。”卦火泽睽变损，互见坎、离，兑金为体，离火克之，且睽损卦名，俱有伤残之义。 断曰：此树十日当伐。果十日，伐树起公榭，而匠者适字“元夫”也。 以上诸占例，并是先得卦，以卦起数，所谓后天之数也。 风觉鸟占 风觉鸟占者，谓见风而觉，见鸟而占也，然非风鸟而占，而谓风觉鸟占也。凡卦之寓物者，皆谓之风觉鸟占。如易数，总谓之观梅之数也。 风觉占 风觉占者，谓其见风而觉也，见鸟而占也。凡见风起而欲占之，便是风从何方而来，以之起卦。又须审其时，察其色，以推其声势，然后可断其吉凶。风从南方来者，为家人，南方属离火，得风火家人卦（南方属离火，合得风火家人卦）。东来者，为益卦之类。审其时者，春为发生和畅之风；夏为长养之风；秋为肃杀；冬为凛冽之类。察其色者，带埃烟云气，可见其色黄者，祥瑞之气；青者，半凶半吉；白主刃，气黑昏者凶，赤色者灾，红紫者吉。辨其声势者，其风声如阵马，主斗争；如波涛者，有惊险；如悲咽者，有忧虑；如奏乐者，有喜事；如喧呼者，主闹哄；如烈焰者，主火惊。其声洋洋而来，徐徐而去者，吉庆之兆也。 鸟占 鸟占者，见鸟可占也。凡见鸟群，数其只数，看其方所，听其声音，辨其毛羽色，皆可起数。又须审其名义，察其鸣叫，取其吉凶。见鸟而占，数其只数者，如一只属乾，二只属兑，三只属离。看其方所者，即离南、坎北之数；听其声音者，如鸟叫一声属乾，二声属兑，三声属离之类，皆可起卦。听声音者，若夫鸣叫之喧啾者，主口舌；鸣叫悲咽者，主悲愁；鸣叫嘹亮者，主吉庆。此取断吉凶之声音也。察其名义者，如鸦报灾，鹊报喜，鸾鹤为祥瑞，鹗鹏为妖孽之类是也。 听声音占 声音者，如静室无所见，但于耳中所闻起卦，或数其数，验其方所；或辨其物声，详其所属，皆可起卦。察其悲喜，助断吉凶。数其数目者，如一声属乾，二声属兑。验其方所者，离南、坎北之类是也。如人语声，及动物鸣叫之声，声自口出者属兑。而静物扣击属震，鼓拍槌敲、板木之声是也；金声属乾，钟馨钲铎之声是也；火声属离，烈焰爆竹等声是也；土声属坤，筑基、杵垣、坡崩、山裂是也。此辨其物声，详其所属也。察其悲喜，助断吉凶者，如闻人语笑声，又说吉语，娱笑者，有喜也；人悲泣声与怨声，愁语及骂詈穷叹等声，不吉也。 形物占 形物占者，凡见物形，可以起卦。如物之圆者属乾，刚者属兑，方者属坤，柔者属巽，仰者属震，覆者属艮，长者属巽，中刚外柔者属坎，内柔外刚者属离，干燥枯槁者属离，有文彩者亦属离，用障碍之势、物之破者属兑。 验色占 凡占色之青者属震，红紫赤者属离，黄色者属坤，白色属兑，黑色属坎之类是也。"},{"title":"象数义理一 | 梅花易数","date":"2017-10-14T04:59:09.000Z","path":"2017/10/14/yi-meihua-1/","text":"卷一 象数易理篇之一 周易卦数 乾，一；兑，二；离，三；震，四；巽，五；坎，六；艮，七；坤，八。 五行生克 金生水，水生木，木生火，火生土，土生金； 金克木，木克土，土克水，水克火，火克金。 八宫所属五行 乾、兑，金；坤、艮，土；震、巽，木；坎，水；离，火。 卦气旺 震、巽木旺于春，离火旺于夏，乾、兑金旺于秋，坎水旺于冬，坤、艮土旺于辰戌丑未月。 卦气衰 春坤、艮，夏乾、兑，秋震、巽，冬离，辰戌丑未坎。 十天干 甲乙东方木，丙丁南方火，戊己中央土，庚辛西方金，壬癸北方水。 十二地支 子水鼠，丑土牛，寅木虎，卯木兔，辰土龙，巳火蛇，午火马，未土羊，申猴金，酉金鸡，戌土犬，亥水猪。 八卦象例 乾三连，坤六断，震仰盂，艮覆碗，离中虚，坎中满，兑上缺，巽下断。 占法 《易》中秘密穷天地，造化天机泄未然。 中有神明司祸福，从来切莫教轻传。 玩法 一物从来有一身，一身还有一乾坤。 能知万物备于我，肯把三才别立根。 天向一中分造化，人于心上起经纶。 仙人亦有两般话，道不虚传只在人。 卦以八除 凡起卦不问数多少，即以此数作卦数，过八数即以八数递除。一八除不尽，再除二八，三八，直至除尽，以余数作卦。如得八数整，即坤卦，更不必除也。 爻以六除 凡起动爻，以重卦总数除六，以余数作动爻。如不满六，止用此数为动爻，不必再除。如过六数，则除之一六，不尽再除二六、三六，直至除尽，以余数作动爻。若一爻动，则看此一爻，是陽爻则变陰爻，陰爻则变陽爻。取爻当以时加之。 互卦起例 互卦只用八卦，不必取六十四卦名。互卦以重卦去了初爻及第六爻，以中间四爻分作两卦，看得何卦。 又云：乾坤无互，互其变卦。 年月日时起例 年月日为上卦。年月日加时总数为下卦。又以年月日时总数取爻。如子年一数，丑年二数，直至亥年十二数。月如正月一数，直至十二月，亦作十二数。日数如初一一数，直至三十日，为三十数。以上年月日共计几数，以八除之，以余数作卦。如子时一数直至亥时十二数，就将年月日数加时之数，总计几数，以八除之，余数作下卦；以六除，余数作动爻。 物数占例 凡见有可数之物，即以此数起作上卦，以时数配作下卦。即以卦数并时数总除六取动爻。 声音占例 凡闻声音，数得几数，起作上卦，加时数配作下卦。又以声音，如闻动物鸣叫之声，或闻人敲击之声，皆可作数起卦。 字占 凡见字数如停匀，即平分一半为上卦，一半为下卦。如字数不匀，即少一字为上卦，取天轻清之义，以多一字为下卦，取地重浊之义。 一字占至十一字占 一字为太极未判。如草书，混沌不明，不可得卦。如楷书，则取其字画，以左为陽画，右为陰画。居左者看几数，取为上卦。居右者看几数，取为下卦。又以一字之陰陽，全画取爻。“彳”、“丿”，此为左者；“一”、“乙”、“、”此为右者。 二字为两仪平分。以一字为上卦，一字为下卦。 三字为三才。以一字为上卦，二字为下卦。 四字为四象。平分上下为卦。又四字以上，不必数画数，只以平仄声音调之。平声为一数，上声为二数，去声为三数，入声为四数。 五字为五行。以二字为上卦，三字为下卦。 六字为六爻之集。平分上下为卦。 七字为齐七政。以三字为上卦，四字为下卦。 八字为八卦定位。平分上下为卦。 九字为九畴之义。以四字为上卦，五字为下卦。 十字为成数。平分上下为卦。 十一字以上至于百字，皆可起卦。但十一字以上，又不用平仄声音调之，止用字数。如字数均平，则以半为上卦，以半为下卦。又合二卦总数取爻。 丈尺占 丈尺之物，以丈数为上卦，尺数为下卦。合丈尺之数取爻。寸数不用。 尺寸占 以尺数为上卦，寸数为下卦。合尺寸之数加时取爻。分数不用。 为人占 凡为人占，其例不一。或听语声起卦，或观其人品，或取诸身，或取诸物，或因其服色，触其外物，或以年月日时，或以书写来意。 又听其语声者，如或一句，即如其字数分之起卦，如说两句，即用先一句为上卦，后一句为下卦。语多，则但用初听一句，或末后所闻一句。余句不用。 观其人品者，如老人为乾，少女为兑之类。 取诸其身者，如头动为乾，足动为震，目动为离之类。 取诸其物者，如人手中偶有何物，如金玉及圆物之属为乾，土瓦及方物之属为坤之类。 因其服色者，如其人青衣为震，赤衣为离之类。 触其外物者，起卦之时见水为坎卦，见火为离卦之类。 年月日时，如观梅之类推之。 书写来意者。其人来占，或写来意，则以其字占之。 自己占 凡自己欲占，以年月日时或闻有声音，或观当时有所触之外物，皆可起卦。以上三例，与前章为人占类法同。 占动物 凡占群物之动，不可起卦。如见一物，则就以此物为上卦，物来之方位为下卦。合物卦数及方位卦数，加时数取爻，以此数总断其物，如后天占牛鸣鸡叫之类。又凡牛马犬豕之类，初生，则以初生年月日时占之。又可置买此物，亦可以初置买之时推之。 占静物 凡占静物，有如江河山石，不可起卦。若至屋宅、树木之类，则屋宅初创之时，树木初置之时，皆可起卦。至于器物，则置成之时可占，如枕、椅之类是矣。余则无故不占。若观梅，则见雀争枝坠地而占。牡丹，则见有问而占。茂树，则枝枯自坠而后占也。"},{"title":"杂卦 | 易经","date":"2017-10-14T04:53:10.000Z","path":"2017/10/14/yi-zhuan-za/","text":"《乾》刚《坤》柔，《比》乐《师》忧。《临》、《观》之义，或与或求。《屯》见而不失其居②，《蒙》杂而著。《震》，起也。《艮》，止也。《损》、《益》盛衰之始也。《大畜》时也。 《无妄》灾也。《萃》聚而《升》不来也。《谦》轻而《豫》怠也。《噬嗑》食也，《贲》无色也。《兑》见而《巽》伏也。《随》无故也，《蛊》则饬也③。《剥》烂也，《复》反也④。《晋》昼也。《明夷》诛也。《井》通而《困》相遇也。《咸》速也。《恒》久也。《涣》离也。《节》止也。《解》缓也。《蹇》难也。《睽》外也。《家人》内也。《否》、《泰》反其类也。《大壮》则止，《遁》则退也。《大有》众也。《同人》亲也。《革》去故也。《鼎》取新也。《小过》过也。《中孚》信也。《丰》多故也⑤。亲寡《旅》也⑥。《离》上而《坎》下也。《小畜》寡也。《履》不处也。《需》不进也。《讼》不亲也。《大过》颠也。《姤》遇也，柔遇刚也，《渐》女归待男行也⑦。《颐》养正也。《既济》定也⑧。《归妹》女之终也。《未济》男之穷也。《夬》决也，刚决柔也，君子道长，小人道忧也。"},{"title":"彖下传 | 易经","date":"2017-10-14T04:43:57.000Z","path":"2017/10/14/yi-zhuan-yuan-2/","text":"咸,感也。柔上而刚下，二气感应以相与，止而说，男下女，是以亨利贞，取女吉也。天地感而万物化生，圣人感人心而天下和平。观其所感，而天地万物之情可见矣。恒，久也。刚上而柔下，雷风相与，巽而动，刚柔皆应，恒。恒亨无咎，利贞，久于其道也。天地之道，恒久而不已也。利有攸往，终则有始也。日月得天而能久照，四时变化而能久成，圣人久于其道而天下化成，观其所恒，而天地万物之情可见矣。遁亨，遁而亨也。刚当位而应，与时行也。小利贞，浸而长也。遁之时义大矣哉。大壮，利贞，大者正也。正大而天地之情可见矣。晋，进也。明出地上，顺而丽乎大明，柔进而上行，是以康侯用锡马蕃庶，昼日三接也。明入地中，明夷。内文明而外柔顺，以蒙大难，文王以之。利艰贞，晦其明也。内难而能正其志，箕子以之。家人，女正位乎内，男正位乎外，男女正，天地之大义也。家人有严君焉，父母之谓也。父父子子，兄兄弟弟，夫夫妇妇，而家道正，正家而天下定矣。睽，火动而上，泽动而下，二女同居，其志不同行。说而丽乎明，柔进而上行，得中而应乎刚，是以小事吉。天地睽而其事同也，男女睽而其志通也，万物睽而其事类也。睽之时用大矣哉！蹇jian，难也，险在前也。见险而能止，知矣哉。蹇利西南,往得中也.不利东北,其道穷也。利见大人，往有功也。当位贞吉，以正邦也。蹇之时用大矣哉！解险以动，动而免乎险解。解利西，往得中也。其来复吉，乃得中也。有攸往夙吉，往有功也。天地解而雷雨作，雷雨作而白果草木皆甲坼(che裂开）。解之时大矣哉！损，损下益上，其道上行。损而有孚，元吉无咎可贞。利有攸往，曷(he何时)之用，二簋（gui盛食物之器皿）可用享。二簋应有时，损刚益柔有时，损益盈虚，与时偕行。益，损上益下，民说无疆。自上下下，其道大光。利有攸往，中正有庆。利涉大川，木道乃行。益动而巽，日进无疆。天施地生，其益无方。凡益之道，与时偕行。夬guai，决也，刚决柔也。健而说，决而和。扬于王庭，柔乘五刚也。孚号有厉，其危乃光也。告自邑不利即戎，所尚乃穷也。利有攸往，刚长乃终也。姤（gou好），遇也，柔遇刚也。勿用取女，不可与长也。天地相遇，品物咸章也。刚遇中正，天下大行也。姤之时义大矣哉！萃，聚也。顺以说，刚中而应，故聚也。王假有庙，致孝享也。利见大人亨，聚以正也。用大牲吉，利有攸往，顺天命也。观其所聚，而天地万物之情可见矣。柔以时升。巽而顺，刚中而应，是以大亨。用见大人勿恤，有庆也。南征吉，志行也。困，刚掩也。险以说，困而不失其所，“亨”，其为君子乎。“贞大人吉”，以刚中也。“有言不信”，尚口乃穷也。巽乎水而上水，井。井，养而不穷也。改邑不改井，乃以刚中也。汔至亦未繘(jue)井，未有功也。羸其瓶，是以凶也。革，水火相息，二女同居，其志不相得，曰革。巳日乃孚，革而信之，文明以说，大亨以正，革而当，其悔乃亡。天地革而四时成。汤武革命，顺乎天而应乎人，革之时大矣哉。鼎，象也。以木巽火，亨饪也。圣人亨以享上帝，而大亨以养圣贤。巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。震，亨。震惊百里，惊远而惧近也。出可以守宗庙社稷，以为祭主也。艮，止也。时止则止，时行则行。动静不失其时，其道光明。艮其止，止其所也。上下敌应，不相与也。是以不获其身，行其庭，不见其人，无咎也。渐之进也，女归吉也。进得位，往有功也。进以正，可以正邦也。其位，刚得中也。止而巽，动不穷也。归妹，天第之大义也。天地不交而万物不兴，归妹人之终始也。说以动，所归妹也。征凶，位不当也。无攸利，柔乘刚也。丰，大也。明以动，故丰。王假之，尚大也。勿忧宜日中，宜照天下也。日中则昃（ze太阳偏西），月盈则食，天地盈虚，与时消息，而况于人乎？况于鬼神乎？旅，小亨。柔得中乎外而顺乎刚，止而丽乎明，是以小亨。旅，贞吉也。旅之时义大矣哉！重巽以申命。刚巽乎中正而志行，柔皆顺乎刚，是以小亨。利有攸往，利见大人。兑，说也。刚中而柔外，说以利贞，是以顺乎天而应乎人。说以先民，民忘其劳，说以犯难，民忘其死。说之大民劝矣哉。涣，亨。刚来而不穷，柔得位乎外而上同。王假有庙，王乃在中也。利涉大川，乘木有功也。节，亨，刚柔分而刚得中。苦节不可贞，其道穷也。说以行险，当位以节，中正以通。天地节而四时成。节以制度，不伤财，不害民。中孚，柔在内而刚得中。说而巽，孚乃化邦也。豚鱼吉，信及豚鱼也。利涉大川，乘木舟虚也。中孚以利贞，乃应乎天也。小过，小者过而亨也。过以利贞，与时行也。柔得中，是以小事吉也。刚失位而不中，是以不可大事也。有飞鸟之象焉。飞鸟遗之音，不宜上宜吓大吉，上逆而下顺也。既济，亨。小者亨也。利贞，刚柔正而位当也。初吉，柔得中也。终止则乱，其道穷也。未济，亨。柔得中也。小狐汔(qi)济，未出中也。濡其尾无攸利，不续中也。虽不当位，刚柔应也。"},{"title":"彖 上传 | 易经","date":"2017-10-14T04:42:30.000Z","path":"2017/10/14/yi-zhuan-yuan-1/","text":"大哉乾元!万物资始,乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸宁。至哉乾元，万物资生，乃顺承天。坤厚载物，德合无疆。含弘光大，品物咸亨。牝马蒂类，行地无疆。柔顺利贞，君子攸行。先迷失道，后顺得常。西南得朋，乃与类行。东北丧朋，乃终有庆。安贞之吉，应地无疆。屯，刚柔始交而难生。动乎险中，大亨贞。雷雨之动满盈，天道草昧，宜建侯而不宁。蒙，山下有险。险而止，蒙。蒙，亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。除筮告，以刚中也。再三渎，渎则不告，渎蒙也。蒙以养正，圣功也。需，须也，险在前也。刚健而不陷，气义不困穷矣。需，有孚，光亨，贞吉。位乎天位，以正中也。利涉大川，往有功也。讼，上刚下险。险而健，讼。讼，有孚窒惕中吉，则来而得中也。终凶，讼不可成也。利见大人，尚中正也。不利涉大川，入于渊也。师，众也。贞，正也。能以众正，可以王矣。刚中而应，行险而顺，以此毒天下而民从之，吉又何咎矣。比，吉也。比，辅也，下顺从也。原筮元永贞无咎，以刚中也。不宁方来，上下应也。后夫凶，其道穷也。小畜,柔得位而上下应之,曰小畜.健而巽，则中而志行，乃亨。密云不雨，尚往也。自我西郊，施未行也。履，柔履刚也。说而应乎乾，是以履虎尾不咥人亨。刚中正，履帝位而不疚，光明也。泰，小往大来吉亨，则是天地交而万物通也，上下交儿其志同也。内阳而外阴，内健而外顺，内君子而外小人，君子道长，小人道消也。否之匪人，不利君子贞。大往小来，则是天地不交，而万物不通也。上下不交，而天下无邦也。内阴而外阳，内柔而外刚，内小人而外君子，小人道长，君子道消也。同人，柔得位得中而应乎乾，曰同人。同人曰。同人于野，亨。利涉大川，乾行也。文明以健，中正而应，君子正也。惟君子为能通天下之志。大有，柔得尊位大中，而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。谦，亨。天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。谦尊而光，卑而不可逾，君子之终也。豫，刚应而志行，顺以动，豫。预顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不忒。圣人以顺动，则刑罚清而民服。豫之时义大矣哉！随，刚来而下柔，动而说，随。大亨贞无咎，而天下随时。随时之义大矣哉！蛊，刚上而柔下。巽而止，蛊。蛊，元亨而天下治也。利涉大川，往有事也。先甲三日，后甲三日，终则有始，天行也。临，刚浸而长。说而顺，刚中而应。大亨以正，天之道也。至于八月有凶，消不久也。大观在上，顺而巽，中正以观天下。观，盥而不荐，有孚顒（yong)若，下观而化也。观天之神道，而四时不忒，圣人以神道设教，而天下服矣。颐中油物，曰噬嗑。噬嗑而亨，刚柔分，动而明，雷电合而章，柔得中而上行，虽不当位，利用狱也。贲（ben/bi),亨。柔来而文刚，故亨。分刚上而文柔，故小利有攸往，天文也。文明以止，人文也。观乎天文，以察时变。观乎人文，以化成天下。剥，剥也。柔变刚也。不利有攸往，小人长也。顺而止之，观象也。君子尚消息盈虚，天行也。复，亨，刚反。动而以顺行,是以出入无疾,朋来无咎.反复其道,七日来复,天行也.利有攸往,刚长也.复其见天地之心乎.无妄,刚自外来而为主于内.动而健,刚中而应,大亨以正,天之命也.其匪正有眚,不利有攸往.无妄之往,何之矣.天命不佑,行矣哉.大畜,刚健笃实辉光,日新其德.刚上而尚贤,能止健,大正也.不家食吉,养贤也.利涉大川,应乎天也.颐,贞吉,养正则吉也.观颐观其所养也.自求口实,观其自养也.天地养万物,圣人养贤以及万民,颐之时大矣哉.大过,大者过也.栋橈,本末弱也.刚过而中.巽而说行,利有攸往乃亨.大过之时大矣哉.习坎,重险也.水流而不盈,行险而不失其信.维心亨,乃以刚中也.行有尚,往有功也.天险不可升也,地险山川丘陵也,王公设险以守其国,险之时用大矣哉.离,丽也.日月丽乎天,百谷草木丽乎土,重明以丽乎正,乃化成天下.柔丽乎中正故亨,是以畜牝牛吉也."},{"title":"易童子问 | 卷三","date":"2017-10-14T04:27:41.000Z","path":"2017/10/14/yi-wen-3/","text":"童子问曰：“《系辞》非圣人之作乎？”曰：“何独《系辞》焉，《文言》、《说卦》而下，皆非圣人之作，而众说淆乱，亦非一人之言也。昔之学《易》者，杂取以资其讲说，而说非一家，是以或同或异，或是或非，其择而不精，至使害经而惑世也。然有附托圣经，其传已久，莫得究其所从来而核其真伪。故虽有明智之士，或贪其杂博之辩，溺其富丽之辞，或以为辩疑是正，君子所慎，是以未始措意于其间。若余者可谓不量力矣，邈然远出诸儒之后，而学无师授之传，其勇于敢为而决于不疑者，以圣人之经尚在，可以质也。” 童子曰：“敢问其略？”曰：“《乾》之初九曰‘潜龙勿用’，圣人于其《象》曰‘阳在下也’，岂不曰其文已显而其义已足乎？而为《文言》者又曰‘龙德而隐者也’，又曰‘阳在下也’，又曰‘阳气潜藏’，又曰‘潜之为言，隐而未见’。《系辞》曰：‘乾以易知，坤以简能。易则易知，简则易从。易知则有亲，易从则有功。有亲则可久，有功则可大。可久则贤人之德，可大则贤人之业。’其言天地之道、乾坤之用、圣人所以成其德业者，可谓详而备矣，故曰‘易简而天下之理得矣’者，是其义尽于此矣。俄而又曰：‘广大配天地，变通配四时，阴阳之义配日月，易简之善配至德。’又曰：‘夫乾，确然示人易矣。夫坤，隤然示人简矣。’又曰：‘夫乾，天下之至健也，其德行常易以知险。夫坤，天下之至顺也，其德行常简以知阻。’《系辞》曰‘六爻之动，三极之道也’者，谓六爻而兼三材之道也。其言虽约，其义无不包矣。又曰：‘《易》之为书也，广大悉备，有天道焉，有人道焉，有地道焉。兼三材而两之，故六。六者非他也，三材之道也。’而《说卦》又曰：‘立天之道曰阴与阳，立地之道曰柔与刚，立人之道曰仁与义。兼三材而两之，故《易》六画而成卦。分阴分阳，迭用柔刚，故《易》六位而成章。’《系辞》曰：‘圣人设卦观象，系辞焉而明吉凶。’又曰：‘辨吉凶者存乎辞。’又曰：‘圣人有以见天下之动，而观其会通，以行其典礼，系辞焉以断其吉凶，是故谓之爻。’又曰：《易》有四象，所以示也。系辞焉，所以告也。定之以吉凶，所以断也。’又曰：‘设卦以尽情伪，系辞焉以尽其言。’其说虽多，要其旨归，止于系辞明吉凶尔，可一言而足也。凡此数说者，其略也。其余辞虽小异而大旨则同者，不可以胜举也。谓其说出于诸家，而昔之人杂取以释经，故择之不精，则不足怪也。谓其说出于一人，则是繁衍丛脞之言也。其遂以为圣人之作，则又大缪矣。孔子之文章，《易》、《春秋》是已，其言愈简，其义愈深。吾不知圣人之作，繁衍丛脞之如此也。虽然，辨其非圣之言而已，其于《易》义，尚未有害也。而又有害经而惑世者矣。《文言》曰‘元者善之长也，亨者嘉之会也，利者义之和也，贞者事之乾也’，是谓《乾》之四德。又曰‘乾元者，始而亨者也。利贞者，性情也’，则又非四德矣。谓此二说出于一人乎？则殆非人情也。《系辞》曰：‘河出图，洛出书，圣人则之。’所谓图者，八卦之文也，神马负之自河而出，以授于伏羲者也。盖八卦者，非人之所为，是天之所降也。又曰：‘包羲氏之王天下也，仰则观象于天，俯则观法于地，观鸟兽之文与地之宜，近取诸身，远取诸物，于是始作八卦。’然则八卦者，是人之所为也，河图不与焉。斯二说者已不能相容矣，而《说卦》又曰‘昔者圣人之作《易》也，幽赞于神明而生蓍，参天两地而倚数，观变于阴阳而立卦’，则卦又出于蓍矣。八卦之说如是，是果何从而出也？谓此三说出于一人乎？则殆非人情也。人情常患自是其偏见，而立言之士莫不自信，其欲以垂乎后世，惟恐异说之攻之也，其肯自为二三之说以相抵牾而疑世，使人不信其书乎？故曰非人情也。凡此五说者自相乖戾，尚不可以为一人之说，其可以为圣人之作乎？” 童子曰：“于此五说，亦有所取乎？”曰：“《乾》无四德，而洛不出图书，吾昔已言之矣。若元亨利贞，则圣人于《彖》言之矣。吾知自尧、舜已来，用卜筮尔，而孔子不道其初也，吾敢妄意之乎？” 童子曰：“是五说皆无取矣，然则繁衍丛脞之言与夫自相乖戾之说，其书皆可废乎？”曰：“不必废也。古之学经者皆有《大传》，今《书》、《礼》之传尚存。此所谓《系辞》者，汉初谓之《易大传》也，至后汉已为《系辞》矣。语曰：‘为赵、魏老则优，不可以为滕、薛大夫也。’《系辞》者谓之《易大传》，则优于《书》、《礼》之传远矣。谓之圣人之作，则僭伪之书也。盖夫使学者知《大传》为诸儒之作，而敢取其是而舍其非，则三代之末，去圣未远，老师名家之世学，长者先生之余论，杂于其间者在焉，未必无益于学也。使以为圣人之作，不敢有所择而尽信之，则害经惑世者多矣。此不可以不辨也，吾岂好辨者哉！” 童子曰：“敢问四德？”曰：“此鲁穆姜之所道也。初，穆姜之筮也，遇艮之随，而为‘《随》，元亨利贞’说也，在襄公之九年。后十有五年，而孔子始生，又数十年而始赞《易》。然则四德非《乾》之德，《文言》不为孔子之言矣。” 童子曰：“或谓左氏之传《春秋》也，窃取孔子《文言》以上附穆姜之说，是左氏之过也，然乎？”曰：“不然。彼左氏者胡 为而传《春秋》，岂不欲其书之信于世也？乃以孔子晚而所着之书，为孔子未生之前之说，此虽甚愚者之不为也。盖方左氏传《春秋》时，世犹未以《文言》为孔子作也，所以用之不疑。然则谓《文言》为孔子作者，出于近世乎？” 童子曰：“敢问八卦之说？或谓伏羲已授河图，又俯仰于天地，观取于人物，然后画为八卦尔。二说虽异，会其义则一也，然乎？”曰：“不然。此曲学之士牵合傅会，以苟通其说，而遂其一家之学尔。其失由于妄以《系辞》为圣人之言而不敢非，故不得不曲为之说也。河图之出也，八卦之文已具乎，则伏羲授之而已，复何所为也？八卦之文不具，必须人力为之，则不足为河图也。其曰观天地、观鸟兽、取于身、取于物，然后始作八卦，盖始作者前未有之言也。考其文义，其创意造始其劳如此，而后八卦得以成文，则所谓河图者何与于其间哉？若曰已授河图，又须有为而立卦，则观于天地鸟兽、取于人物者皆备言之矣，而独遗其本始所授于天者，不曰取法于河图，此岂近于人情乎？考今《系辞》，二说离绝，各自为言，义不相通，而曲学之士牵合以通其说，而悞惑学者，其为患岂小哉！古之言伪而辨、顺非而泽者，杀无赦。呜呼！为斯说者，王制之所宜诛也。” 童子曰：“敢问生蓍立卦之说？或谓圣人已画卦，必用蓍以筮也，然乎？”曰：“不然。考其文义可知矣。其曰‘昔者圣人之作《易》也’者，谓始作《易》时也。又曰‘幽赞于神明而生蓍，参天两地而倚数，观变于阴阳而立卦，发挥于刚柔而生爻’者，谓前此未有蓍，圣人之将作《易》也，感于神明而蓍为之生，圣人得之，遂以倚数而立卦。是言昔之作《易》立卦之始如此尔。故汉儒谓伏羲画八卦由数起者，用此说也。其后学者知幽赞生蓍之怪，其义不安，则曲为之说。曰用生蓍之意者，将以救其失也。又以卦由数起之义害于二说，则谓已画卦而用蓍以筮，欲牵合二说而通之也。然而考其文义，岂然哉？若曰已作卦而用蓍以筮，则大衍之说是已。大抵学《易》者莫不欲尊其书，故务为奇说以神之。至其自相乖戾，则曲为牵合而不能通也。 童子曰：“敢请益。”曰：“夫谕未达者，未能及于至理也，必指事据迹以为言。余之所以知《系辞》而下非圣人之作者，以其言繁衍丛脞而乖戾也。盖略举其易知者尔，其余不可以悉数也。其曰‘原始反终，故知死生之说’，又曰‘精气为物，游魂为变，是故知鬼神之情状’云者，质于夫子平生之语，可以知之矣。其曰‘知者观乎彖辞，则思过半矣’，又曰‘八卦以象告，爻彖以情言’云者，以常人之情而推圣人可以知之矣。其以《乾》、《坤》之策‘三百有六十，当期之日’，而不知七八九六之数同，而《乾》、《坤》无定策，此虽筮人皆可以知之矣。至于‘何谓’、‘子曰’者，讲师之言也。《说卦》、《杂卦》者，筮人之占书也。此又不待辨而可以知者。然犹皆迹也，若夫语以圣人之中道而过，推之天下之至理而不通，则思之至者可以自得之。” 童子曰：“既闻命矣，敢不勉！”"},{"title":"易童子问 | 卷二","date":"2017-10-14T04:26:49.000Z","path":"2017/10/14/yi-wen-2/","text":"童子问曰：“履险蹈难谓之《蹇》，解难济险谓之《解》，二卦之义相反而辞同，皆曰‘利西南’者，何谓也？”曰：“圣人于斯二卦，辞则同而义则异，各于其《彖》言之矣，《蹇》之《彖》曰‘往得中也’，《解》之《彖》曰‘往得众也’者是已。西南，坤也，坤道主顺。凡居蹇难者，以顺而后免于患。然顺过乎柔，则入于邪。必顺而不失其正，故曰‘往得中也’。解难者必顺人之所欲，故曰‘往得众也’。” 童子问曰：“‘损，损下益上’，‘益，损上益下’，何谓也？”曰：“上君而下民也。损民而益君，损矣；损君而益民，益矣。语曰‘百姓足，君孰与不足’，此之谓也。”童子又曰：“《损》之《象》曰‘君子以惩忿窒欲’，《益》之《象》曰‘君子以见善则迁，有过则改’，何谓也？”曰：“呜呼！君子者，天下系焉，其一身之损益，天下之利害也。君子之自损忿欲尔，自益者，迁善而改过尔。然而肆其忿欲者，岂止一身之损哉？天下有被其害者矣。迁善而改过者，岂止一己之益哉？天下有蒙其利者矣。”童子曰：“君子亦有过乎？”曰：“汤、孔子，圣人也，皆有过矣。君子与众人同者，不免乎有过也。其异乎众人者，过而能改也。汤、孔子不免有过，则《易》之所谓损、益者，岂止一身之损益哉？” 童子问曰：“‘夬，不利即戎’，何谓也？”曰：“谓其已甚也，去小人者不可尽。盖君子者，养小人者也。小人之道长，斯害矣，不可以不去也。小人之道已衰，君子之利及乎天下矣，则必使小人受其赐而知君子之可尊也。故不可使小人而害君子，必以君子而养小人。《夬》，刚决柔之卦也。五阳而一阴，决之虽易，而圣人不欲其尽决也，故其《彖》曰‘所尚乃穷也’。小人盛则决之，衰则养之，使知君子之为利，故其《象》曰‘君子以施禄及下’。小人已衰，君子已盛，物极而必反，不可以不惧，故其《象》又曰‘居德则忌’。” 童子问曰：“‘困，亨。贞大人吉，无咎’，其《彖》曰‘险以说，困而不失其所，亨’，何谓也？”曰：“‘困，亨’者，困极而后亨，物之常理也，所谓《易》穷则变，变则通也。‘困而不失其所，亨’者，在困而亨也，惟君子能之。其曰‘险以说’者，处险而不惧也。惟有守于其中，则不惧于其外。惟不惧，则不失其所亨，谓身虽困而志则亨也，故曰‘其惟君子乎’，其《象》又曰‘君子以致命遂志’者，是也。”童子又曰：“敢问‘正大人吉，无咎’者，古之人孰可以当之？”曰：“文王之羑里，箕子之明夷。” 童子问曰：“《革》之《彖》曰‘汤、武革命，顺乎天而应乎人’，何谓也？”曰：“逆莫大乎以臣伐君。若君不君，则非君矣。是以至仁而伐桀、纣之恶，天之所欲诛而人之所欲去，汤、武诛而去之，故曰‘顺乎天而应乎人’也。”童子又曰：“然则正乎？”曰：“正者，常道也。尧传舜、舜传禹、禹传子是已。权者，非常之时，必有非常之变也。汤、武是已。故其《彖》曰‘《革》之时大矣哉’云者，见其难之也。”童子又曰：“汤、武之事，圣人贵之乎？”曰：“孔子区区思文王而不已，其厚于此则薄于彼可知矣。”童子又曰：“顺天应人，岂非极称之乎，何谓薄？”曰：“圣人于《革》称之者，适当其事尔。若《乾》《坤》者，君臣之正道也，于《乾》《坤》而称汤、武，可乎？圣人于《坤》，以‘履霜’为戒，以‘黄裳’为吉也。” 童子问曰：“《革》去故而《鼎》取新，何谓也？”曰：“非圣人之言也，何足问！《革》曰去故，不待言而可知。《鼎》曰取新，《易》无其辞，汝何从而得之？夫以新易旧，故谓之革，若以商革夏，以周革商，故其《象》曰‘汤、武革命’者是也。然则以新革故一事尔，分于二卦者，其谁乎？”童子又曰：“然则《鼎》之义何谓也？”曰：“圣人言之矣，‘以木巽火，亨饪也。’” 童子问曰：“《震》之辞曰‘震惊百里，不丧匕鬯’者，何谓也？”曰：“震者，雷也。惊乎百里，震之大者也。处大震之时，众皆震惊，而独能不失其守、不丧其器者，可以任大事矣，故其《彖》曰‘震惊百里，惊远而惧迩也’，‘不丧匕鬯，出可以守宗庙社稷，为祭主’者，谓可任以大事也。”童子曰：“郭公夏五，圣人所以传疑。《彖》之阙文奈何？”曰：“圣人疑则传疑也。若《震》之《彖》，其辞虽阙，其义则在，又何疑焉？” 童子问曰：“《艮》之《象》曰‘君子以思不出其位’，何谓也？”曰：“《艮》者，君子止而不为之时也。时不可为矣则止，而以待其可为而为者也，故其《彖》曰‘时止则止，时行则行’。于斯时也，在其位者宜如何？思不出其位而已。然则位之所职，不敢废也，《诗》云‘风雨如晦，鸡鸣不已’，此之谓也。” 童子问曰：“‘归妹，征凶’，《彖》曰‘归妹，天地之大义，人之终始也’，其卦辞凶而《彖》辞吉，何谓也？”曰：“合二姓，具六礼，而归得其正者，此《彖》之所谓归妹者也。若婚不以礼而从人者，卦所谓征凶者也。”童子曰：“敢问何以知之？”曰：“《咸》之辞曰‘取女吉’，其为卦也，艮下而兑上，故其《彖》曰‘上柔而下刚’，‘男下女’，是以吉也。《渐》之辞曰‘女归吉’，其为卦也，艮下而巽上，其上柔下刚，以男下女，皆与《咸》同，故又曰‘女归吉’也。《归妹》之为卦也不然，兑下而震上，其上刚下柔，以女下男，正与《咸》、《渐》反，故彼吉则此凶矣，故其《彖》曰‘征凶，位不当也’者，谓兑下震上也。”童子曰：“取必男下女乎？”曰：“夫妇所以正人伦，礼义所以养廉耻，故取女之礼，自纳采至于亲迎，无非男下女，而又有渐也，故《渐》之《彖》曰‘渐之进也，女归吉也’者是已。奈何《归妹》以女下男而往，其有不凶者乎？” 童子问曰：“《兑》之《彖》曰‘顺乎天而应乎人’，何谓也？”曰：“‘兑，说也’。‘说以先民，民忘其劳。说以犯难，民忘其死’。说莫大于此矣。而所以能使民忘劳与死者，非顺天应人则不可。由是见小惠不足以说人，而私爱不可以求说。” 童子问曰：“‘萃，聚也’，其辞曰‘王假有庙’，‘涣，散也’，其辞又曰‘王假有庙’，何谓也？”曰：“谓《涣》为散者谁欤？《易》无其辞也。”童子曰：“然则敢问《涣》之义？”曰：“吾其敢为臆说乎！《涣》之卦辞曰‘利涉大川’，其《彖》曰‘乘木有功也’，其《象》亦曰‘风行水上，涣’。而人之语者，冰释汗浃皆曰涣。然则涣者，流行通达之谓也，与夫乖离分散之义异矣。呜呼！王者富有九州四海，万物之象莫大于《萃》，可以有庙矣；功德流行达于天下，莫大于《涣》，可以有庙矣。” 童子问曰：“《节》之辞曰‘苦节，不可贞’者，自节过苦而不得其正欤？物被其节而不堪其苦欤？”曰：“君子之所以节于己者，为其爱于物也，故其《彖》曰‘节以制度，不伤财，不害民’者是也。节者，物之所利也，何不堪之有乎？夫所谓苦节者，节而太过，行于己不可久，虽久而不可施于人，故曰‘不可正’也。”童子曰：“敢问其人？”曰：“异众以取名，贵难而自刻者，皆苦节也。其人则鲍焦、于陵仲子之徒是矣，二子皆苦者也。” 童子问曰：“《小过》之《象》曰‘君子以行过乎恭，丧过乎哀，用过乎俭’者，何谓也？”曰：“是三者施于行己，虽有过焉，无害也。若施于治人者，必合乎大中，不可以小过也。盖仁过乎爱，患之所生也；刑过乎威，乱之所起也。推是可以知之矣。” 童子问曰：“《既济》之《象》曰‘君子思患而豫防之’者，何谓也？”曰：“人情处危则虑深，居安则意怠，而患常生于怠忽也，是以君子既济，则思患而豫防之也。” 童子问曰：“‘火在水上，未济。君子以慎辨物居方’，何谓也？”曰：“《未济》之《象》，火宜居下而反居上，水宜居上而反居下，二物各失其所居，而不相济也，故君子慎辨其物宜，而各置其物于所宜居之方，以相为用，所以济乎未济也。”"},{"title":"易童子问 | 卷一","date":"2017-10-14T04:26:02.000Z","path":"2017/10/14/yi-wen-1/","text":"童子问曰：“‘乾，元、亨、利、贞’，何谓也？”曰：“众辞淆乱，质诸圣。《彖》者，圣人之言也。”童子曰：“然则《乾》无四德，而《文言》非圣人书乎？”曰：“是鲁穆姜之言也，在襄公之九年。” 童子问曰：“《象》曰‘天行健。君子以自强不息’，何谓也？”曰：“其传久矣，而世无疑焉，吾独疑之也。盖圣人取象所以明卦也，故曰‘天行健，乾’，而嫌其执于象也，则又以人事言之，故曰‘君子以自强不息’。六十四卦皆然也。《易》之阙文多矣。” 童子问曰：“《乾》曰‘用九’，《坤》曰‘用六’，何谓也？”曰：“释所以不用七八也。《乾》爻七九则变，《坤》爻八六则变。《易》用变以为占，故以名其爻也。阳过乎亢则灾，数至九而必变，故曰‘见群龙无首，吉’。物极则反，数穷则变，天道之常也，故曰‘天德不可为首也’。阴柔之动，多入于邪，圣人因其变以戒之，故曰‘利永贞’。” 童子问曰：“《屯》之《彖》、《象》与卦之义反，何谓也？”曰：“吾不知也。”童子曰：“《屯》之卦辞曰‘勿用有攸往’，《彖》曰‘动乎险中，大亨贞’，动而大亨，其不往乎？《象》曰‘君子以经纶’，不往而能经纶乎？”曰：“居《屯》之世者，勿用有攸往，众人也，治《屯》之时者，动乎险而经纶之，大人君子也，故曰‘利建侯’。” 童子问曰：“《象》曰‘山下出泉，蒙。君子以果行育德’，何谓也？”曰：“蒙者，未知所适之时也，处乎蒙者，果于自信其行以育德而已。《蒙》有时而发也，患乎不果于自修，以养其德而待也。” 童子问曰：“《象》曰‘云上于天，需。君子以饮食宴乐’，何谓也？”曰：“需，须也。事有期而时将至也。云已在天，泽将施也。君子之时将及矣，少待之焉。饮食以养其体，宴安和乐以养其志，有待之道也。” 童子问曰：“‘师，贞丈人’，何谓也？”曰：“师正于丈人也。其《彖》曰‘能以众正，可以王矣’。”童子曰：“敢问‘可以王矣’，孰能当之？”曰：“汤、武是已。彼二王者，以臣伐主，其为毒也甚矣。然其以本于顺民之欲而除其害，犹毒药瞑眩以去疾也，故其《彖》又曰‘行险而顺，以此毒天下，而民从之’。”童子曰：“然则汤、武之师正乎？”曰：“凡师必正于丈人者，文王之志也。以此毒天下而王者，汤、武也。汤、武以应天顺人为心，故孟子曰‘有汤、武之心则可也’。”童子曰：“‘吉，无咎’，何谓也？”曰：“为《易》之说者，谓无咎者本有咎也，又曰善补过也。呜呼！举师之成功，莫大于王也，然不免毒天下，而仅得补过、无咎，以此见兵非圣王之所务，而汤、武不足贵也。” 童子问曰：“‘地上有水，比。先王以建万国，亲诸侯’，何谓也？”曰：“王氏之传曰‘万国以比建，诸侯以比亲’，得之矣。盖王者之于天下，不可以独比也，故建为万国，君以诸侯，使其民各比其君，而万国之君共比于王，则视天下如身之使臂，臂之使指矣。” 童子问曰：“《同人》之《彖》曰‘唯君子为能通天下之志’，《象》又曰‘君子以类族辨物’，何谓也？”曰：“通天下之志者，同人也；类族辨物者，同物也。夫同天下者不可以一概，必使夫各得其同也。人睽其类而同其欲，则志通；物安其族而同其生，则各从其类。故君子于人则通其志，于物则类其族，使各得其同也。” 童子问曰：“‘天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦’，何谓也？”曰：“圣人急于人事者也，天人之际罕言焉，惟《谦》之《彖》略具其说矣。圣人，人也，知人而已。天地鬼神不可知，故推其迹；人可知者，故直言其情。以人之情而推天地鬼神之迹，无以异也。然则修吾人事而已，人事修，则与天地鬼神合矣。” 童子问曰：“‘雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考’，何谓也？”曰：“于此见圣人之用心矣。圣人忧以天下，乐以天下。其乐也，荐之上帝祖考而已，其身不与焉。众人之豫，豫其身耳。圣人以天下为心者也，是故以天下之忧为己忧，以天下之乐为己乐。” 童子问曰：“《观》之《象》曰‘先王以省方，观民设教’，何谓也？”曰：“圣人处乎人上而下观于民，各因其方、顺其俗而教之。民知各安其生而不知圣人所以顺之者，此所谓神道设教也。”童子曰：“顺民，先王之所难欤？”曰：“后王之不戾民者鲜矣。” 童子问曰：“‘剥，不利有攸往’。《彖》曰‘顺而止之，观象也。君子尚消息盈虚，天行也’者，何谓也？”曰：“《剥》，阴剥阳也，小人道长、君子道消之时也，故曰‘不利有攸往’。君子于此时而止，与《屯》之‘勿往’异矣。《屯》之世，众人宜勿往，而君子动以经纶之时也。剥者，君子止而不往之时也。剥尽则复，否极则泰，消必有息，盈必有虚，天道也，是以君子尚之，故顺其时而止，亦有时而进也。” 童子问曰：“‘《复》其见天地之心乎’者，何谓也？”曰：“天地之心见乎动，《复》也，一阳初动于下矣。天地所以生育万物者本于此，故曰‘天地之心’也。天地以生物为心者也，其《彖》曰‘刚反动而以顺行’是矣。”童子曰：“然则《象》曰‘先王以至日闭关，商旅不行，后不省方’，岂非静乎？”曰：“至日者，阴阳初复之际也，其来甚微。圣人安静以顺其微，至其盛然后有所为也，不亦宜哉？” 童子问曰：“《大过》之卦辞曰‘利有攸往，亨’，其《象》曰‘君子以独立不惧，遁世无闷’者，其往乎？其遯乎？”曰：“《易》非一体之书，而卦不为一人设也。《大过》者，挠败之世可以大有为矣。当物极则反易为之力之时，是以往而必亨也，然有不以为利而不为者矣，故居是时也，往者利而亨，遁者独立而无闷。” 童子问曰：“《坎》之卦曰‘习 坎’，其《彖》曰‘习 坎，重险也’者，何谓也？”曰：“《坎》因重险之象，以戒人之慎习 也。习 高山者可以追猿猱，习 深渊者至能泅泳出没以为乐。夫险可习 ，则天下之事无不可为也。是以圣人于此戒人之习 恶而不自知，诱人于习 善而不倦，故其《象》曰‘君子以常德行，习 教事’也。” 童子问曰：“‘咸，取女吉’，何谓也？”曰：“咸，感也。其卦以刚下柔，故其《彖》曰‘男下女’，是以‘取女吉’也。”童子又曰：“然则男女同类欤？”曰：“男女睽而其志通，谓各睽其类也。凡柔与柔为类，刚与刚为类。谓感必同类，则以柔应柔，以刚应刚，可以为咸乎？故必二气交 感，然后为咸也。夫物类同者自同也，何所感哉？惟异类而合，然后见其感也。铁石，无情之物也，而以磁石引针，则虽隔物而应。《彖》曰‘观其所感，而万物之情可见’者，谓此类也。”童子又曰：“然则圣人感人心而天下和平，是果异类乎？”曰：“天下之广，蛮夷戎狄、四海九州之类，不胜其异也。而能一以感之，此王者所以为大，圣人所以为能。” 童子问曰：“‘恒，利有攸往’，‘终则有始’，何谓也？”曰：“恒之为言久也，所谓穷则变，变则通，通则久也。‘久于其道者’，知变之谓也。天地升降而不息，故曰‘天地之道久而不已也’。日月往来，与天偕行而不息，故曰‘日月得天而能久照’。四时代谢，循环而不息，故曰‘四时变化而久成’。圣人者，尚消息盈虚，而知进退存亡者也，故曰‘圣人久于其道而化成’。” 童子问曰：“‘遁，亨，小利贞’，何谓也？”曰：“《遁》，阴进而阳遁也。遁者，见之先也。阴进至于否，则不正利矣。《遁》者阴浸而未盛，阳能先见而遁，犹得小利其正焉。” 童子问曰：“‘明入地中，明夷。君子以莅众，用晦而明’，何谓也？”曰：“日，君象也，而下入于地，君道晦而天下暗矣。大哉！万物各得其随，则君子向晦而入宴息。天下暗而思明，则君子出而临众。商纣之晦，周道之明也，因其晦发其明，故曰‘用晦而明’。”童子曰：“然则圣人贵之乎？”曰：“不贵也。圣人非武王而贵文王矣。” 童子问曰：“‘家人，利女贞’，何谓也？其不利君子之正乎？”曰：“是何言欤！《彖》不云乎：‘女正位乎内，男正位乎外也。’”童子曰：“然则何为独言利女正？”曰：“家道主于内，故女正乎内，则一家正矣。凡家人之祸，未有不始于女子者也，此所以戒也。呜呼！事无不利于正，未有不正而利者。圣人于卦，随事以为言，故于《坤》则利牝马之正，于《同人》则利君子正，于《明夷》则利艰正，于《家人》则利女正。” 童子问曰：“《睽》之《彖》与卦辞之义反，何谓也？”曰：“吾不知也。”童子曰：“《睽》之卦曰‘小事吉’，《彖》曰‘睽之时用大矣哉’。”曰：“小事睽则吉，大事睽则凶也。凡睽于此者，必有合于彼。地睽其下而升，天睽其上而降，则上下交 而为泰，是谓小睽而大合。使天地睽而上下不交 ，则否矣。圣人因其小睽而通其大利，故曰‘天地睽而其事同，男女睽而其志通，万物睽而其事类’，其《象》又曰‘君子以同而异’。"},{"title":"序卦 | 易传","date":"2017-10-14T04:16:38.000Z","path":"2017/10/14/yi-zhuan-xugua/","text":"有天地，然后万物生焉。盈天地之间者，唯万物，故受之以屯;屯者盈也，屯者物之始生也。物生必蒙，故受之以蒙;蒙者蒙也，物之稚也。物稚不可不养也，故受之以需;需者饮食之道也。饮食必有讼，故受之以讼。讼必有众起，故受之以师;师者众也。众必有所比，故受之以比;比者比也。比必有所畜也，故受之以小畜。物畜然后有礼，故受之以履。履而泰，然后安，故受之以泰;泰者通也。物不可以终通，故受之以否。物不可以终否，故受之以同人。与人同者，物必归焉，故受之以大有。有大者不可以盈，故受之以谦。有大而能谦，必豫，故受之以豫。豫必有随，故受之以随。以喜随人者，必有事，故受之以蛊;蛊者事也。有事而后可大，故受之以临;临者大也。物大然后可观，故受之以观。可观而后有所合，故受之以噬嗑;嗑者合也。物不可以苟合而已，故受之以贲;贲者饰也。致饰然后亨，则尽矣，故受之以剥;剥者剥也。物不可以终尽，剥穷上反下，故受之以复。复则不妄矣，故受之以无妄。有无妄然后可畜，故受之以大畜。物畜然后可养，故受之以颐;颐者养也。不养则不可动，故受之以大过。物不可以终过，故受之以坎;坎者陷也。陷必有所丽，故受之以离;离者丽也。有天地，然后有万物;有万物，然后有男女;有男女，然后有夫妇;有夫妇，然后有父子;有父子然后有君臣;有君臣，然后有上下;有上下，然后礼仪有所错。夫妇之道，不可以不久也，故受之以恒;恒者久也。物不可以久居其所，故受之以恒（遁）。（遁）者退也。物不可终恒（遁），故受之以大壮。物不可以终壮，故受之以晋;晋者进也。进必有所伤，故受之以明夷;夷者伤也。伤於外者，必反其家，故受之以家人。家道穷必乖，故受之以睽;睽者乖也。乖必有难，故受之以蹇;蹇者难也。物不可终难，故受之以解;解者缓也。缓必有所失，故受之以损;损而不已，必益，故受之以益。益而不已，必决，故受之以夬。夬者决也。决必有所遇，故受之以姤;垢者遇也。物相遇而后聚，故受之以萃;萃者聚也。聚而上者，谓之升，故受之以升。升而不已，必困，故受之以困。困乎上者，必反下，故受之以井。井道不可不革，故受之以革。革物者莫若鼎，故受之以鼎。主器者莫若长子，故受之以震;震者动也。物不可以终动，止之，故受之以艮;艮者止也。物不可以终止，故受之以渐;渐者进也。进必有所归，故受之以归妹。得其所归者必大，故受之以丰;丰者大也。穷大者必失其居，故受之以旅。旅而无所容，故受之以巽;巽者入也。入而后说之，故受之以兑;兑者说也。说而后散之，故受之以涣;涣者离也。物不可以终离，故受之以节。节而信之，故受之以中孚。有其信者，必行之，故受之以小过。有过物者，必济，故受之既济。物不可穷也，故受之以未济终焉。"},{"title":"系辞 | 易传","date":"2017-10-14T04:05:59.000Z","path":"2017/10/14/yi-zhuan-xici/","text":"上传1天尊地卑，乾坤定矣。卑高以陈，贵贱位矣。动静有常，刚柔断矣。方以类聚，物以群分，吉凶生矣。在天成象，在地成形，变化见矣。鼓之以雷霆，润之以风雨，日月运行，一寒一暑，乾道成男，坤道成女。乾知大始，坤作成物。 乾以易知，坤以简能。易则易知，简则易从。易知则有亲，易从则有功。有亲则可久，有功则可大。可久则贤人之德，可大则贤人之业。易简，而天下之理得矣；天下之理得，而成位乎其中矣。2圣人设卦观象，系辞焉而明吉凶，刚柔相推而生变化。是故，吉凶者，失得之象也。悔吝者，忧虞之象也。变化者，进退之象也。刚柔者，昼夜之象也。六爻之动，三极之道也。是故，君子所居而安者，易之序也。所乐而玩者，爻之辞也。是故，君子居则观其象，而玩其辞；动则观其变，而玩其占。是故自天佑之，吉无不利。3彖者，言乎象也。爻者，言乎变者也。吉凶者，言乎其失得也。悔吝者，言乎其小疵 也。无咎者，善补过也。是故，列贵贱者，存乎位。齐小大者，存乎卦。辩吉凶者，存乎辞。忧悔吝者，存乎介。震无咎者，存乎悔。是故，卦有小大，辞有险易。辞也者，也各指其所之。4易与天地准，故能弥纶天地之道。仰以观於天文，俯以察於地理，是故知幽明之故。原始反终，故知死生之说。精气为物，游魂为变，是故知鬼神之情状。与天地相似，故不违。知周乎万物，而道济天下，故不过。旁行而不流，乐天知命，故不忧。安土敦乎仁，故能爱。范围天地之化而不过，曲成万物而不遗，通乎昼夜之道而知，故神无方而易无体。5一阴一阳之谓道，继之者善也，成之者性也。仁者见之谓之仁，知者见之谓之知，百姓日用不知；故君子之道鲜矣!显诸仁，藏诸用，鼓万物而不与圣人同忧，盛德大业至矣哉!富有之谓大业，日新之谓盛德。生生之谓易，成象之谓乾，效法之谓坤，极数知来之谓占，通变之谓事，阴阳不测之谓神。6夫易，广矣大矣!以言乎远，则不御；以言乎迩，则静而正；以言乎天地之间，则备矣!夫乾，其静也专，其动也直，是以大生焉。夫坤，其静也翕，其动也辟，是以广生焉。7子曰：「易其至矣乎!」夫易，圣人所以崇德而广业也。知崇礼卑，崇效天，卑法地，天地设位，而易行乎其中矣。成性存存，道义之门。8圣人有以见天下之赜，而拟诸其形容，象其物宜；是故谓之象。圣人有以见天下之动，而观其会通，以行其典礼。系辞焉，以断其吉凶；是故谓之爻。言天下之至赜，而不可恶也。言天下之至动，而不可乱也。拟之而后言，议之而后动，拟议以成其变化。「鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。」子曰：「君子居其室，出其言，善则千里之外应之，况其迩者乎?居其室，出其言不善，则千里之外违之，况其迩乎?言出乎身，加乎民；行发乎远；言行君子之枢机，枢机之发，荣辱之主也。言行，君子之所以动天地也，可不慎乎?」「同人，先号啕而后笑。」子曰：「君子之道，或出或处，或默或语，二人同心，其利断金；同心之言，其臭如兰。」「初六，藉用白茅，无咎。」子曰：「苟错诸地而可矣；席用白茅，何咎之有?慎之至也。夫茅之为物薄，而用可重也。慎斯术也以往，其无所失矣。」「劳谦君子，有终，吉。」子曰：「劳而不伐，有功而不德，厚之至也，语以其功下人者也。德言盛，礼言恭，谦也者，致恭以存其位者也。「亢龙有悔。」子曰：「贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。」「不出户庭，无咎。」子曰：「乱之所生也，则言语以为阶。君不密，则失臣；臣不密，则失身；几事不密，则害成；是以君子慎密而不出也。」子曰：「作易者其知盗乎?易曰：『负且乘，致寇至。』负也者，小人之事也；小人而乘君子之器，盗思夺矣!上慢下暴，盗思伐之矣!慢藏诲盗，冶容诲淫，易曰：『负且乘，致寇至。』盗之招也。」9天一地二，天三地四，天五地六，天七地八，天九地十。天数五，地数五，五位相得而各有合。天数二十有五，地数三十，凡天地之数，五十有五，此所以成变化而行鬼神也。大衍之数五十，其用四十有九。分而为二以象两，挂一以象三，揲之以四以象四时，归奇於抟（扐）以象闰，故再抟（扐）而后挂。乾之策，二百一十有六。坤之策，百四十有四。凡三百有六十，当期之日。二篇之策，万有一千五百二十，当万物之数也。是故，四营而成易，十有八变而成卦，八卦而小成。引而伸之，触类而长之，天下之能事毕矣。显道神德行，是故可与酬酢，可与佑神矣。子曰：「知变化之道者，其知神之所为乎!」10是有圣人之道四焉，以言者尚其辞，以动者尚其变，以制器者尚其象，以卜筮者尚其 占。是以君主子将以有为也，将以有行也，问焉而以言，其受命也如向（响），无有远近幽深，遂知来物。非天下之至精，其孰能与於此。参伍以变，错综其数，通其变，遂马（成）天地之文；极其数，遂定天下之象。非天下之致变，其孰能与於此。易无思也，无为也，寂然不动，感而遂通天下之故。非天下之致神，其孰能与於此。夫易，圣人之所以极深而研几也。惟深也，故能通天下之志；惟几也，故能成天下之务；惟神也，故不疾而速，不行而至。子曰：「易有圣人之道四焉」者，此之谓也。11子曰：「夫易何为者也?夫易开物成务，冒天下之道，如斯而已者也。是故，圣人以通天下之志，以定天下之业，以断天下之疑。」是故，蓍之德，圆而神；卦之德，方以知；六爻之义，易以贡。圣人以此洗心，退藏於密，吉凶与民同患。神以知来，知以藏往，其孰能与於此哉!古之聪明睿知神武而不杀者夫?是以，明於天之道，而察於民之故，是与神物以前民用。圣人以此斋戒，以神明其德夫!是故，阖户谓之坤；辟户谓之乾；一阖一辟谓之变；往来不穷谓之通；见乃谓之象；形乃谓之器；制而用之，谓之法；利用出入，民咸用之，谓之神。是故，易有太极，是生两仪，两仪生四象，四象生八卦，八卦定吉凶，吉凶生大业。是故，法象莫大乎天地；变通莫大乎四时；悬象著明莫在（大）乎日月；崇高莫大乎富贵；备物致用，立成器以为天下利，莫大乎圣人；探赜索隐，钩深致远，以定天下之吉凶，成天下之亹亹者，莫大乎蓍龟。是故，天生神物，圣人执（则）之。天地变化，圣人效之。天垂象，见吉凶，圣人象之。河出图，洛出书，圣人则之。易有四象，所以示也。系辞焉，所以告也。定之以吉凶，所以断也。12易曰：「自天佑之，吉无不利。」子曰：「佑者助也。天之所助者，顺也；人之所助者，信也。履信思乎顺，又以尚贤也。是以自天佑之，吉无不利也。」子曰：「书不尽言，言不尽意；然则圣人之意，其不可见乎?」子曰：「圣人立象以尽意，设卦以尽情伪，系辞焉以尽其言，变而通之以尽利，鼓之舞之以尽神。」乾坤其易之□③（蕴）邪?乾坤成列，而易立乎其中矣。乾坤毁，则无以见易；易不可见，则乾坤或几乎息矣。是故，形而上者谓之道；形而下者谓之器；化而裁之谓之变；推而行之谓之通；举而错之天下之民谓之事业。是故，夫象，圣人有以见天下之赜，而拟诸形容，象其物宜，是故谓之象。圣人有以见天下之动，而观其会通，以行其典礼，系辞焉，以断其吉凶，是故谓之爻。极天下之赜者，存乎卦；鼓天下之动者，存乎辞；化而裁之，存乎变；推而行之，存乎通；神而明之，存乎其人；默而成之，不言而信，存乎德行。 下传1八卦成列，象在其中矣。因而重之，爻在其中矣。刚柔相推，变在其中矣。系辞焉而命之，动在其中矣。吉凶悔吝者，生乎动者也。刚柔者，立本者也。变通者，趣时者也。吉凶者，贞胜者也。天地之道，贞观者也。日月之道，贞明者也。天下之动，贞夫一者 也。夫乾，确然示人易矣。夫坤，聩然示人简矣。爻也者，效此者也。象也者，像此者也。爻象动乎内，吉凶见乎外，功业见乎变，圣人之情见乎辞。天地之大德曰生，圣人之大宝曰位。何以守位曰仁。何以聚人曰财。理财正辞，禁民为非曰义。2古者包羲氏之王天下也，仰则观象於天，俯则观法於地，观鸟兽之文，与地之宜，近取诸身，远取诸物，於是始作八卦，以通神明之德，以类万物之情。作结绳而为网罟，以佃以渔，盖取诸离。包羲氏没，神农氏作，斫木为耜，揉木为耒，耒耨之利，以教天下，盖取诸益。日中为市，致天下之货，交易而退，各得其所，盖取诸噬嗑。神农氏没，黄帝、尧、舜氏作，通其变，使民不倦，神而化之，使民宜之。易穷则变，变则通，通则久。是以自天佑之，吉无不利，黄帝、尧、舜，垂衣裳而天下治，盖取诸乾坤。刳木为舟，剡木为楫，舟楫之利，以济不通，致远以利天下，盖取诸涣。服牛乘马，引重致远，以利天下，盖取诸随。重门击柝，以待暴客，盖取诸豫。断木为杵，掘地为臼，臼杵之利，万民以济，盖取诸小过。弦木为弧，剡木为矢，弧矢之利，以威天下，盖取诸睽。上古穴居而野处，后世圣人易之以宫室，上栋下宇，以待风雨，盖取诸大壮。古之葬者，厚衣之以薪，葬之中野，不封不树，丧期无数，后世圣人易之以棺椁，盖取诸大过。上古结绳而治，后世圣人易之以书契，百官以治，万民以察，盖取诸□⑥（夬）。3是故，易者象也。象也者，像也。彖者材也。爻也者，效天下之动也。是故，吉凶生， 而悔吝著也。4阳卦多阴，阴卦多阳，其故何也?阳卦奇，阴卦耦（偶）。其德行何也?阳一君而二民，君子 之道也。阴二君而一民，小人之道也。5《易》曰：「憧憧往来，朋从尔思。」子曰：「天下何思何虑?天下同归而殊途，一致而百虑，天下何思何虑?」「日往则月来，月往则日来，日月相推而明生焉。寒往则暑来，暑往则寒来，寒暑相推而岁成焉。往者屈也，来者信也，屈信相感而利生焉。」「尺蠖之屈，以求信也。龙蛇之蛰，以存身也。精义入神，以致用也。利用安身，以崇德也。过此以往，未之或知也。穷神知化，德之盛也。」易曰：「困于石，据于蒺藜，入于其宫，不见其妻，凶。」子曰：「非所困而困焉，名 必辱。非所据而据焉，身必危。既辱且危，死期将至，妻其可得见邪?」易曰：「公用射隼，于高墉之上，获之无不利。」子曰：「隼者禽也，弓矢者器也，射 之者人也。君子藏器於身，待时而动，何不利之有?动而不括，是以出而不获。语成器而动者也。」子曰：「小人不耻不仁，不畏不义，不见利而不劝，不威不惩；小惩而大诫，此小人之福也。易曰：『履校灭趾，无咎。』此之谓也。」「善不积，不足以成名；恶不积，不足以灭身。小人以小善为无益，而弗为也，故恶积而不可掩，罪大而不可解。易曰：『履校灭耳，凶。』」子曰：「危者，安其位者也；亡者，保其存者也；乱者，有其治者也。是故，君子安而不忘危，存而不忘亡，治而不忘乱；是以，身安而国家可保也。易曰：『其亡其亡，系于包 桑。』」「天地絪缊，万物化醇。男女构精，万物化生。易曰：『三人行，则损一人；一人 行，则得其友。』言致一也。」子曰：「君子安其身而后动，易其心而后语，定其交而后求。君子修此三者，故全也。危以动，则民不与也；惧以语，则民不应也；无交而求，则民不与也。莫之与，则伤之者至矣。易曰：『莫益之，或击之，立心勿恒，凶。』」6子曰：「乾坤，其易之门邪?乾阳物也，坤阴物也。阴阳合德，而刚柔有体，以体天地之撰，以通神明之德。其称名也，杂而不越。於稽其类，其衰世之意邪?」子曰：「夫易，彰往而察来，而微显阐幽，开而当名，辨物正言，断辞则备矣。其称名也小，其取类也大，其旨远，其辞文，其言曲而中，其事肆而隐，因贰以济民行，以明失得之报。」7易之兴也，其於中古乎?作易者，其有忧患乎?是故，履，德之基也；谦，德之柄也；复，德之本也；恒，德之固也；损，德之修也；益，德之裕也；困，德之辨也；井，德之地也；巽，德之制也。履，和而至；谦，尊而光；复，小而辨於物；恒，杂而不厌；损，先难而后易；益，长裕而不设；困，穷而通；井，居其所而迁；巽，称而隐。履，以和行；谦，以制礼；复，以自知；恒，以一德；损，以远害；益，以兴利；困，以寡怨；井，以辨义；巽，以行权。8易之为书也不可远；为道也屡迁。变动不居，周流注（六）虚，上下无常，刚柔相易，不可为曲（典）要，唯变所适。其出入以度，外内使知惧，又明於忧患与故，无有帅（师）保，如临父母。初率其辞，而揆其方，既有曲（典）常。苟非其人，道不虚行。9易之为书也，原始要终，以为质也。六爻相杂，唯其时物也。其初难知，其上易知，本末也。初辞拟之，卒成之终。若夫杂物撰德，辨是与非，则非其中爻不备。噫!亦要存亡吉凶，则居可知矣。知者观其彖辞，则思过半矣。二与四，（位？）同功而异位，其善不同。二多誉，四多惧，近也。柔之为道，不利远者，其要无咎，其用柔中也；三与五，同功而异位，三多凶，五多功，贵贱之等也。其柔危，其刚胜邪?10易之为书也，广大悉备，有天道焉，有人道焉，有地道焉。兼三才而两之，故六；六者非它也，三才之道也。道有变动，故曰爻；爻有等，故曰物；物相杂，故曰文；文不当，故吉凶生焉。11易之兴也，其当殷之末世，周之盛德邪?当文王与纣之事邪?是故其辞危。危者使平，易者使倾，其道甚大，百物不废。惧以终始，其要无咎，此之谓易之道也。12夫乾，天下之至健也，德行恒易以知险。夫坤，天下之至顺也，德行恒简以知阻。能说诸心，能研诸侯之虑，定天下之吉凶，成天下之亹亹者。是故，变化云为，吉事有祥，象事知器，占事未（知）来。天地设位，圣人成能，人谋鬼谋，百姓与能。八卦以象告，爻彖以情言，刚柔杂居，而吉凶可见矣!变动以利言，吉凶以情迁。是故，爱恶相攻而吉凶生；远近相取而悔吝生，情伪相感而利害生。凡易之情，近而不相得则凶；或害之，悔且吝。将叛者，其辞渐，中心疑者其辞枝，吉人之辞寡，躁人之辞多，诬善之人其辞游，失其守者其辞屈。"},{"title":"说卦传 | 易传","date":"2017-10-14T04:01:57.000Z","path":"2017/10/14/yi-zhuan-shuogua/","text":"1昔者，圣人之作易也，幽赞神明而生蓍。参天两地而倚数，观变於阴阳，而立卦；发挥於刚柔，而生爻；和顺於道德而理於义；穷理尽性，以至於命。2昔者圣人之作易也，将以顺性命之理。是以立天之道，曰阴与阳；立地之道，曰柔与刚；立人之道，曰仁与义。兼三才而两之，故易六画而成卦。分阴分阳，迭用柔刚，故易六位而成章。3天地定位，山泽通气，雷风相薄，水火不相射，八卦相错，数往者顺，知来者逆；是故，易逆数也。4雷以动之，风以散之，雨以润之，日以烜之，艮以止之，兑以说之，乾以君之，坤以 藏之。5帝出乎震，齐乎巽，相见乎离，致役乎坤，说言乎兑，战乎乾，劳乎坎，成言乎艮。万物出乎震，震东方也。齐乎巽，巽东南也，齐也者，言万物之洁齐也。离也者，明也，万物皆相见，南方之卦也，圣人南面而听天下，向明而治，盖取诸此也。坤也者地也，万物皆致养焉，故曰致役乎坤。兑正秋也，万物之所说也，故曰说言乎兑。战乎乾，乾西北之卦也，言阴阳相薄也。坎者水也，正北方之卦也，劳卦也，万物之所归也，故曰劳乎坎。艮东北之卦也，万物之所成终，而所成始也，故曰成言乎艮。6神也者，妙万物而为言者也。动万物者，莫疾乎雷；桡万物者，莫疾乎风；燥万物者， 莫熯乎火；说万物者，莫说乎泽；润万物者，莫润乎水；终万物始万物者，莫盛乎艮。故水火相逮，雷风不相悖，山泽通气，然后能变化，既成万物也。7乾，健也；坤，顺也；震，动也；巽，入也；坎，陷也；离，丽也；艮，止也；兑，说也。8乾为马，坤为牛，震为龙，巽为鸡，坎为豕，离为雉，艮为狗，兑为羊。9乾为首，坤为腹，震为足，巽为股，坎为耳，离为目，艮为手，兑为口。10乾天也，故称父，坤地也，故称母；震一索而得男，故谓之长男；巽一索而得女，故谓之长女；坎再索而得男，故谓之中男；离再索而得女，故谓之中女；艮三索而得男，故谓之少男；兑三索而得女，故谓之少女。11乾为天、为圜、为君、为父、为玉、为金、为寒、为冰、为大赤、为良马、为瘠马、为 驳马、为木果。坤为地、为母、为布、为釜、为吝啬、为均、为子母牛、为大舆、为文、为众、为柄、其於地也为黑。震为雷、为龙、为玄黄、为敷、为大涂、为长子、为决躁、为苍筤竹、为萑苇。其於马也，为善鸣、为馵（Zhù)足，为的颡。其於稼也，为反生。其究为健，为蕃鲜。巽为木、为风、为长女、为绳直、为工、为白、为长、为高、为进退、为不果、为臭。其於人也，为寡发、为广颡、为多白眼、为近利市三倍。其究为躁卦。坎为水、为沟渎、为隐伏、为矫輮、为弓轮。其於人也，为加忧、为心病、为耳痛、为血卦、为赤。其於马也，为美脊、为亟心、为下首、为薄蹄、为曳。其於舆也，为丁躜。为通、为月、为盗。其於木也，为坚多心。离为火、为日、为电、为中女、为甲胄、为戈兵。其於人也，为大腹，为乾卦。为鳖、为蟹、为蠃、为蚌、为龟。其於木也，为科上槁。艮为山、为径路、为小石、为门阙、为果苽（蓏）、为阍寺、为指、为狗、为鼠、为黔喙之属。其於木也，为坚多节。兑为泽、为少女、为巫、为口舌、为毁折、为附决。其於地也，刚卤。为妾、为羊。"},{"title":"第二十四式 撇身捶","date":"2017-10-13T11:01:33.000Z","path":"2017/10/13/taiji-24-pieshen/","text":"1左腿重心不变，左胯微收，身体右转。左脚里扣90度，踏实。2重心移于左腿，右脚提起，身体仍向右松转3右胯开，膝外旋，右脚向前稍偏右迈出，脚跟先着地。4重心渐渐移向右脚，踏实，弓右腿，蹬左腿。 第二十五式 进步搬拦捶1重心移向左腿，身体微左转。2左腿踏实，右膝提起，脚尖自然下垂。 4567与 第十二式 相同 第二十六式 上步揽雀尾1左脚尖外撇，踏实，右脚提起向前，身体左转。2与 第三式 相同 第二十七式 单鞭第二十八式 云手1腰身微右转，重心不变，左脚尖里扣朝正前方，踏实2重心移于左脚，右脚虚着地，腰向右微转。3腰微左转，右脚提起，向左脚横向移动，小腿自然放松下垂。4右脚向左脚旁，平行落下，脚尖先着地，随着重心渐渐右移，全脚踏实。5腰继续右转，重心渐渐移至右脚，左脚缓缓提起。6腰稍松沉，左脚向左横跨半步，脚尖先着地，重心左移。7腰左转，重心移于左脚完成三个或五个 单鞭1右脚落于左脚旁，脚尖落下时成45度内扣，踏实，腰右转，重心渐渐移于右腿，左脚提起，先脚跟，后脚尖2同 第四式。"},{"title":"第二十三式 扇通背","date":"2017-10-13T10:57:51.000Z","path":"2017/10/13/taiji-23-shantong/","text":"1身体拔起，腰微右转，左脚提回。2左脚向前迈出一步，脚跟先着地，重心前移，左脚踏实，弓左腿，蹬右腿。"},{"title":"第二十二式 海底针","date":"2017-10-13T10:46:36.000Z","path":"2017/10/13/taiji-22-haidi/","text":"1重心移于左脚，右脚稍提，向前一脚许落下。脚掌先着地，重心渐渐移向右脚，踏实，左脚提起，脚尖自然下垂。2左脚略里收，脚尖虚着地，成左虚步。3腰向左松转，折腰下沉"},{"title":"第十九式 提手上势","date":"2017-10-13T09:43:40.000Z","path":"2017/10/13/taiji-19-tishou/","text":"1重心渐渐移至右脚，左脚稍提起，向前一脚许落下，重心渐渐移至左腿。腰微左转，右脚稍提起向前一脚许落下。脚跟着地，脚尖微抬，膝微弓，成右虚步。 第二十式 白鹤亮翅第二十一式 左搂膝拗步"},{"title":"第十八式 斜飞式","date":"2017-10-13T09:38:40.000Z","path":"2017/10/13/taiji-18-xiefei/","text":"1重心移于左脚，右脚稍离地自然收回，与左脚横向齐。2身体右转，右脚向右后方撤出，脚跟先着地，重心渐渐移至右脚，而右脚踏实，弓右腿，蹬左腿。"},{"title":"第十七式 左右倒撵猴","date":"2017-10-13T09:11:10.000Z","path":"2017/10/13/taiji-17-zuoyoudao/","text":"右倒撵猴1右胯微收，身体微右转，左脚尖轻落地。2重心渐渐移于右腿，身体继续右转，左脚提起，弧形收至右脚内侧，虚悬3左脚后撤一步，稍偏左落下，脚尖先着地，腰微左转，使身体朝正前方。4左脚跟落地内收，使脚尖朝左前约45度落实，重心渐渐移于左脚。右脚尖渐渐向左摆正，朝正前方，成右虚步，腰向左转45度。 左倒撵猴右倒撵猴"},{"title":"第十六式 肘底看捶","date":"2017-10-13T09:01:24.000Z","path":"2017/10/13/taiji-16-zhoudi/","text":"1 2参考单鞭，起式为西北3重心落于右腿，左膝领起，左脚自然离地。4腰向左松转，左脚向正东迈出。5左脚落下，重心渐渐移于左脚，身体继续左转至30度。6右脚轻轻提起，向前移动半脚落下，脚尖先着地。重心移于后腿。7右腿踏实，腰微右转，左脚略提，稍向前移，脚跟着地，成左虚步。"},{"title":"第十五式 抱虎归山","date":"2017-10-13T07:39:51.000Z","path":"2017/10/13/taiji-15-baohu/","text":"右搂膝拗步1腰向右松转，左脚里扣45度，踏实，两脚屈膝下蹲。2身体微沉，右脚渐渐提起，小腿自然下垂。3松腰胯，身体右转，右脚向西北方向迈出，脚跟先着地。4腰继续右转，重心渐渐移于右脚，弓右腿，蹬左腿。 履势左脚微屈，重心微后坐，身体微左转"},{"title":"第十四式 十字手","date":"2017-10-13T07:32:40.000Z","path":"2017/10/13/taiji-14-shizi/","text":"1左脚尖里扣90度，身体右转2重心移于左腿，右脚提起，身体微沉3右脚左移，与左脚平齐，与肩同宽。脚尖先着地，渐至全脚踏实。"},{"title":"第十三式 如封似闭","date":"2017-10-13T07:30:01.000Z","path":"2017/10/13/taiji-13-rufeng/","text":"1右膝微屈，重心稍后移2重心继续后移，右腿坐实3重心向前移，弓左腿，蹬右腿"},{"title":"第十二式 进步搬拦捶","date":"2017-10-13T07:03:57.000Z","path":"2017/10/13/taiji-12-jibu/","text":"1左脚为轴，脚尖外撇45度，腰身渐左转，左脚踏实2右膝上提，脚尖自然下垂。3右脚向前斜方45度迈出，脚跟先着地，脚尖微外撇。4腰微右转，重心移于右脚，左脚提起5腰身微右转，身体微沉，左脚向前迈出。6腰身微左转，重心移于左腿，弓左腿，蹬右腿"},{"title":"第九式 左右搂膝拗步","date":"2017-10-13T06:43:12.000Z","path":"2017/10/13/taiji-9-zuoyoulou/","text":"左搂膝拗步右胯微收坐，腰微右转30度 右搂膝拗步1左脚跟为轴，脚尖外撇45度，身体左转。2重心移于左腿，腰继续左转，右膝向前领起，小腿放松自然下垂。3胯部微沉，右腿向前迈出，脚跟先着地，腰微右松转4腰转至正前方，弓右腿，蹬左腿。 左搂膝拗步第十式 手挥琵琶第十一式 左搂膝拗步"},{"title":"第八式 手挥琵琶","date":"2017-10-13T06:33:57.000Z","path":"2017/10/13/taiji-8-shouhui/","text":"1身体向前移动，重心移于左腿，右脚抬起。2右脚向前一脚距离落下，脚掌先着地，重心渐渐移于右腿。3身体渐渐右转45度，左脚稍抬起，距离原地一脚许地方落下，脚跟着地，脚尖微翘，膝微弓，成左虚步。"},{"title":"第七式 左搂膝拗步","date":"2017-10-13T06:26:16.000Z","path":"2017/10/13/taiji-7-zuolou/","text":"1右腿重心不变，胯部微收，腰右转30度。腰，肩，肘自然松沉。2左脚提起，脚尖自然下垂，身体向右转至60度。3身体微沉，左脚向前迈出，脚跟先落，腰微左松转。4腰继续转至正前方，弓左腿，蹬右腿。"},{"title":"第六式 白鹤亮翅","date":"2017-10-13T06:22:28.000Z","path":"2017/10/13/taiji-6-baihe/","text":"腰微右转，重心落于右腿。左脚稍提起，朝前轻点地，膝微弓。腰微左转，使身体朝正东。"},{"title":"第五式 提手上势","date":"2017-10-13T06:00:46.000Z","path":"2017/10/13/taiji-5-tishou/","text":"1左足内扣45度，胯部下沉微收，身体渐渐右转，重心落于左腿。右脚以膝领起，小腿自然提起微收，向前迈步，偏右落地。脚尖自然翘起，右膝微弓，成右虚步。2胯部微收，腰微左转，右膝提起，小腿自然放松3右足原地落下，脚跟先着地，腰渐左转，右脚跟为轴，内扣30度，重心移于右腿，下蹲坐实。"},{"title":"第四式 单鞭","date":"2017-10-13T05:51:30.000Z","path":"2017/10/13/taiji-4-danbian/","text":"1右脚跟为轴，脚尖微翘，内扣135度，身体左转。2身体微右转。3重心落于右腿，左膝领起，左脚离地，往里收，足尖自然下垂。4身体慢慢左转，左腿向前迈出，脚跟先着地。重心前移，弓左腿，蹬右腿。"},{"title":"第三式 揽雀尾","date":"2017-10-12T13:40:43.000Z","path":"2017/10/12/taiji-3-lanquewei/","text":"左掤(bing)势足两膝微屈，胯部微收，身体略沉，重心落于两腿之间，成小马步。身体渐沉，右脚尖外撇60度，身随体转，重心移于右腿，屈膝坐实。左脚渐起，收至右脚内侧。 胯部左转，左脚向前迈出一步，脚跟先着地，胯部右转，左脚尖朝内扣30度，重心左移，右蹬腿。 右掤势足胯部外旋内收，重心落于左腿，右腿自然领起。 胯部右转，右脚向前，脚跟先着地，重心前移。蹬左腿，弓右腿。 履势左腿微屈，腰微沉，重心后坐，身体微左转。重心移至左腿，身体左转45度。左腿实，右虚步。 挤势身体微右转，重心前移，弓右腿，蹬左腿 按势重心渐移至后腿，坐实，成右虚步。重心前移，弓右腿，蹬左腿。"},{"title":"第二式 起势","date":"2017-10-12T13:33:49.000Z","path":"2017/10/12/taiji-2-qishi/","text":"动作两臂徐徐向前，举至肩高，同肩宽；随即，两肘下沉，带回小臂渐渐向下按至两胯旁前，掌心朝下，五指朝前"},{"title":"第一式 预备式","date":"2017-10-12T13:28:38.000Z","path":"2017/10/12/taiji-1-yubei/","text":"动作两足左右分开站立，脚尖朝前，平行与肩宽；两臂自然下垂，肘关节微屈，腋下留一拳空隙。两掌心朝内，五指自然伸直，头正直，目平视。"},{"title":"观卦 | 易经","date":"2017-10-12T06:55:34.000Z","path":"2017/10/12/yi-20-guan/","text":"观:盥(guan)而不荐,有孚顒(yong)若。【译】《观卦》象征瞻仰:瞻仰了祭祀开头盛大的倾酒灌地的降神仪式,就可以不去看 后面的献饗之礼了,因为这时心中已经充满了诚敬肃穆的情绪。《象》曰:风行地上,观;先王以省方观民设教。【译】《象辞》说:《观卦》的卦象是坤(地)下巽(风)上,为风吹拂于地上而遍及万 物之表象,象征瞻仰。先代君王仿效风吹拂于地而遍及万物的精神,视察四方,留心民 风民俗,用教育来感化民众。 初六,童观,小人无咎,君子吝。【译】初六,像幼稚的儿童一样观察景物,这对无知的庶民来说,不会有害处,但对担 任教化重任的君子来说,就未免有所憾惜。 《象》曰:初六,“童观”,小人道也。【译】《象辞》说:《观卦》的第一位(初六),“像幼稚的儿童一样观察景物”,这是浅 薄的小人之道。 六二,闚(kui)观,利女贞。【译】六二,由门缝中偷观景物,有利于妇女保持节操,坚持正道。 ￼《象》曰:“闚观,女贞”,亦可丑也。【译】《象辞》说:“由门缝中偷观景物,对于妇女来说有利于坚持正道,固守贞操”, 但对男子汉来说,这样的行为就丢丑了。 六三,观我生,进退。【译】对照高尚的道德标准来省察自己的言行,审时度势,小心谨慎地决定进退。 《象》曰:“观我生,进退”,未失道也。【译】《象辞》说:“对照高尚的道德标准省察自己的言行,审时度势,小心谨慎地决定 进退”,这样做是不失原则的。 六四,观国之光,利用宾于王。【译】六四,瞻仰一个国家的文治武功,有利于成为君王的宾客和辅佐。 《象》曰:“观国之光”,尚宾也。【译】《象辞》说:“瞻观一个国家的文治武功”,说明此国崇尚贤士。 九五,观我生,君子无咎。【译】九五,对照高尚的道德标准省察自己的言行,不断地完善自己,君子就不会有祸 患。 《象》曰:“观我生”,观民也。【译】《象辞》说:“对照高尚的道德标准,审察自己的言行,弄清自己的德行”,便可知万民的德行。 ￼￼上九,观其生,君子无咎。【译】上九,君子时刻瞻仰君主的德行和作为,并按照君主的德行和作为行事,这样才不会有祸患。 《象》曰:“观其生”,志未平也。【译】《象辞》说:“君子时刻瞻仰君主的德行和作为”,因为君子始终以天下为己任,天下未安,其志难平。"},{"title":"临卦 | 易经","date":"2017-10-12T06:52:47.000Z","path":"2017/10/12/yi-19-lin/","text":"临:元,亨,利,贞。至于八月有凶。【译】《临卦》象征督导:能亨通无阻,祥和有益,坚守正道。但是到了八月(阳衰阴 盛),会有凶险。《象》曰:泽上有地,临;君子以教思无穷,容保民无疆。【译】《象辞》说:《临卦》的卦象是兑(泽)下坤(地)上,为地在泽上之表象。泽上 有地,地居高而临下,象征督导。君子由此受到启发,费尽心思地教导人民,并以其无 边无际的盛德保护人民。 初九,咸临,贞吉。【译】初九,感应尊贵者,使其行督导之责。可获吉祥。 《象》曰:“咸临,贞吉”,志行正也。【译】《象辞》说:“感应尊贵者,使其行督导之责,可获吉祥”,说明其志向和行为都 很正派。 九二,咸临,吉,无不利。【译】九二,“感应尊贵者,使其行督导之责,可获吉祥”,不会有什么不利。 《象》曰:“咸临,吉,无不利”,未顺命也。【译】《象辞》说:“感应尊贵者,使其行督导之责,可获吉祥,不会有什么不利”,这 是由于不囿于命运安排的樊笼,自身努力的结果。 六三,甘临,无攸利;既忧之,无咎。【译】六三,居高临下,靠甜言蜜语去督导,必无所利;但是,已经觉悟,能忧惧改过, 就不会有祸害。 《象》曰:“甘临”,位不当也。“既忧之”,咎不长也。【译】《象辞》说:“居高临下,靠甜言蜜语去督导”,这是因为六三爻位置不当的缘故。 但是,“已经觉悟,能忧惧改过”,危害就不会长久了。 ￼￼六四,至临,无咎。【译】六四,亲善地督导下级,则必然没有祸害。 《象》曰:“至临,无咎”位当也。【译】《象辞》说:“亲善的督导下级,则必然没有祸害”,这是因为六四爻位置确当的 缘故。 六五,知临,大君之宜,吉。【译】六五,以聪明才智来实行督导,这是伟大君主最适宜的统治之道,能获得吉祥。 《象》曰:“大君之宜”,行中之谓也。【译】《象辞》说:“以聪明才智来实行督导,这是伟大君主最适宜的统治之道”,说的 就是行中庸之道。 上六,敦临,吉,无咎。【译】上六,温柔敦厚地实行督导,能获得吉祥,没有危害。 《象》曰:“敦临之吉”,志在内也。【译】《象辞》说:“温柔敦厚地实行督导,能获得吉祥”,说明其志在于利国利家(在内)。"},{"title":"蛊卦 | 易经","date":"2017-10-12T06:49:47.000Z","path":"2017/10/12/yi-18-gu/","text":"蛊:元亨,利涉在川;先甲三日,后甲三日。【译】《蛊卦》象征救弊治乱,拨乱反正:从开始就很亨通,有利于涉越大河。不过, 在做大事以前,要考察现状、分析事态;在做大事以后,要讲究治理措施,预计到后果。《象》曰:山下有风,蛊;君子以振民育德。【译】《象辞》说:《蛊卦》的卦象是巽(风)下艮(山)上,为山下起大风之表象,象 征救弊治乱、拨乱反正。这时候,君子救济人民,培育美德,纠正时弊。 初六,干父之蛊,有子考,无咎;厉终吉。【译】初六,挽救父辈所败坏了的基业,由能干的儿子来继承父辈的事业,必无危害; 即使遇到艰难险阻,只要努力奋斗,最终必获吉祥。 《象》曰:“干父之蛊”,意承考也。【译】《象辞》说:“挽救父辈所败坏了的基业”,表明其志在继承父辈的遗业。 ￼￼九二,干母之蛊,不可贞。【译】九二,救治母辈所造成的弊病,要耐心等待,如果时机不成熟的话,就要坚守正 道等待时机。 《象》曰:“干母之蛊”,得中道也。【译】《象辞》说:“救治母辈所造成的弊病”,刚柔适中,既要顺应,又要匡救,不可 偏颇。 九三,干父之蛊,小有悔,无大咎。【译】九三,要挽救父辈败坏了的基业,其间必发生失误,因而会产生懊悔,但不会有 大的危害。 《象》曰:“干父之蛊”,终无咎也。【译】《象辞》说:“挽救父辈败坏了的基业”,最终不会有祸害。 六四,裕父之蛊,往见吝。【译】六四,宽缓地挽救父辈败坏了的基业,往前发展,必然会因耽误时机遗憾惋惜。 《象》曰:“裕父之蛊”,往未得也。【译】《象辞》说:“宽缓地挽救父辈所败坏了的基业”,往前发展,难以达到挽救的效 果。 六五,干父之蛊,用誉。【译】六五,挽救父辈败坏的基业,一定会受到人们的赞誉。 《象》曰:“干父用誉”,承以德也。【译】《象辞》说:“挽救父辈所败坏的基业,一定会受到人们的赞誉”,因为以美德继 承父辈的遗业,总是会受到欢迎的。 上九,不事王侯,高尚其事。【译】上九,不侍奉王侯,超然物外,孤芳自赏,使自己的德行至高无上。 《象》曰:“不事王侯”,志可则也。【译】《象辞》说:“不侍奉王侯”,这高洁的志向,可作为人们学习的准则。"},{"title":"随卦 | 易经","date":"2017-10-12T06:46:15.000Z","path":"2017/10/12/yi-17-sui/","text":"随:元,亨,利,贞,无咎。【译】《随卦》象征随从,随和:如果随从、随和,便能始终亨通,和谐有利。固守正 道,没有任何危险。 ￼￼《象》曰:泽中有雷,随;君子以向晦入宴息。【译】《象辞》说:《随卦》的卦象是震(雷)下兑(泽)上,为泽中有雷之表象。泽中 有雷声,泽随从雷声而震动,这便象征随从。君子行事要遵从合适的作息时间。白天出 处辛劳工作,夜晚就回家睡觉安息。 初九,官有渝,贞吉。出门交,有功。【译】初九,思想随时代而变化,坚持正道可获吉祥。出门交朋友,一定能成功。 《象》曰:“官有渝”,从正吉也;“出门交,有功”,不失也。【译】《象辞》说:“思想随时代而变化”,但无论怎么变,都必然始终遵从正道,这样 就可以获得吉祥。“出站交朋友,一定能成功”,这是因为其唯正是从,见善则从,没有 过失的缘故。 六二,係小子,失丈夫。【译】六二,倾心随从于年轻小子,则会失去了阳刚方正的丈夫。 《象》曰:“係小子”,弗兼与也。【译】《象辞》说:“倾心随从于年轻小子则会失去阳刚方正的丈夫”,因为二者是互相 排斥的,是不可兼得的。 六三,係丈夫,失小子。随有求得,利居贞。【译】六三,随从阳刚方正的丈夫行事,则必然丢失年轻小子。随从于丈夫,有求必得, 有利于安居乐业,坚守妇道,贞节处世。 《象》曰:“係丈夫”,志舍下也。【译】《象辞》说:“随从阳刚方正的丈夫行事”,专心不二,说明其志在于舍弃下方的 年轻小子。 九四,随有获,贞凶;有孚在道,以明,何咎!【译】九四,他人追随自己,虽有收获,但有可能发生凶险。虽有凶险,但只要心存诚 信,不违正道,使自己的美德显明,那还有什么危害呢? 《象》曰:“随有获”,其义凶也。“有孚在道”,明功也。【译】《象辞》说:“他人追随自己,虽有收获”,但因居位不当,有“震主”之嫌,所 以可能有凶险。但只要“心存诚信,不违正道”,则可逢凶化吉,这是由于立身光明磊 落所带来的功效。 九五,孚于嘉,吉。【译】九五,把诚信带给诚实善良之人,可获吉祥。 《象》曰:“孚于嘉,吉”,位正中也。【译】《象辞》说:“把诚信带给诚实善良之人,可获吉祥”,这是因为九五爻得正居中, 不倚不偏。 ￼￼上六,拘係之,乃从,维之;王用亨于西山。【译】上六,只有拘禁起来强迫、命令他,他才不得不顺服追随,再用绳索捆绑紧,才 能追随到底。君王在西山设祭,要出师讨伐那些不顺从的人。 《象》曰:“拘係之”,上穷也。【译】《象辞》说:“只有拘禁起来强迫、命令他,他才不得不顺服追随”,这是因为上 六爻高居《随卦》最上爻,物极必反的缘故。"},{"title":"豫卦 | 易经","date":"2017-10-12T06:05:28.000Z","path":"2017/10/12/yi-16-yu/","text":"豫:利建侯行师。【译】《豫卦》象征欢乐愉快:有利于建立诸侯的伟大功业,有利于出师南征北战。《象》曰:雷出地奋,豫。先王以作乐崇德,殷荐之上帝,以配祖考。【译】《象辞》说:《豫卦》的卦象为坤(地)下震(雷)上,为地上响雷之表象。雷在 地上轰鸣,使大地振奋起来,这就是大自然愉快高兴的表现。上古圣明的君主,根据大 自然欢乐愉快时雷鸣地震的情景创造了音乐,并用音乐来崇尚推广伟大的功德。他们以 盛大隆重的仪礼,把音乐献给天帝,并用它来祭祀自己的祖先。 初六,鸣豫,凶。【译】初六,自鸣得意,高兴过了头,结果乐极生悲,必遭凶险。 《象》曰:初六,“鸣豫”,志穷凶也。【译】《象辞》说:《豫卦》的第一位(初六),“自鸣得意,高兴过了头”,说明它没有 雄心壮志,志向容易满足。一满足,就得意忘形,结果必遭凶险。 ￼￼六二,介于石,不终日,贞吉。【译】六二,正直而不同流合污的品德坚如磐石,还不到一天时间,就明白了欢乐愉快 的深刻道理,能守正必获吉祥。 《象》曰:“不终日,贞吉”,以中正也。【译】《象辞》说:“还不到一天时间,就明白了愉快欢乐的深刻道理,能守正必获吉 祥”,这是因为能居中守正,在欢乐中既不过分,也不会不满足,因而获得吉祥。 六三,盱(xu)豫悔;迟有悔。【译】六三,有谄媚奉承暗送秋波的手段取悦于上司,以求得自己的欢乐,这势必导致 悔恨。如若执迷不悟,悔恨不及时,就会招致更大的悔恨。 《象》曰:“盱豫有悔”,位不当也。【译】《象辞》说:“用谄媚奉承、暗送秋波的手段取悦于上司,以求得自己欢乐,这势 必导致悔恨”,这是由于六三爻所处位置不正的缘故。 九四,由豫,大有得;勿疑,朋盍(he)簪(zan)。【译】九四,人们由于他而得到欢乐愉快,大有所获;毋庸置疑,朋友们会像头发汇聚 于簪子一样,积聚在他周围。 《象》曰:“由豫,大有得”,志大行也。【译】《象辞》说:“人们由于得到欢乐愉快,大有所获”,表明九四爻的阳刚之志,可 以放手实现。 六五,贞疾,恒不死。【译】六五,国中出现了不少弊病,但仍能长时间地支持下去而不致灭亡。 《象》曰:六五“贞疾”,乘刚也;“恒不死”,中未亡也。【译】《象辞》说:《豫卦》的第五爻位(六五)指出,“国中出现了不少弊病”,但有刚 强之臣辅佐,“仍能长时间地支持下去而不致灭亡”,这是因为它居中,只要保持中庸, 就会长时间地坚持下去而不致于灭亡。 上六,冥豫成,有渝无咎。【译】上六,已处在天昏地暗的局面之中,但却执迷不悟,仍沈溺于寻欢作乐之中,十 分危险。但只要及时觉悟,改弦易辙,则可避免祸害。 《象》曰:“冥豫”在上,何可长也?【译】《象辞》说:“已处在天昏地暗的局面之中,但却执迷不悟,仍沈溺于寻欢作乐之 中”,并高高在上,不察下情,这样的欢乐愉快怎能长久地保持呢?"},{"title":"谦卦 | 易经","date":"2017-10-12T05:46:18.000Z","path":"2017/10/12/yi-15-qian/","text":"谦:亨,君子有终。【译】《谦卦》象征谦虚:谦虚的美德可以使百事顺利,但谦虚并不是人人都能坚持下 去的,而只有君子才能坚持到底。《象》曰:地中有山,谦。君子以裒多益寡,称物平施。【译】《象辞》说:《谦卦》的卦象是艮(山)下坤(地)上,为高山隐藏于地中之表象, 象征高才美德隐藏于心中而不外露,所以称作谦。君子总是损多益少,衡量各种事物, 然后取长补短,使其平均。 初六,谦谦君子,用涉大川,吉。【译】初六,谦虚而又谦虚的君子,可以涉过大河(意思是能够克服一切困难,排除一 切障碍),最终必然安全吉祥。 《象》曰:“谦谦君子”,卑以自牧也。【译】《象辞》说:“谦虚而又谦虚的君子”,即使处于卑微的地位,也能以谦虚的态度 自我约束;而不因为位卑,就在品德方面放松修养。 六二,鸣谦,贞吉。【译】六二,谦虚的美名远扬四方,固守中正就可获得吉祥。 《象》曰:“鸣谦,贞吉”,中心得也。【译】《象辞》说:“谦虚的美名远扬四方,固守中正就可获得吉祥”,这是说六二爻以 心中纯正羸得名声,而不是靠沽名钓誉获取名声。 九三,劳谦君子,有终,吉。【译】九三,勤劳而谦虚的君子,必能把美德保持到底,最终一定是吉祥的。 《象》曰:“劳谦君子”,万民服也。【译】《象辞》说:“勤劳而又谦虚的君子,必能把美德保持到底”,所以天下的老百姓 都服从他。 六四,无不利,挥谦。【译】六四,没有任何不吉利,要发扬光大谦虚的美德。 《象》曰:“无不利,挥谦”,不违则也。【译】《象辞》说:“没有任何不吉利,要发扬光大谦虚的美德”这不违背谦虚导致亨通 的原则。 六五,不富,以其邻利用侵伐,无不利。【译】六五,虽不富有,但却虚怀若谷,有利于和近邻一起征伐那些骄傲蛮横不可一世 的人,不会有任何不吉利的结果。 《象》曰:“利用侵伐”,征不服也。【译】《象辞》说:“有利于出兵讨伐”,是指征伐那些骄横而不可一世的人。 上六,鸣谦,利用行师,征邑国。【译】上六,谦虚的美德远扬四方,有利于征伐邻近的小国。 ￼￼《象》曰:“鸣谦”,志未得也;“可用行师”,征邑国也。【译】《象辞》说:“谦虚的美名远扬四方”,但安邦定国之志未酬,所以“可用出师征 讨”的办法来惩处那些骄横不可一世的小国。"},{"title":"大有卦 | 易经","date":"2017-10-12T05:28:11.000Z","path":"2017/10/12/yi-14-dayou/","text":"大有:元亨。【译】《大有卦》象征大有收获:至为亨通。《象》曰:火在天上,“大有”;君子以遏(e)恶扬善,顺天休命。【译】《象辞》说:《大有卦》的卦象是乾(天)下离(火)上,为火在天上之表象。火 焰高悬于天上,象征太阳照耀万物,世界一片光明,农业大丰收,“大有收获”。君子在 这个时候要阻止邪恶,颂扬一切善行,顺应天命,替天行道,以保护万物性命。 初九,无交害,匪咎;艰则无咎。【译】初九,不互相来往,也不彼此伤害,没有什么祸患;要牢记过去的艰难困苦,才 能免于引起祸患。 《象》曰:大有初九,无交害也。【译】《象辞》说:《大有卦》的第一爻(初九),说明此时不互相往来,一动不如一静, 就不会有什么事非,自然没有什么祸患了。 九二,大车以载,有攸往,无咎。【译】九二,用大车装载着财物,送到前面的地方,必然没有什么祸患。 《象》曰:“大车以载”,积中不败也。【译】《象辞》说:“用大车装载着财物”,说明很富有,只要把财物放于车中,无论怎 样颠簸震荡,都不会倾覆。 九三,公用亨于天子,小人弗克。【译】九三,王公前来朝贺,向天子贡献礼品并致以敬意,小人不能担任如此重要的职 务。 《象》曰:“公用亨于天子”,小人害也。【译】《象辞》说:“王公前来朝贺,向天子贡献礼品并致以敬意”,小人若担任如此重 要的职务,必然发生变乱,成为祸害。 九四,匪其彭,无咎。【译】九四,虽然家财万贯,但不过分聚敛财物,就不会发生灾祸。￼￼六五,厥(jue)孚交加,威如,吉。【译】六五,以诚实守信的准则对外交往,对上尊敬,对下怀柔,必然增加个人的威信, 是吉祥的。 《象》曰:“厥孚交加”,信以发志也;“威如之吉”,易而无备也。【译】《象辞》说:“以诚实守信的准则对外交往,对上尊敬,对下怀柔”,说明以自己 的诚实信用感动别人,使别人也变得诚实守信起来;“必然增加个人的威信,是吉祥的”, 说明平易近人,纯真简朴,无所防备,反而使人人敬畏。 上九,自天佑之,吉无不利。【译】上九,上天保佑有德之人,赐福于己,吉祥,无往不利。 《象》曰:《大有》上吉,自天佑也。【译】《象辞》说:《大有卦》第六爻位(上九)的吉祥,是上天保佑有道德的人,是上 天赐给的福分,只有顺天应人,才能大有收获,得到大量的财富。"},{"title":"同人卦 | 易经","date":"2017-10-12T05:21:38.000Z","path":"2017/10/12/yi-13-tong/","text":"同人,同人于野,亨,利涉大川,利君子贞。【译】《同人卦》象征与人和睦相处:和别人亲密地走在宽广的原野上,亨通,有利于 渡过大河急流,有利于君子坚守正道。《象》曰:天与火,同人;君子以类族辨物。【译】《象辞》说:《同人卦》的卦象是离(为)下乾(天)上,为天下有火之表象。天 在高处,火势熊熊而上,天与火亲和相处,君子要明白物以类聚,人以群分的道理,明 辨事物,求同存异,团结众人以治理天下。 初九,同人于门,无咎。【译】初九,一出门便能与人和睦相处,不会有什么灾祸。 《象》曰:出门同人,又谁咎也!【译】《象辞》说:一出门便能与人和睦相处,又有谁会来危害你呢? 六二,同人于宗,吝。【译】六二,只和本宗本派的人和睦相处,必然会惹来一些麻烦。 ￼《象》曰:“同人于宗”,吝道也。【译】《象辞》说“只和本宗本派的人和睦相处”,不能团结各个阶层的人,这是引起麻 烦的根源。 九三,伏戎于莽,升其高陵,三岁不兴。【译】九三,把军队埋伏在密林草莽之中,占据附近的制高点频频瞭望,三年都不敢出 兵打仗。 《象》曰:“伏戎于莽”,敌刚也;“三岁不兴”,安行也?【译】《象辞》说:“埋伏军队在密林草莽中”,说明敌人力量强大,我方力量弱小,只 能潜伏下来。“三年都不敢兴兵打仗”,表明敌我力量相差悬殊,怎么敢冒险轻进呢? 九四,乘其墉,弗克攻,吉。【译】九四,准备登城向敌人进攻,但终于没有进攻,是吉祥的。 《象》曰:“乘其墉”,义弗克也,其“吉”,则困而反则也。【译】《象辞》说:“准备登城向敌人进攻”,但终于没有进攻,是因为发现这种进攻是 不仁义的,这样做能获得吉祥,是因为在困惑时能及时醒悟,反过来能按正确的办法行 事。 九五,同人,先号咷(tao),而后笑,大师克相遇。【译】九五,与人和睦相处,开始大声痛哭,后来破涕为笑,大军作战告捷,志同道合 者相会在一起。 《象》曰:同人之先,以中直也;大师相遇,天罔(wang)极上遇,言相克也。【译】《象辞》说:与人和睦相处,开始大声痛哭,说明这时内心中正诚信,因不知战 34 事的胜败而焦急痛哭;大军遇到了志同道合者,终于获得了战争的胜利,于是欢笑起来。 上九,同人于郊,无悔。【译】上九,在荒郊也愿与人和睦相处,未遇到志同道合者,也不后悔。 《象》曰:“同人于郊”,志未得也。【译】《象辞》说:“在荒郊也愿与人和睦相处,未遇到志同道合者”,说明此时团结众 人,而希望天下大同的愿望没有实现。"},{"title":"否卦 | 易经","date":"2017-10-12T05:13:49.000Z","path":"2017/10/12/yi-12-fou/","text":"否:否(pi)之匪人,不利,君子贞;大往小来。【译】《否卦》象征闭塞:一个卦闭的社会,人们之间的来往是不通畅的,天下没有便利之处,君子必须坚守正道;这时强大者离去,弱小者到来。《象》曰:天地不交,“否”;君子以俭德辟难,不可荣以禄。【译】《象辞》说:《否卦》的卦象为坤(地)下乾(天)上,为天在地上之表象。天在极高之处,地在极低之处,天地阴阳之间因而不能互相交合,所以时世闭塞不通,这时 候君子必须坚持勤俭节约的美德,以避开危险与灾难不能谋取高官及丰厚的俸禄,去追求荣华富贵。 ￼￼初六,拔茅茹,以其汇,贞吉,亨。【译】初六,拔起一把茅草,只见它们的根连在一起,物以类聚,找它们时要以其种类 来识别;结果是吉祥的,亨通。 《象》曰:“拔茅贞吉”,志在君也。【译】《象辞》说:“拔起茅草,其根相连,结果吉祥”,说明忠心耿耿,有为君主建功 立业的远大志向。 六二,包承,小人吉;大人否,亨。【译】六二,阿谀奉承有权势的人,小人因此获得吉祥;德高望重的大人物否定了阿谀 奉承,则是吉利的。 《象》曰:“大人否享”,不乱群也。【译】《象辞》说:“德高望重的大人物否定了阿谀奉承,则是吉利的”,因为德高望重 的大人物是不能与小人为伍的。 六三,包羞。【译】六三,由于受纵容而胡作非为,终于召致羞辱。 《象》曰:“包羞”,位不当也。【译】《象辞》说:“由于受纵容而胡作非为,终于召致羞辱”,说明此时处的位置不正。 九四,有命无咎,畴(chou)离祉。【译】九四,奉行天命,替天行道,开通闭塞,没有灾祸,大家互相依附都可以获得福 31 分。 《象》曰:“有命无咎”,志行也。【译】《象辞》说:“奉行天命,替天行道,开通闭塞没有灾祸”,说明要实现济困扶危 替天行道的志向。 九五,休否,大人吉;其亡其亡,系于苞桑。【译】九五,时世闭塞不通的局面将要停止,德高势隆的大人物可以获得吉祥;居安思 危,常常以“不久将要灭亡,不久将要灭亡”,这样的警句来提醒自己,才能像系结在 一大片丛生的桑树上那样牢固,安然无事。 《象》曰:“大人之吉”,位正当也。【译】《象辞》说:“德高势隆的大人物可以获得吉祥”,说明此时处于居中位置,合适 得当。 上九,倾否;先否后喜。【译】上九,时世闭塞不通的局面将要改变,发生了天翻地覆的变化;起初闭塞不通, 后来顺畅通达,大家欢喜高兴。 《象》曰:否终则倾,何可长也!【译】《象辞》说:闭塞到了极点必然要发生倾覆,物极必反,否极泰来,一种局面不 会长久持续不发生变化的!"},{"title":"泰卦 | 易经","date":"2017-10-12T04:45:33.000Z","path":"2017/10/12/yi-11-tai/","text":"泰:小往大来,吉,亨。【译】《泰卦》象征通达:这时弱小者离去,强大者到来,吉祥,亨通。 ￼￼《象》曰:天地交,泰;后以财成天地之道,辅相天地之宜,以左右民。【译】《象辞》说:《泰卦》的卦象为乾(天)下坤(地)上,地气上升,乾气下降,为 地气居于乾气之上之表象,阴阳二气一升一降,互相交合,顺畅通达;君主这时要掌握 时机,善于裁节调理,以成就天地交合之道,促成天地化生万物之机宜,护佑天下百姓, 使他们安居乐业。 初九,拔茅茹,以其汇,征吉。【译】初九,拔起了一把茅草,它们的根相连在一起,真是物以类聚,所以找它时要以 其种类而识别,往前行进是吉祥的。 《象》曰:拔茅征吉,志在外也。【译】《象辞》说:拔起一把茅草,往前行进可获吉祥,说明有远大的志向,有在外建 功立业的进取心。 九二,包荒,用冯河,不遐(xia)遗;朋亡,得尚于中行。【译】九二,有包容大川似的宽广胸怀,可以徒步涉过大河急流;礼贤下士,对远方的 贤德之人也不遗弃;不结成小团体,不结党营私,能够辅佐公正有道德的君主。 《象》曰:“包荒”,“得尚于中行”,以光在也。【译】《象辞》说:“有包容大川似的宽广胸怀”,“能够辅佐公正有道德的君主”,说明 自己光明正大,道德高尚。 ￼￼九三,无平不陂(po),无往不复;艰贞无咎,勿悔恤其孚,于食有福。【译】九三,没有平地不变为陡坡的,没有只出去不回来的,处在艰难困苦的环境中坚 守正道就没有灾害,不要怕不能取信于人,安心享用自己的俸禄是很有福分的。 《象》曰:“无往不复”,天地际也。【译】《象辞》说:“没有只出去而不回来的”,叶落归根,人回故乡,事物的正反两个 方面往往互相转化,表明此时正在天地交合的边沿,处于变化之中。 六四,翩翩不富,以其邻不戒以孚。【译】六四,像飞鸟连翩下降,虚怀若谷,这样与邻居相处,不互相戒备,彼此以诚相 见,讲求信用。 《象》曰:“翩翩不富”,皆失实也;“不戒以孚”,中心愿也。【译】《象辞》说:“像飞鸟从高处连翩下降,虚怀若谷”,说明此时不以个人的殷实富 贵为念;“与邻居相处,不互相戒备,彼此以诚相见,讲求信用”,因为这是大家内心共同的意愿。 六五,帝乙归妹,以祉元吉。【译】六五,商代帝王乙嫁出自己的女儿,因此得到了福分,是十分吉祥的事。 《象》曰:“以祉元吉”,中以行愿也。【译】《象辞》说:“帝乙把女儿嫁给贤德而又富裕的人家,因此获得了深厚的福分,是 29 在吉在利的事”,说明因为实现了长期以来心中祈求的意愿,所以结果是吉祥的。 上六,“城复于隍”;勿用师,自邑告命,贞吝。【译】上六,城墙倒塌在久已干涸的护城壕沟里;这时决不可进行战争,应减少繁琐的 政令,以防止可能出现的土崩瓦解的局面。 《象》曰:城复于隍,其命乱也。【译】《象辞》说:“城墙倒塌在久已干涸的护城壕沟里”,说明形势已经向错乱不利的 方面转化,其前景是不大美妙的。"},{"title":"履卦 | 易经","date":"2017-10-12T04:37:26.000Z","path":"2017/10/12/yi-10-lv/","text":"履:履虎尾,不咥(die)人,亨。【译】《履卦》象征小心行动:跟在老虎尾巴后面走路,老虎却没有回头咬人,当然 亨通顺利。 《象》曰:上天下泽,“履”;君子以辩上下,定民志。【译】《象辞》说:《履卦》的卦象是兑(泽)下乾(天)上,为天下有泽之表象。上 有天,下有泽,说明要处处小心行动,如行在沼泽之上,一不注意就会陷下去;君子要 深明大义,分清上下尊卑名分,坚定百姓的意志,遵循礼仪而行,必然秩序井然。 初九,素履,往无咎。【译】初九,心地纯朴,品行端正,处处小心行事,那么无论到什么地方都没有灾祸。 《象》曰:“素履之往”,独行愿也。【译】《象辞》说:“心地纯朴,品行端正,处处小心行事”,表明要专心致志,遵循 礼仪实现自己的意愿。 九二,履道坦坦,幽人贞吉。【译】九二,小心行走在平坦宽广的大道上,幽居的人安于闲逸恬静的生活,结果是 吉祥的。 《象》曰:“幽人贞吉”,中不自乱也。【译】《象辞》说:“幽居的人可获吉祥”,说明自己内心平静自然毫不紊乱,循礼仪 而行的信念坚固。 六三,眇能视,跛能履。履虎尾咥人,凶;武人为于大君。【译】六三,眼睛快要瞎了,但勉强能看到一点点;腿跛了,但勉强能走几步。不小 心踩在老虎尾巴上,老虎回头就咬人,凶险;勇敢的武士要竭力为君主效劳。 《象》曰:“眇能视”,不足以有明也;“跛能履”,不足以与行也;“咥人之凶”,位不当也;“武人为于大君”,志刚也。【译】《象辞》说:“眼睛快瞎了,但勉强能看到一点点”,不足以分辩事物;“腿跛了, 但勉强能走几步”,不能出外远行;“老虎咬人是凶险的”,表明这时处的位置很不妥当, 竟然踩在老虎尾巴上。“武士要竭力为君主效劳”,表明武士的志向刚强。 九四,履虎尾,愬愬,终吉。【译】九四,跟在老虎尾巴后面走路,感到恐惧害怕,但谨慎小心,终于得到吉祥。 ￼￼《象》曰:“愬愬终吉”,志行也。【译】《象辞》说:“感到恐惧害怕,但谨慎小心,终久获得吉祥”,说明小心遵循礼 仪而行就能实现自己的志愿。 九五,夬履,贞厉。【译】九五,刚毅善于作出决断,小心行动,要提防危险。 《象》曰:“夬履贞厉”,位正当也。【译】《象辞》说:“刚毅果断,小心行动,要提防危险”,说明此时虽处于正当的位 置,但也不能疏忽大意。 上九,视履考祥,其旋元吉。【译】上九,回头看看走过的路,详细察看一下吉凶祸福,转身来顺应阴柔自然之道, 这样是吉祥的。 《象》曰:元吉在上,大有庆也。【译】《象辞》说:极为吉祥,高居尊上之位,表明有大的福分值得庆祝。"},{"title":"小畜卦 | 易经","date":"2017-10-12T04:32:34.000Z","path":"2017/10/12/yi-9-xiaoxu/","text":"小畜:亨;密云不雨,自我西郊。【译】《小畜卦》象征小有积蓄:亨通顺利;天空布满浓密的积云,但还没有下雨, 云气是从城西郊区升起来的。 《象》曰:风行天上,“小畜”;君子以懿(yi)文德。【译】《象辞》说:《小畜卦》的卦象是乾(天)下巽(风)上,是风飘行天上的表象。 风在天上吹,密云不雨,气候不好不坏,收成一般,所以只能“小有积蓄”;君子面对 这种情况,于是修养美好的品德,用心做好文章等待发达的时机。 初九,复自道,何其咎?吉。【译】初九,自己从原路返回,哪里会有什么灾害呢?吉祥。 《象》曰:“复自道”,其义吉也。【译】《象辞》说:“自己从原路返回”,表明这行动很适宜,符合常理,因而吉祥。 九二,牵复,吉。【译】九二,带着别人一道从原路返回,吉祥。 《象》曰:牵复在中,亦不自失也。【译】《象辞》说:带着别人从原路返回,表明此时处于居中位置,自己不会失掉阳 刚的德行。 九三,舆(yu)说辐(fu),夫妻反目。【译】九三,行在半路上,忽然大车的辐条从车轮中脱出来,车不能再行了,回到家 里,夫妻因此大吵大闹着要离婚。 ￼￼《象》曰:夫妻反目,不能正室也。【译】《象辞》说:结发夫妻吵闹着要离婚,说明丈夫不能以家规要求妻子,自己也 没有给妻子做出表率,所以妻子不守妇道。 六四,有孚;血去惕出,无咎。【译】六四,具有诚实守信的德行,互相信任;抛弃忧患意识与戒备心理,这样就没 有灾祸。 《象》曰:“有孚惕出”,上合志也。【译】《象辞》说:“具有诚信之德并抛弃戒备心理”表明这样符合居于尊上地位的权 势者的意愿。 九五,有孚挛(luan)如,富以其邻。【译】九五,具有诚信的德行,与别人紧密联系并互相帮助,自己致富也要使邻人跟 着一同富起来。 《象》曰:“有孚挛如”,不独富也。【译】《象辞》说:“具有诚信的德行与别人紧密联系并互相帮助”,表明要与人共同 富裕,不独自享受富贵。 上九,既雨既处,尚德载;妇贞厉,月几望;君子征凶。【译】上九,下起了细雨,但不久又停下来,阳刚者的德行被阴气所弥漫掩盖;这时 妇人要坚守正道,因为十五月圆十六就开始亏了,要小心防备危险。君子要出外远行,必有凶险。 《象》曰:“既雨既处”,德积载也;“君子征凶”,有所疑也。【译】《象辞》说:“下起了细雨,但不久又停下来”,表明这时阴气弥漫掩盖了阳刚之德;“君子外出远行必遭凶险”,说明阴湿之气聚集,到处一片茫茫,方向不清,情况 不明,自然会发生危险。"},{"title":"扩展package | PXT","date":"2017-10-11T13:09:03.000Z","path":"2017/10/11/pxt-package-extends/","text":"ExtensionsA package may have an associated editor extension hosted in the Github Pages section of the repo. pxt-neoanim is an example of specialized NeoPixel animation editor. ConfigurationThe extension is configured in the pxt.json file by adding an extension field: { ... extension: {} } The editor will automatically add an “Editor” button for the extension in the package category. ProtocolThe editor and the extension IFrame communicate via a protocol of IFrame messages. messages have a unique id used to correlate response to requests. a response message can be requested. The id identifer can be used to correlate a receive response to the original query. all message sent by the extension must contain the extension id, extId. This identifier is passed when loading the IFrame (see Initialization) // sending message var msg = { id: Math.random().toString(), type: \"pxtpkgext\", action: \"extinit\", extId: extId, response: true } window.parent.postMessage(msg, \"*\"); // handle the response function receivedResponse(resp) { if (resp.action === \"extinit\") console.log('initialized!') } window.addEventListener(\"message\", function(ev) { var resp = ev.data; if (resp && resp.type === \"pxtpkgext\") receivedResponse(resp); }, false); InitializationWhen the user presses the extension button, The GitHub pages site is loaded in an IFrame with an extension id in the hashmark, e.g. https://microsoft.github.io/pxt-neoanim/#extid for the package https://github.com/Microsoft/pxt-neoanim. ~ hintStore the extension id as it needs to be used in every message. var extId = window.location.hash.substr(1); ~ Once fully loaded, the extension sends a extinit message to the parent window var msg = { id: Math.random().toString(), type: \"pxtpkgext\", action: \"extinit\", extId: extId } ... Read and write codeThe extension can read (extreadcode) and write (extwritecode) a dedicated TypeScript and JSON file in the project. The JSON file is designed to store rich metadata while the TypeScript is the “code behind” that gets executed. This feature does not require permissions. write code var msg = { id: Math.random().toString(), type: \"pxtpkgext\", action: \"extwritecode\", extId: extId, body: { code: \"// generated TypeScript code\", json: \"serialized JSON here\" } } ... read code var id = Math.random().toString(); var msg = { id: id, type: \"pxtpkgext\", action: \"extreadcode\", extId: extId, response: true } ... function receivedResponse(resp) { if (resp.action === \"extreadcode\" && resp.id === id && resp.body) { var ts = resp.body.code; var json = JSON.parse(resp.body.json); ... } } ... Read and write user codeThe extusercode message requests to read the entire set of files in the project. The user will be prompted to give permission. If successfull, the response contains a resp field with a map of the file names to file contents. export interface UserCodeResponse extends ExtensionResponse { /* A mapping of file names to their contents */ resp?: { [index: string]: string }; } Data streamsWhen available, the editor may stream data coming from the devices. The extdatastream message requests to stream data. The user will be prompted to give permission. The following message requests for serial messages: var msg { ... action: \"extdatastream\", body: { serial: true } } ... If successful, the editor will proxy serial messages to the editor IFrame."},{"title":"配置package | PXT","date":"2017-10-11T13:07:05.000Z","path":"2017/10/11/pxt-package-pxtjson/","text":"pxt.json Manual PageA PXT package lives in its own directory, locally under libs/ in a PXT target. A packageis described by the pxt.json file. Here is the pxt.json file for the pxt-neopixel package: https://github.com/Microsoft/pxt-neopixel The pxt.json is described by the interface PackageConfig: interface PackageConfig { name: string; // public:true -> name must match ^[a-z][a-z0-9\\-_]+ description?: string; // longer description of package license?: string; // name of license (as found on github) authors?: string[]; files: string[]; // files to be included and compiled in package additionalFilePath?: string; // another directory to find files from dependencies: Map; // package dependencies (see below for more) public?: boolean; // set true to enable the package to be published (to cloud), // in support of publishing user scripts icon?: string; // url to icon -- support for built-in packages only card?: CodeCard; documentation?: string; // doc page to open when loading project // semver description for support target version version?: string; installedVersion?: string; targetVersions?: TargetVersions; // versions of the target/pxt the package was compiled against testFiles?: string[]; simFiles?: string[]; binaryonly?: boolean; platformio?: PlatformIOConfig; yotta?: YottaConfig; gistId?: string; } dependencies (on other packages)Simple packages generally just depend on their target’s core package: \"dependencies\": { \"core\": \"file:../core\" } A number of targets use http://github.com/microsoft/pxt-common-packages and specializethem to fit their target’s needs. For example, the Adafruit Circuit Playground Expresspackage is the union of a number of packages. \"dependencies\": { \"core\": \"file:../core\", \"buttons\": \"file:../buttons\", \"accelerometer\": \"file:../accelerometer\", \"lightsensor\": \"file:../lightsensor\", \"thermometer\": \"file:../thermometer\", \"music\": \"file:../music\", \"light\": \"file:../light\", \"switch\": \"file:../switch\", \"infrared\": \"file:../infrared\", \"microphone\": \"file:../microphone\", \"touch\": \"file:../touch\" } Each of the above packages is local to the target but inherits code from microsoft/pxt-common-packages,which it can then override or specialize, as the target needs. For example, the button packagein the target microsoft/pxt-adafruit is defined in terms of the button package frommicrosoft/pxt-common-packages using the additionalFilePath field: { \"name\": \"buttons\", \"description\": \"Button A and B drivers\", \"files\": [ \"README.md\", \"buttons.cpp\", \"shims.d.ts\", \"enums.d.ts\" ], \"testFiles\": [ \"test.ts\" ], \"additionalFilePath\": \"../../node_modules/pxt-common-packages/libs/buttons\", \"public\": true, \"dependencies\": { \"core\": \"file:../core\" } } The additionalFilePath field refers to the node_modules directory of the target."},{"title":"package起步 | PXT","date":"2017-10-11T13:05:09.000Z","path":"2017/10/11/pxt-package-start/","text":"Building your own packageStep 0: Local server setupIn order to build and test your package locally, you need to setup PXT to run locally.Follow the instructions on setting up workspace. Step 1: GitHub setupYou will need to get a GitHub account and create a GitHub repository. At this time, other repository hosting solutions (GitLab, Bitbucket, etc.) are not supported. Let’s say you want to create a package called banana for target TARGET. create (do not clone) a fresh GitHub repository pxt-banana clone this repository into pxt-banana under the projects folder go to the cloned folder and run pxt init; follow the prompts edit pxt.json and README.md with the right descriptions commit files to git: git add ., and commit them: git commit -m &quot;Initial&quot; Make sure you keep the line for PXT/TARGET (where TARGET is the target id) in README.md. Otherwise the package will not show up in search. Step 2: Developing packageNow, you’re ready to develop your package. You can do it with VSCodeor from the web editor served from pxt serve. put the contents of your package in main.ts add a sample program using the package in test.ts use pxt to build and deploy the package with tests; use the web editor to test in the simulator You will develop your package in pxt-banana, and then test this work by creating a second project (called, perhaps, “Just Look At It”) which includes a reference to pxt-banana. ~ hintIf the local editor fails to open, copy the URL printed in the console and open it in your favorite browser. The local server requires a security token embedded in the URL to serve pages. ~Step 3: TestingIn order to test your package, you need to create a new project, and manually add a reference back to the package you’ve been developing. Open the local editor and create a new project. For example, you might call it Just Look At It. Open the project settings by clicking the gear (Gear -&gt; Project Settings) Click on Edit Settings As Text Add an entry under dependencies that points to your package folder: { &quot;name&quot;: &quot;banana test&quot;, &quot;dependencies&quot;: { ... &quot;banana&quot;: &quot;file:../pxt-banana&quot; }, ... } Reload the editor and the new blocks you developed in pxt-banana will be loaded into the project “Just Look At It.” Step 4: Publishing your packageWhen you’re happy with the first version of your package, commit the changes andbump the version and push to github: git commit -a -m &quot;Amazing flying bananas&quot; pxt bump The pxt bump will make sure there are no uncommited changes, bump the version number,create a git tag, and push everything to github. In the editor, paste the full URL to your repo after selecting More -&gt; Add package.... Your package should show up. Step 5: ApprovalIn order to be searchable by users, packages need to be approved. GitHub organizations or individual repos can be approved. See approval for more details. ~ hintMake sure you keep the line for PXT/TARGET (where TARGET is the target platform id)in README.md. Otherwise the package will not show up in search. ~Read more an defining-blocks to learn how to surface your APIs into blocks and JavaScript. IconThe editor will automatically use any icon.png file when displaying the package in the editor. This feature only works for approved packages. The icon should be sized with a 16:9 ratio and of at least 184 pixel wide."},{"title":"主题 | PXT","date":"2017-10-11T13:02:18.000Z","path":"2017/10/11/pxt-theme/","text":"ThemingPXT uses the Semantic UI framework to create the user interface. BlocklyTo Blockly themeing, you can overwrite the default Blockly options by configuring blocklyOptions under your target’s appTheme. See Blockly Configuration for a full list of Blockly configurable options. Semantic ThemingPXT comes with a default Semantic UI theme. You can however completely override the theme and use all the flexibility of Semantic UI to customize your target. copy the _theme folder from the project to the root of your target, and rename it to site customize the variables! You will most likely be updating the site variables under site/globals/site.variables From more information on themeing, visit http://semantic-ui.com/usage/theming.html pxt serve or pxt buildtarget will automatically rebuild semantic.css and override the built-in CSS from the app. FaviconUse realfavicongenerator to generate all the relevant favicon icon files and save them under static/icons in the docs folder. AppThemepxtarget.json contains an extensive customization section (appTheme) to control logos, names, colors, etc. Details are below (TBD): interface AppTheme { // naming id?: string; name?: string; title?: string; description?: string; boardName?: string; // associated social/store information appStoreID?: string; // Apple iTune Store ID if any twitter?: string; // localization defaultLocale?: string; locales?: Map&lt;AppTheme>; crowdinProject?: string; crowdinBranch?: string; // optional branch specification for pxt selectLanguage?: boolean; // add language picker to settings menu disableLiveTranslations?: boolean; // don't load translations from crowdin // logos logoUrl?: string; logo?: string; portraitLogo?: string; rightLogo?: string; docsLogo?: string; cardLogo?: string; appLogo?: string; // branding organization?: string; organizationUrl?: string; organizationLogo?: string; organizationWideLogo?: string; // associated URLs homeUrl?: string; shareUrl?: string; embedUrl?: string; betaUrl?: string; // beta tag and URL privacyUrl?: string; termsOfUseUrl?: string; contactUrl?: string; feedbackUrl?: string; // is set: a feedback link will show in the settings menu githubUrl?: string; legacyDomain?: string; // menu authoring and theming docMenu?: DocMenuEntry[]; // help menu TOC?: TOCMenuEntry[]; // see SUMMARY.md also galleries?: pxt.Map&lt;string>; // list of galleries to display in projects dialog hideMenuBar?: boolean; // Hides the main menu bar hideEditorToolbar?: boolean; // Hides the bottom editor toolbar // getting started and documentation sideDoc?: string; // if set: show the getting started button, clicking on getting started button links to that page hideSideDocs?: boolean; hideDocsSimulator?: boolean; // do not show simulator button in docs hideDocsEdit?: boolean; // do not show edit button in docs usbDocs?: string; htmlDocIncludes?: Map&lt;string>; htmlTemplates?: Map&lt;string>; // editor theming accentColor?: string; blocksOnly?: boolean; // blocks only workspace invertedMenu?: boolean; // if true: apply the inverted class to the menu // blockly theming blockColors?: Map&lt;string>; // block namespace colors, used for build in categories coloredToolbox?: boolean; // if true: color the blockly toolbox categories invertedToolbox?: boolean; // if true: use the blockly inverted toolbox blocklyOptions?: Blockly.Options; // Blockly options, see Configuration: https://developers.google.com/blockly/guides/get-started/web blockHats?: boolean; // if true, event blocks have hats // monaco theming invertedMonaco?: boolean; // if true: use the vs-dark monaco theme monacoToolbox?: boolean; // if true: show the monaco toolbox when in the monaco editor hasReferenceDocs?: boolean; // if true: the monaco editor will add an option in the context menu to load the reference docs // simulator theming simAnimationEnter?: string; // Simulator enter animation simAnimationExit?: string; // Simulator exit animation hasAudio?: boolean; // target uses the Audio manager. if true: a mute button is added to the simulator toolbar. highContrast?: boolean; // simulator has a high contrast mode // running in an iframe allowParentController?: boolean; // allow parent iframe to control editor extendEditor?: boolean; // whether a target specific editor.js is loaded // options around downloading a compiled file useUploadMessage?: boolean; // change \"Download\" text to \"Upload\" downloadIcon?: string; // which icon io use for download driveDisplayName?: string; // name of the drive as it shows in the explorer // miscellaneous hideEmbedEdit?: boolean; // hide the edit button in the embedded view hideCookieNotice?: boolean; // always hide cookie notice for targets that embed the editor in apps/chrome mobileSafariDownloadProtocol?: string; // custom protocol to be used on iOS sounds?: { tutorialStep?: string; tutorialNext?: string; dialogClick?: string; }, }"},{"title":"舵机串口 | PXT","date":"2017-10-11T12:58:04.000Z","path":"2017/10/11/pxt-serial/","text":"pxt-hidserial Manual Page@description Monitors serial output from certain boardsMonitors serial output from certain boards (in particular SAMD21 ones) pxt hidserial DescriptionWhen using Codal runtime, PXT sends data from serial.writeLine() and friendsover a custom USB HID protocol called HF2.The protocol supports a number of other features, including flashing and some debugging.HF2 works on all major operating systems (including Windows 7) without the needfor any drivers. pxt hidserial just dumps serial data to standard output. When using pxt serve and developingat http://localhost:3232, the HID serial is forwarded to the browser, so there is noneed to use pxt hidserial. Other useful HID command include pxt hidlist to list connected HID devicesand pxt hiddmesg to dump Codal debug buffer. PXT can also deploy over HID - thisis the default when using command line or pxt serve. See Alsopxt tool"},{"title":"静态HTML | PXT","date":"2017-10-11T12:53:27.000Z","path":"2017/10/11/pxt-static-pkg/","text":"pxt-staticpkg Manual Page@description Compiles PXT editor into static HTML filesPackages the target into static HTML pages pxt staticpkg [--route route] [--githubpages] [--output output] DescriptionCompiles the PXT editor into static HTML files that can be served without a server or integrated into an app. The resulting files are placed in built/packaged. Flags:route (optional)Routing path. If missing, defaults to local. The route will be injected into the all the paths in the application. githubpages (optional)Generate a web site compatiable with GitHub pages. output (optional)Directory for generated files. bump (option)Bump version number generating pages ~ hintThis directory is cleaned before starting the process. ~Deploying PXT with static filesRunning pxt staticpkg will create a number of files under built/packaged.You can use pxt serve -pkg or any other any web server. For example, you can use http-server for easy testing. npm install -g http-server http-server -c-1 built/packaged You can also run pxt staticpkg --route foo, which will create files under built/packaged/foothat assume they sit under /foo/ on the web server. If you do not specify anything,the files assume they sit right under /. To test it, run pxt serve -pkg and head tohttp://localhost:3232/foo/index.html. GitHub Pages supportGitHub provides you with free hosting for your project files. If you wish to publish your web site to GitHub pages, simply add --githubpages to the command. This will: create a fresh checkout in built/gh-pages if needed implicityly run pxt staticpkg --route repo-name copy files from built/packaged/repo-name to built/gh-pages add files to git, commit, and push You can then head to https://your-username.github.io/repo-name/."},{"title":"SHIM | PXT","date":"2017-10-11T12:51:29.000Z","path":"2017/10/11/pxt-shim/","text":"Auto-generation of library filesThe APIs visible to PXT user (as TypeScript functions/classes or blocks)expose behaviors defined in the C++ library files (in case of hardware targets)and also the JavaScript simulator (runtime environment).These are defined in TypeScript files (usually .d.ts) under /libs folderin the target definition. Let’s call these shim files. The definitions in shim files include JSDoc comments andannotations starting with //%. In particular, //% shim=foo::bar meansthat the current function should be mapped to the C++ function foo::barand also to the simulator function pxsim.foo.bar. PXT can generate shim files from either C++in case of hardware targets, or from the simulator sources.In both cases, PXT will copy over all JSDoc style comments and //% annotations,add shim=... annotation, and also map the type appropriately (for example, C++ int typeis mapped to number, and TypeScript RefAction to ()=&gt;void).We refer to the information copied as API meta-data. Auto-generation from C++In case of hardware targets, the API meta-data should be defined in C++, and not the simulator.This is mostly because debugging mismatches on the C++ side is much harder than on the JSside. The shims are generated per-package under /libs when building the target.The shims files are called shims.d.ts and enums.d.ts. Enums are generatedseparately, so that they can be &lt;referenced ...&gt; from simulator sources. Both files should be listed in &quot;files&quot; section of pxt.json, and we also recommendthey are checked into git. PXT implements a simple parser for a fragment of C++. This parser will not handleeverything you throw at it. In particular, it is line based and doesn’t takemulti-line comments (other than doc comments) very well. To comment out a piece of C++code use #if 0 .... #endif. The type mapping from C++ to TypeScript is quite limited.Checkout the microbit target for an example. Auto-generation from the simulatorThis should be used in case of software-only targets. The shim file is called sims.d.ts and is generated from /sim/*.ts while buildingthe target. The file will be generated in the &quot;corepkg&quot; of the target. In future, we mayallow splitting between packages. Similarly, to the C++ generation, sims.d.ts shouldbe included in pxt.json and checked in. Checkout the sample target for an example. functionAsync handlingA function (or method) named fooAsync will be exposed as foo. It is expectedto return a promise. This will generate //% promise annotation, which will letthe compiler know about this calling convention. Legacy async handlingThe simulator function can also get hold of a callback function using getResume()and then call the resulting function when the function is supposed to resume.You need to include the //% async annotation in that case. Simulator implementationsIf you’re adding your own C++ or assembly functions in packagesand you either cannot or don’t want to add a corresponding function to the simulator,you can provide a simulator-only implementation. For example: /** * Writes to the Bluetooth UART service buffer. */ //% blockId=bluetooth_uart_write block=\"bluetooth uart write %data\" blockGap=8 //% shim=bluetooth::uartWrite export function uartWrite(data: string): void { // dummy implementation for simulator console.log(\"UART Write: \" + data) } Notice the shim= annotation. In C++ you would have just this: namespace bluetooth { //% void uartWrite(StringData *data) { // ... } } When PXT sees a call to function annotated with shim=, it will always use theshim in the native compilation. In simulator compilation it will use the shim onlyif the function has no body or empty body. If you don’t want your simulator implementationto do anything, you can for example put a single return statement as the body. Indexed InstancesA typical pattern to expose pins on a device is something like follows: class DeviceIO { public: DevicePin pins[0]; //% indexedInstanceNS=pins indexedInstanceShim=pins::getPin //% DevicePin A0; //% DevicePin A1; ... }; namespace pins { DeviceIO io; //% DevicePin *getPin(int id) { // ... add range checking ... return &amp;io.pins[id]; } } namespace DevicePinMethods { //% blockId=device_get_digital_pin block=\"digital read|pin %name\" blockGap=8 //% blockNamespace=pins int digitalRead(DevicePin *name) { return name->getDigitalValue() } ... } This will result in the following declarations being generated: declare namespace pins { //% fixedInstance shim=pins::getPin(0) const A0: DevicePin; //% fixedInstance shim=pins::getPin(1) const A1: DevicePin; ... } declare interface DevicePin { //% blockId=device_get_digital_pin block=\"digital read|pin %name\" blockGap=8 //% blockNamespace=pins shim=DevicePinMethods::digitalRead digitalRead(): number; ... } The indexedInstanceShim generates the shim=...(no) annotations.They instruct the access to the variable (which is read-only) to becompiled as call the the specified function with the specific literalargument. The fixedInstance annotation is automatically generatedfor blocks. The namespace FooMethods is turned into an interface Foo. Theseare usually used to wrap native C++ classes that require no referencecounting. Thus, you also need to manually add the following TypeScript: interface DevicePin { // no methods needed, they come from C++ } If you don’t, the runtime will call method that do not exists andchaos will prevail (even though you might not see it at the beginning). You can also specify inheritance in such a declaration: interface AnalogPin extends DigitalPin {}"},{"title":"定义blocks | PXT","date":"2017-10-11T11:32:49.000Z","path":"2017/10/11/pxt-define-blocks/","text":"Defining blocksThis section describes how to annotate your PXT APIs to expose them in the Block Editor. All the //% annotations are found in TypeScript library files.They can optionally be auto-generated from C++ library files or from TypeScriptsimulator files. CategoryEach top-level javascript namespace is used to populate a category in the Block Editor toolbox. The name will automatically be capitalized in the toolbox. namespace basic { ... } You can also provide a JsDoc comment, color and weight for the namespace, as well as a friendly name (in Unicode).We strongly recommend carefully picking colors as it dramatically impactsthat appearance and readability of your blocks. All blocks within the same namespace have the same color so that users can find the category easily fromsamples. /** * Provides access to basic micro:bit functionality. */ //% color=190 weight=100 icon=\"\\uf1ec\" block=\"Basic Blocks\" namespace basic { icon icon Unicode character from the icon font to display. The Semantic UI icon set has been ported from Font Awesome (v4.5.6 at the time of writing), and a full list can be found at http://fontawesome.io/icons/ color should be included in a comment line starting with \\\\%. The color takes a hue value or a HTML color. To have a category appear under the “Advanced” section of the Block Editor toolbox, add the annotation advanced=true. BlocksAll exported functions with a block attribute will be available in the Block Editor. //% block export function showNumber(v: number, interval: number = 150): void { } If you need more control over the appearance of the block,you can specify the blockId and block parameters. //% blockId=device_show_number //% block=\"show|number %v\" export function showNumber(v: number, interval: number = 150): void { } blockId is a constant, unique id for the block. This id is serialized in block code so changing it will break your users. block contains the syntax to build the block structure (more below). Other optional attributes can also be used: blockExternalInputs= forces External Inputs rendering advanced=true causes this block to be placed under the parent category’s “More…” subcategory. Useful for hiding advanced or rarely-used blocks by default Block syntaxThe block attribute specifies how the parameters of the functionwill be organized to create the block. block = field, { &#39;|&#39; field } field := string | string `%` parameter [ `=` type ] parameter = string type = string each field is mapped to a field in the block editor the function parameter are mapped in order to %parameter argument. The loader automatically buildsa mapping between the block field names and the function names. the block will automatically switch to external inputs when enough parameters are detected A block type =type can be specified optionally for each parameter. It will be used to populate the shadow type. Supported typesThe following types are supported in function signatures that are meant to be exported: number (TypeScript) or int (C++) string (TypeScript) or StringData* (C++) enums (see below) custom classes that are also exported arrays of the above Callbacks with ParametersAPIs that take in a callback function will have that callback converted into a statement input.If the callback in the API is designed to take in parameters, the best way to map that patternto the blocks is by passing the callback a single parameter with a class type that containsall the other values. For example: export class ArgumentClass { argumentA: number; argumentB: string; } //% mutate=objectdestructuring //% mutateText=\"My Arguments\" //% mutateDefaults=\"argumentA;argumentA,argumentB\" // ... export function addSomeEventHandler((a: ArgumentClass) => void) { }; In the above example, setting mutate=objectdestructuring will cause this API to use Blockly “mutators”to let users change what parameters appear in the blocks. Each parameter will be given anoptional variable field in the block that defines a variable that can be used within the callback.The variable fields compile to object destructuring in the TypeScript code. For example: addSomeEventHandler(({argumentA, argumentB}) => { }) For an example of this pattern in action, see the radio.onDataPacketReceived block inthe microbit target. In some cases it can be useful to change the runtime behavior of the API based on the properties selected by theuser. To enable that behavior, create an enum with entries that have the same names as the argument object’sproperties and add an extra parameter taking in an enum array to the API. For example: export class ArgumentClass { argumentA: number; argumentB: string; } enum ArgNames { argumentA, argumentB } //% mutate=objectdestructuring //% mutateText=\"My Arguments\" //% mutateDefaults=\"argumentA;argumentA,argumentB\" //% mutatePropertyEnum=\"argNames\" // ... export function addSomeEventHandler(args: ArgNames[], (a: ArgumentClass) => void) { }; Note the mutatePropertyEnum attribute added to the comment annotations. The block for this API willlook the same as the previous example but the compiled code will also include the arguments passed: addSomeEventHandler([ArgNames.argumentA, ArgNames.argumentB], ({argumentA, argumentB}) => { }) The other attributes related to object destructuring mutators include: mutateText - defines the text that appears in the top block of the Blockly mutator dialog (the dialog that appears when you click the blue gear) mutateDefaults - defines the versions of this block that should appear in the toolbox. Block definitions are separated by semicolons and property names should be separated by commas EnumsEnum are supported and will automatically be represented by a dropdown in blocks. enum Button { A = 1, B = 2, //% blockId=\"ApB\" block=\"A+B\" AB = 3, } the initializer can be used to map the value the blockId attribute can be used to override the block id the block attribute can be used to override the rendered string Tip: dropdown for non-enum parametersIt’s possible to provide a drop-down for a parameter that is not an enum. It involves the following step: create an enum with desired drop down entryenum Delimiters { //% block=\"new line\" NewLine = 1, //% block=\",\" Comma = 2 } a function that takes the enum as parameter and returns the according value//% blockId=\"delimiter_conv\" block=\"%del\" export function delimiters(del : Delimiters) : string { switch(del) { case Delimiters.NewLine: return \"\\n\"; case Delimiters.Comma: return \",\"; ... } } use the enum conversion function block id (delimiter_conv) as the value in the block parameter of your function//% blockId=\"read_until\" block=\"read until %del=delimiter_conv\" export function readUntil(del: string) : string { ... } Docs and default valuesThe JSDoc comment is automatically used as the help for the block. /** * Scroll a number on the screen. If the number fits on the screen (i.e. is a single digit), do not scroll. * @param interval speed of scroll; eg: 150, 100, 200, -100 */ //% help=functions/show-number export function showNumber(value: number, interval: number = 150): void { } If @param annotation is available with an eg: section, the firstvalue is used as the shadow value. An optional help attribute can be used to point to an specific documentation path. If the parameter has a default value (interval in this case), it is not exposed in blocks. If you want to include minimum and maximum value range for a numeric parameter, you can use square brackets with the range [min-max] after the parameter name in the @param annotation. It is important to include the shadow value if you are using range @param power [0-7] a value in the range 0..7, where 0 is the lowest power and 7 is the highest. eg: 7 Objects and Instance methodsIt is possible to expose instance methods and object factories, either directlyor with a bit of flattening (which is recommended, as flat, C-style APIs map best to blocks). Direct//% class Message { ... //% blockId=\"message_get_text\" block=\"%this|text\" public getText() { ... } } when annotating an instance method, you need to specify the %this parameter in the block syntax definition. You will need to expose a factory method to create your objects as needed. For the example above, we add a function that creates the message: //% blockId=\"create_message\" block=\"create message|with %text\" export function createMessage(text: string) : Message { return new Message(text); } Auto-createIf object has a reasonable default constructor, and it is harmless to call thisconstructor even if the variable needs to be overwritten later, then it’s usefulto designate a parameter-less function as auto-create, like this: namespace images { export function emptyImage(width = 5, height = 5): Image { ... } } //% autoCreate=images.emptyImage class Image { ... } Now, when user adds a block referring to a method of Image, a globalvariable will be automatically introduced and initialized with images.emptyImage(). In cases when the default constructor has side effects (eg., configuring a pin),or if the default value is most often overridden,the autoCreate syntax should not be used. Fixed Instance SetIt is sometimes the case that there is only a fixed number of instancesof a given class. One example is object representing pins on an electronic board.It is possible to expose these instances in a manner similar to an enum: //% fixedInstances class DigitalPin { ... //% blockId=device_set_digital_pin block=\"digital write|pin %name|to %value\" //% blockNamespace=pins digitalWrite(value: number): void { ... } } namespace pins { //% fixedInstance let D0: DigitalPin; //% fixedInstance let D1: DigitalPin; } This will result in a block digital write pin [D0] to [0], where thefirst hold is a dropdown with D0 and D1, and the second hole is a regularinteger value. The variables D0 and D1 can have additional annotations(eg., block=&quot;D#0&quot;). Currently, only variables are supported with fixedInstance(let or const). Fixed instances also support inheritance. For example, consider adding the followingdeclarations. //% fixedInstances class AnalogPin extends DigitalPin { ... //% blockId=device_set_analog_pin block=\"analog write|pin %name|to %value\" //% blockNamespace=pins analogWrite(value: number): void { ... } } namespace pins { //% fixedInstance let A0: AnalogPin; } The analog write will have a single-option dropdown with A0, butthe optionals on digital write will be now D0, D1 and A0. Variables with fixedInstance annotations can be added anywhere, at the top-level,even in different libraries or namespaces. This feature is often used with indexedInstance* attributes. It is also possible to define the instances to be used in blocks in TypeScript,for example: namespace pins { //% fixedInstance whenUsed export const A7 = new AnalogPin(7); } The whenUsed annotation causes the variable to be only included in compilationwhen it is used, even though it is initialized with something that can possiblyhave side effects. This happens automatically when there is no initializer,or the initializer is a simple constant, but for function calls and constructorsyou have to include whenUsed. OrderingAll blocks have a default weight of 50 that is used to sort them in the UI with the highest weight showing up first. To tweak the ordering,simply annotate the function with the weight macro: //% weight=10 ... If given API is only for Blocks usage, and doesn’t make much sense in TypeScript(for example, because there are alternative TypeScript APIs), you can use //% hiddenflag to disable showing it in auto-completion. GroupingUse the blockGap macro to specify the distance to the next block in the toolbox. Combined with the weight parameter,this macro allows to definte groups of blocks. The default blockGap value is 8. //% blockGap=14 ... Testing your BlocksWe recommend to build your block APIs iteratively and try it out in the editor to get the “feel of it”.To do so, the ideal setup is: run your target locally using pxt serve keep a code editor with the TypeScript opened where you can edit the APIs refresh the browser and try out the changes on a dummy program. Interestingly, you can design your entire API without implementing it! Deprecating BlocksTo deprecate an existing API, you can add the deprecated attribute like so: //% deprecated=true This will cause the API to still be usable in TypeScript, but prevent the block from appearing in theBlockly toolbox. If a user tries to load a project that uses the old API, the project will still loadcorrectly as long as the TypeScript API is present. Any deprecated blocks in the project will appear inthe editor but not the toolbox. API design Tips and TricksA few tips gathered while designing various APIs for the Block Editor. Design for beginners: the block interface is for beginners. You’ll want to create a specific layer of C-like function for that purpose. Anything that snaps together will be tried by the user: your runtime should deal with invalid input with graceful degradation rather than abrupt crashes.Some users will try to snap anything together - get ready for it. OO is cumbersome in blocks: we recommend using a C-like APIs – just function – rather than OO classes. It maps better to blocks. Keep the number of blocks small: there’s only so much space in the toolbox. Be specific about each API you want to see in Blocks."},{"title":"配置pxtarget.json | PXT","date":"2017-10-11T11:31:04.000Z","path":"2017/10/11/pxt-pxtarget-json/","text":"pxtarget.json Manual PageA PXT target is described by a pxtarget.json JSON file.Here are two examples of pxtarget.json files, one simple and one more complex: https://github.com/Microsoft/pxt-sample/blob/master/pxtarget.json https://github.com/Microsoft/pxt-microbit/blob/master/pxtarget.json The JSON file pxtarget.json is described at the top-level by the interfaces TargetBundleand AppTarget, shown below.Fields labelled as “DERIVED” in the comments are populated by PXT from other sources,as indicated. All other fields below are user-supplied. Optional fields have a “?” after their name. All PXT targets also must supply an NPM package.jsonfile, which describes the versioning, dependency and resources required to build the target.You can find examples for pxt-sample and pxt-microbit here: https://github.com/Microsoft/pxt-sample/blob/master/package.json https://github.com/Microsoft/pxt-microbit/blob/master/package.json Here’s more about creating a target TargetBundleThe interface TargetBundle describes the PXT packages that come bundledwith the target (as opposed to being pulled from the web), as well as the semanticversion of the target: interface TargetBundle extends AppTarget { versions: TargetVersions; // DERIVED: defines the semantic versioning for the target bundleddirs: string[]; // packages to be bundled into web app (libs/*) } versions: TargetVersionsPXT uses semantic versioning of its targets and packages. The TargetVersionsinterface has two relevant fields that are populated as specified below: interface TargetVersions { target: string; // equal to version field in \"package.json\" pxt: string; // equal to version field in \"package.json\" or \"node_modules/pxt-core/package.json\" } bundleddirs: string[]A target can use many packages in addition to the required “corepkg”. Toensure that a package is bundled into the web app, you must include it in this list. Forexample in http://github.com/microsoft/pxt-microbit/blob/master, we see: \"bundleddirs\": [ \"libs/core\", \"libs/radio\", \"libs/devices\", \"libs/bluetooth\" ], This ensures that the above four packages are compiled/bundled into the web app and delivered on the initialdownload of the web app. Other packages for the micro:bit, such as http://github.com/microsoft/pxt-neopixelare not bundled and remain on github.com, where they are loaded as needed by the web app (usuallyvia an “add package” request by the end user). AppTargetMost of the user-defined fields for pxttarget.json are described by the interface AppTarget. interface AppTarget { id: string; // unique id: should match ^[a-z]+$; used in URLs and domain names name: string; // friendly name (spaces allowed) corepkg: string; // specifies the directory (under libs/) for target's core APIs // such libraries also are known as packages. See section below. compile: CompileTarget; // see sections below for description appTheme: AppTheme; // see sections below for description nickname?: string; // Friendly id (should match ^[a-zA-Z]+$); used when generating files, // folders, etc. defaults to id platformid?: string; // Used as search term in GitHub search for packages; defaults to id title?: string; // for HTML TITLE tag description?: string; // for HTML META Description cloud?: AppCloud; // see sections below for descriptions of the rest of the fields simulator?: AppSimulator; runtime?: RuntimeOptions; compileService?: TargetCompileService; } corepkg: stringA target must have a core package under the libs/ directorywhere the core APIs for the target reside.The core package should always be bundled with the web app, as shown below: \"corepkg\": \"core\", \"bundleddirs\": [ \"libs/core\" ] compile: CompileTargetPXT supports compilation to both JavaScript and ARM machine code (native). Web-only targetswill not need the native compilation path. interface CompileTarget { isNative: boolean; // false -> JavaScript compilation only, for simulator hasHex: boolean; // output binary file (implies isNative) nativeType?: string; // currently only \"thumb\", though there is a prototype for AVR // output file options useUF2?: boolean; // true -> output UF2 format (see https://github.com/Microsoft/uf2), false -> HEX file hexMimeType?: string; // Mime type for hex files driveName?: string; // how will the device appear when plugged in via MSD? deployDrives?: string; // partial name of drives where the HEX/UF2 file should be copied // code generation options floatingPoint?: boolean; // use floating point in JavaScript (default is 32-bit integers) taggedInts?: boolean; // true -> use tagged integers in native (implies floatingPoint) shortPointers?: boolean; // true -> 16 bit pointers flashCodeAlign?: number; // defaults to 1k page size flashChecksumAddr?: number; // where to store checksum of code // advanced debugging options boxDebug?: boolean; // generate debugging code for boxing jsRefCounting?: boolean;// generate debugging in JS for reference counting scheme openocdScript?: string; } appTheme: AppThemePXT has a large number of options for controllingthe look and feel of a target.Here is the appTheme from pxt-sample with some comments: \"appTheme\": { // URLs to use for various components of the UI \"logoUrl\": \"https://microsoft.github.io/pxt-sample/\", \"homeUrl\": \"https://microsoft.github.io/pxt-sample/\", \"privacyUrl\": \"https://go.microsoft.com/fwlink/?LinkId=521839\", \"termsOfUseUrl\": \"https://go.microsoft.com/fwlink/?LinkID=206977\", \"betaUrl\": \"https://makecode.com/\", // populating the (?) menu \"docMenu\": [ { \"name\": \"About\", \"path\": \"/about\" }, { \"name\": \"Docs\", \"path\": \"/docs\" } ], // enable toolbox for both Blockly and JavaScript \"coloredToolbox\": true, \"monacoToolbox\": true, \"invertedMenu\": true, \"simAnimationEnter\": \"rotate in\", \"simAnimationExit\": \"rotate out\" } cloud?: AppCloudPXT has a cloud backend that provides a set of services to the web app. The services are configured usingthe cloud field in pxttarget.json, defined by the AppCloud interface: interface AppCloud { sharing?: boolean; // enable anonymous sharing of projects via URL importing?: boolean; // enable import of a previously shared project from // a URL (requires sharing? and publishing?) packages?: boolean; // enabled loading of packages (from github) preferredPackages?: string[]; // list of company/project(#tag) of packages on github githubPackages?: boolean; // enable user-specified term for searching github for packages // to be retired soon publishing?: boolean; // must set true for importing? to work; no other purpose evident embedding?: boolean; // not currently supported workspaces?: boolean; } For example in the pxttarget.json for http://github.com/microsoft/pxt-microbit, we see: \"cloud\": { \"workspace\": false, \"packages\": true, \"sharing\": true, \"publishing\": true, \"preferredPackages\": [ \"Microsoft/pxt-neopixel\" ], \"githubPackages\": true } simulator?: AppSimulator;PXT provides a JavaScript-based simulation environment on the left side of the webapp (typically for physical computing devices like the micro:bit). PXT uses theterm board to refer to the main physical computing device shown in the simulator.Each target has one board (plus optional parts). interface AppSimulator { // define aspects of physical computing device boardDefinition?: BoardDefinition; // running and code changes autoRun?: boolean; // automatically run program after a change to its code stopOnChange?: boolean; // stop execution when user changes code headless?: boolean; // whether simulator should still run while collapsed // buttons and parts hideRestart?: boolean; // hide the restart button hideFullscreen?: boolean; // hide the fullscreen button enableTrace?: boolean; // enable the slow-mode (snail) button parts?: boolean; // parts enabled? instructions?: boolean; // generate step-by-step wiring instructions (Make button) // appearance aspectRatio?: number; // width / height partsAspectRatio?: number; // aspect ratio of the simulator when parts are displayed // miscellaneous trustedUrls?: string[]; // URLs that are allowed in simulator modal messages } runtime?: RuntimeOptions;This severely misnamed option controls the available blocks in the Blockly editor: interface RuntimeOptions { // control whether or not Blockly built-in categories appear mathBlocks?: boolean; textBlocks?: boolean; listsBlocks?: boolean; variablesBlocks?: boolean; logicBlocks?: boolean; loopsBlocks?: boolean; // options specific to the special \"on start\" block onStartNamespace?: string; // default = loops onStartColor?: string; onStartWeight?: number; onStartUnDeletable?: boolean; } compileService?: TargetCompileService;PXT provides a compile service for C/C++ code that may be included in a target/package.Currently, this compile service can be configuredto use either yottaor platformio.PXT defaults to using local installs of yotta and platformio.PXT expects to find the C/C++ sources on github. interface TargetCompileService { buildEngine?: string; // default is yotta, set to platformio // where are the sources githubCorePackage?: string; // e.g. lancaster-university/microbit gittag: string; // yotta configuration yottaCorePackage?: string; // name for PXT use yottaTarget?: string; // name of yotta target to build yottaBinary?: string; // name of yotta output file yottaConfig?: any; // additional config // platformio configuration platformioIni?: string[]; // define contents of platformio.ini file serviceId: string; }"},{"title":"编译 | PXT","date":"2017-10-11T10:39:58.000Z","path":"2017/10/11/pxt-target/","text":"Target CreationPXT can be customized to create your own target, with your own set of APIs and runtime,supported by Block-based and JavaScript editing. Examples of targets are: https://makecode.microbit.org (sources at https://github.com/microsoft/pxt-microbit) http://microsoft.github.io/pxt-sample/ (sources at https://github.com/microsoft/pxt-sample) We assume that the reader is familiar with Node.JS, NPM, JavaScript and/or C++. If you haven’t done so yet,install Node.JS and the PXT command line npm install -g pxt Get a copy of the sample target sources and open it in your favorite editor. Open a command prompt in the target folder and run these commands to setup the tools. npm install At this point, pick an identifier for your target. Use only alphabetic characters as it will be used in various routing operations. StructureA target occupies a directory with a pxtarget.json file and the following folders: /libs, packages (sometimes referred to as libraries) that define the APIs (in C++, Static TypeScript or Thumb assembler) and how they should be exposed in blocks /sim, TypeScript source for the in-browser simulator, if any /docs, markdown documentation pages Updating pxtarget.json如：{ id: “ID:utseb”, name: “名称：utseb”, title: “标题：utseb”}The pxtarget.json file contains the configuration options of your target.For now, update the id, name and title fields to reflect your target information. Tip: keep searching and replacing all instances of sample in pxtarget.json. Updating package.jsonYour target will eventually have to be published to NPM,so go ahead and update the package.json file with your target id,repositories locations, etc. it might be a good time to check that your target id is available in NPM as well. Updating assetsGraphical assets are located under /docs/static. avatar.svg image used in talking heads loader.svg image used in loading overlay Updating the core packageThe libs/core package of pxt-sample defines a minimal package structure. In fact, the APIs of pxt-sample live in the sim/api.ts (annotated to exposeTypeScript functions as blocks), as this target is onlyfor the web. The PXT compiler generatesthe file libs/core/sim.d.ts from the simulator code. See creating a PXT packagefor more information on authoring packages, which includes codein the package itself.For now, you can try adding a new API to one of the existing namespacesinsim/api.ts with annotations to make a new block. Updating the templates projectsTemplates are the default projects for your target.There is one default blocks project, and one default JavaScript project.The initial templates are empty projects.To change the default project, modify the package under libs/blocksprj Testing the target locallyNow that you’ve updated your target, it is ready to be run locally. Run the following command: pxt serve The editor will automatically open the target API project which you can edit directly in PXT.At this point, we recommend to create a new project using blocks that will serve as a sandbox.New projects are created under the /projects folder when testing a target locally (and are automatically “git-ignored”). You can use these projects to change your templates. Simply copy the contents of your project under /projects to one of the templates under /libs/templates/. Whenever you make a change, the local web server will trigger a build. Simply reload the page once the build is done. Defining APIs and BlocksThe APIs available in the PXT environment are loaded from TypeScript package (library) files(the ones under /libs).They can optionally be auto-generated from C++ library files or from TypeScriptsimulator files. Read more about how to annotate your APIS to expose them as blocks in PXT. Path rewritingWhen uploading to PXT cloud URLs of various files are rewritten to ones pointing to the CDN.There are three kinds of URLs on the CDN: /blob/&lt;blob_hash&gt;/some/path/filename.ext - where the path and file name can be arbitrary /commit/&lt;commit_hash&gt;/path/in/that/commit/filename.ext - where the path actually comes from the commit /tree/&lt;tree_hash&gt;/path/in/that/tree/filename.ext - where the path actually comes from the tree Whenever possible, /blob/ URLs should be used, since they only change when the file changes.This allows for faster app updates. For an example, compare https://makecode.microbit.org/---manifestand https://github.com/Microsoft/pxt/blob/master/webapp/public/release.manifest Generally, PXT will rewrite URLs starting with /cdn/ to /commit/... and ones startingwith /blb/ to /blob/.... This happens in manifest and HTML files, as well as some JavaScriptfiles (web worker sources and embed.js). Part of that rewriting happens client-side when uploading(strings like @commitCdnUrl@ and @blobCdnUrl@ are introduced), and part happens in the cloud. Currently, in simulator files only, all of /cdn/, /sim/ and /blb/ are rewrittento /blob/.... Going forward however, simulator files should use /blb/ explicitlyto make the intent clear. The main reason to use /cdn/ instead of /blb/ is when resources require relative paths.This is for example the case for Blockly media files. The /tree/... URLs are not yet supported in rewriting."},{"title":"异步 | PXT","date":"2017-10-11T10:04:51.000Z","path":"2017/10/11/pxt-async/","text":"异步与线程背景知识JavaScript is generally speaking single threaded (there are web workers and other such inventions, but these are generally considered separate processes, that share no address space with the main process). If a function needs to wait forsome input (e.g., web request), you need to supply a callback function that getsexecuted when the data is available. downloadData(\"https://example.com/\", (err, data) => { if (err) { ... } else { let parsed = JSON.parse(data) ... } }) This becomes somewhat problematic when you start to nest these.A simple web search on “callback hell” will tell why. One way to fix this is to use promises, but the idearemains the same — in the .then() handler you provide the function to executewhen data is available, but the advantage is that you can often avoid nestingthem (functions returning promises are often by convention called somethingAsync): downloadDataAsync(\"https://example.com/\") .then(data => { let parsed = JSON.parse(data) ... }, err => { ... }) .then(() => downloadDataAsync(\"https://somewhere-else.com/\")) .then(somewhere => ...) There are proposals of introducing C#-style async/await to JavaScript.In fact TypeScript can compile async/await to ES6 generators (yield).In that case you can use await operator to make a call to a promise-returningfunction look sequential: let parsed = JSON.parse(await downloadDataAsync(\"https://example.com/\")) ... let somewhere = await downloadDataAsync(\"https://somewhere-else.com/\") ... Needless to say, this is way more readable and easier to get right thanthe previous two solutions. In fact, it lets you simulatecooperative multithreading — you think you have multiple threads,but only one of them runs at any given time, and you can be sureyour thread will not get interrupted until the point where it uses await. Promise? Await? And what is that for loop thing again?Now, all of this is great, but not really something you want to explainto someone who’s just trying to learn what a for loop is. For this reason, PXT lets users call async functions, as if they wereregular functions. This loses information about where your thread canbe interrupted, but we can hopefully recover that in the IDE (by for exampledisplaying a little clock next to async calls). let parsed = JSON.parse(downloadData(\"https://example.com/\")) ... let somewhere = downloadData(\"https://somewhere-else.com/\") ... Supporting async functions this way is one of the main reasons why we haveour own compilation scheme from TypeScript to JavaScript (cross-browserdebugger is another major one). Implementing async functionsCurrently, to implement an async function, you first need to add //% promiseattribute to the declaration: //? Downloads data from remote site. //% promise shim=basic::downloadData export function downloadData(url:string) { return \"\" } In the simulator you return a promise: export function downloadDataAsync(url:string) { return new Promise((resolve, reject) => $.get(url, (data, status) => { resolve(data) })) } It is also possible to use //% async and use getResume() functionto get a callback. You can see some older code do that. Note, that you can generate TypeScript definition from thesimulator files, which will take care of the //% promise and //% shim=... annotations."},{"title":"JavaScript编辑器特性 | PXT","date":"2017-10-11T09:28:35.000Z","path":"2017/10/11/pxt-editor/","text":"Features of the JavaScript EditorThe JavaScript editor extends the features and functionality of the Monaco Editor, the editor that powers Visual Studio Code.Here is a list of some of the features supported by the Editor: EditingThe Editor contains a built-in JavaScript/Typescript language service that provides complete code intelligence. ColoringThe Editor automatically colors each of function and its respective namespace to match the colors of the respective block in the Block Editor. This is the equivalent of the following blocks: Auto SuggestAlso known as IntelliSense, the editor supports automatic word completion. If the language service knows possible completions, the IntelliSense suggestions will pop up as you type. You can always manually trigger it with Ctrl and Space. You can get additional information if you click the ‘i’ symbol in the current suggestion. Auto completionPressing Enter to any of the functions suggested by IntelliSense will automatically insert a snippet of the function declaration prefilling default values for each of the function parameters. The default value is populated in one of the following ways: The default value in a @param JSdoc in the function declaration. Default values for primitive types. number: 0, string: &quot;&quot;, boolean: false If a parameter is an Enum, the first value of the Enum is inserted Parameter HintsParameter hints will pop up as you’re typing a function invocation. Quick InfoHovering over namespaces, functions and function parameters will show useful information describing the purposes of the function, namespace, or parameter. Bracket MatchingMatching brackets are highlighted as soon as the cursor is near one of them. Tip: You can jump to the matching bracket with Ctrl and Shift and \\ ErrorsThe Editor’s language service is constantly analyzing your code for errors in the background.Errors are surfaced to the user in one of two different ways: Red squiggly or wavy lines appear beneath your code that is incorrect An Error bar snaps to the first error in the list ZoomYou can change the editor’s font size by zooming in or out the editor content.Use Ctrl and + and Ctrl and - to zoom in/out. Find and ReplaceThe Editor supports Find, as well as Find and Replace in order to search for a particular keyword, or search and replace a particular keyword.You can get to the Find and Replace widget with Ctrl and f, or you can also get to it via the All Commands window (see below). Context MenuRight clicking anywhere within the editor will bring up the context menu.The context menu will show you quick actions that you can complete by clicking one of the buttons that appear in the context menu. Here are some of the actions currently supported: Format Code: Quickly formats the document code Show Commands: Opens up the All Commands view Save: Saves the document Run Simulator: Runs the simulator All CommandsThe All Commands view allows the user to search through all the commands available in the editor.To get to the all commands view press F1, or right click to bring up the context menu, then click Show Commands. Language SupportThe Monaco editor is also used for displaying other languages, including JSON, Cpp, Text and Assembly files."},{"title":"关于 | PXT","date":"2017-10-11T09:00:14.000Z","path":"2017/10/11/pxt-makecode-about/","text":"目标：Microsoft Makecode是一个开源框架， 旨在为计算机科学教育提供帮助。makecode 侧重于user-facing编辑器的开发，底层开发语言是TypScript的子集。 特性：Google Blockly 块状，拖拽编程。Monaco Editor web版本的编辑器an ARM Thumb machine code emitter"},{"title":"博客添加统计功能","date":"2017-10-11T08:57:32.000Z","path":"2017/10/11/blog-count-feature/","text":""},{"title":"比卦 | 易经","date":"2017-10-10T12:37:38.000Z","path":"2017/10/10/yi-8-bi/","text":"比:吉。原筮(shi),元永贞,无咎。不宁方来,后夫凶。【译】《比卦》象征亲密无间,团结互助:吉祥。探本求原,再一次卜筮占问,知道 要辅佐有德行的长者,长久不变地坚守正道,不会有祸害。连不安分的诸侯现在也来朝 贺,还有少数来得迟的诸侯将有凶险。《象》曰:地上有水,比;先王以建万国,亲诸侯。【译】《象辞》说:《比卦》的卦象为坤,(地)下坎(水)上,象征地上有水。大地 上百川争流,流水又浸润着大地,表明地与水亲密无间,互相依存;以前的历代君主明 白这个道理,所以分封土地,建立万国,安抚亲近各地诸侯。 初六,有孚比之,无咎;有孚盈缶(fou),终来有它,吉。【译】初六,具有诚实守信的德行,亲密团结,辅佐君主,不会有灾祸;诚信的德行 如同美酒注满了酒缸,这样远方的人纷纷前来归附,结果是吉祥的。 《象》曰:《比》之初六,有它吉也。【译】《象辞》说:《比卦》的第一爻位(初六),表示一开始便具有诚信的德行,致 20 使远方来人归附,自然可获吉祥。 六二,比之自内,贞吉。【译】六二,在内部亲密团结,努力辅佐君主,结果是吉祥的。 《象》曰:“比之自内”,不自失也。【译】《象辞》说:“内部亲密无间团结一致,辅佐君主”,说明没有偏离了正道。 六三,比之匪人。【译】六三,和行为不端正的人交朋友,而且关系亲密。 《象》曰“比之匪人”,不亦伤乎?【译】《象辞》说:“和行为不端正的人交朋友,而且关系亲密”,难道不是一件很可 悲的事吗? 六四,外比之,贞吉。【译】六四,在对外交往中互相信任,亲密团结,尽力辅佐贤明的君主,其结果是吉 祥的。 《象》曰:外比于贤,以从上也。【译】《象辞》说:在外面亲密团结朋友,辅佐贤君,说明要顺从居于尊上地位的君 主,才会有好的结果。 ￼￼九五,显比;王用三驱,失前禽,邑人不诫,吉。【译】九五,光明无私,亲密团结,互相辅助;跟随君王去田野围猎,从三面驱赶, 网开一面,看着禽兽从放开的一面逃走,毫不在乎,君王的部下也不戒备,吉祥。 《象》曰:“显比”之吉,位正中也,舍逆取顺,失前禽也;邑人不诫,上使中也。【译】《象辞》说:“光明无私,亲密团结,互相辅助”,可获得吉祥,因为此时居于 正中位置。抛弃逆天行事的举动而顺其自然,就好像围猎时网开一面,让该被擒的禽兽 落网,不该被获的从前面逃掉;君王的部下听其自然,不加戒备;这是君王的贤德感化 了部下的缘故。 上六,比之无首,凶。【译】上六,和众人亲密团结、互助友爱但自己不居于领导地位,将有凶险。 《象》曰:“比之无首”,无所终也。【译】《象辞》说:“和众人亲密团结、互助友爱但自己不居于领导地位,将有凶险”,说明自己将来没有可以归附的地方,无立足之地。"},{"title":"师卦 | 易经","date":"2017-10-10T12:31:20.000Z","path":"2017/10/10/yi-7-shi/","text":"师:贞,丈人吉,无咎。【译】《师卦》象征兵众(师指军队):坚守正道,德高望重富有经验的长者统帅军队 可以得到吉祥,不会有什么灾祸。 ￼￼《象》曰:地中有水,师;君子以容民畜众。【译】《象辞》说:《师卦》的卦象是坎(水)下坤(地)上,是地中有水之表象。地 中蕴藏聚集了大量的水,取之不尽,用之不竭,象征兵源充足;君子要像地中藏水一样 容纳天下百姓,养育众人,这样就会有众多的士兵可用。 初六,师出以律,否(pi)臧(zang)凶。【译】初六,出师征战必须要有严明的纪律,如果军纪混乱必然有凶险。 《象》曰:“师出以律”,失律凶也。【译】《象辞》说:“出师征战必须要有严明的纪律”,要号令整齐,行动一致,赏罚 分明。如果军纪不良,指挥不灵,必然要发生凶险。 九二,在师,中吉,无咎;王三锡命。【译】九二,在军中任统帅,持中不偏可得吉祥,不会有什么灾祸;君王多次进行奖 励,并被委以重任。 《象》曰:“在师中吉”,承天宠也;“王三锡命”,怀万邦也。【译】《象辞》说:“在军中任统帅,持中不偏可得吉祥,不会有什么灾祸”,表明承 受‘天命’,因此得到君王的宠幸;“君王多次进行奖励”,说明怀有治国平天下使万邦悦服的弘大志向。 六三,师或舆(yu)尸,凶。【译】六三,不时有士兵从战场上运送战死者的尸体回来,凶险。 ￼￼《象》曰:“师或舆尸”,大无功也。【译】《象辞》说:“士兵不时运送战死者的尸体回来”,说明不能知己知彼,在敌强 我弱的情况下,不自量力发动进攻,结果战败,没有任何功绩可言了。 六四,师左次,无咎。【译】六四,率军暂时撤退,免得遭受损失。 《象》曰:“左次无咎”,示失常也。【译】《象辞》说“观察了战场形势后,暂时后退以避敌精锐,免遭更大损失”。说明 深通兵法,懂得用兵有进有退的常理。 六五,田有禽,利执言,无咎;长子帅师,弟子舆尸,贞凶。【译】六五,田野中有野兽出没,率军围猎捕获,不会有损失;委任德高望重的长者 为军中主帅,必将战无不胜,委任无德小人将运送着尸体大败回,占问的结果必然是凶 险的。 《象》曰:“长子帅师”,以中行也;“弟子舆尸”,使不当也。【译】《象辞》说:“委任有德长者统帅军队战无不胜”,表明居中恃正,行为有法度,必然获胜;“委任无德小人将运送着战死者的尸体,大败而归”,说明用人不当,必招致 大败,将自食恶果。 上六,大君有命,开国承家,小人勿用。【译】上六,凯旋而归,天子颁布了诏命,分封功臣,或封为诸侯,或封为上卿,或封为大夫,但小人决不可以重用。 《象》曰:“大君有命”,以正功也;“小人勿用”,必乱邦也。【译】《象辞》说:“天子颁布了诏命,分封功臣”,是为了按功劳大小而公正封赏。 “小人决不可以重用”,因为重用小人必然危害并扰乱邦国。"},{"title":"讼卦 | 易经","date":"2017-10-10T12:24:18.000Z","path":"2017/10/10/yi-6-song/","text":"讼:有孚窒惕,中吉;终凶,利见大人,不利涉大川。【译】《讼卦》象征打官司:这是因为诚实守信的德行被阻塞,心中畏惧有所戒备引 起,坚守正道居中不偏会有吉祥;坚持把官司打到底则有凶险,如有德高望重的大人物 出现则会有利,但出外远行、要渡过宽阔的大河则不会顺利。《象》曰:天与水违行,讼;君子以作事谋始。【译】《象辞》说《讼卦》的卦象是坎(水)下乾(天)上,为天在水上之表象。天 从东向西转动,江河百川之水从西向东流,天与水是逆向相背而行的,象征着人们由于 意见不合而打官司。所以君子在做事前要深谋远虑,从开始就要消除可能引起争端的因素。 初六,不永所事;小有言,终吉。【译】初六,不久将陷于争端之中;虽然会受到一些非难和指责,但终久将获得吉祥。 《象》曰:“不永所事”,讼不可长也;虽“小有言”,其辩明也。【译】《象辞》说:“不久陷于争端之中”,说明与人争端决不可长久,决不可互不让 步,相持不下;虽然“受到一些非难指责”,但通过摆事实讲道理,可以明辨事非。 九二,不克讼,归而逋(bu),其邑人三百户,无眚(sheng)。【译】九二,打官司失利,走为上策,赶快逃回来,跑到只有三百户人家的小国中, 在此居住可以避开灾祸。 《象》曰:“不克讼,归逋窜也”;自下讼上,患至掇(duo)也。【译】《象辞》说:“打官司失利,迅速逃回来”,因为自己处于下位,与上面有权有 势的人打官司,必然要失败而且有灾祸降临,但逃走避开,灾祸就没有了。 六三,食旧德,贞厉,终吉;或从王事,无成。【译】六三,安享着原有的家业,吃喝不愁,坚守正道,处处小心防备危险,终久会 获得吉祥;如果辅佐君王建功立业,成功后不归功于自己。 《象》曰“食旧德”,从上吉也。【译】《象辞》说:“安享着祖上遗留下来的家业”,说明只要顺从上级,则可以获得 吉祥的结果。 九四,不克讼;复即命,渝,安贞吉。【译】九四,打官司失利,经过反思改变了主意,决定不打官司了,安分守己,必然会得到吉利的结果。 《象》曰:“复即命,渝”,安贞不失也。【译】《象辞》说:“打官司失利后,回过头仔细反思,觉得‘和为贵’,还是息事宁 人为好,于是改变了主意,撤回诉状,退出争端不打官司了”,说明坚守正道,安分守 16 己就没有什么损失了。 九五,讼,元吉。【译】九五,官司得到了公正的判决,开始获得吉祥。 《象》曰:“讼,元吉”,以中正也。【译】《象辞》说:“官司得到公正的判决,开始获得吉祥”,表明此时居于正中地位, 得到了大人物的公正的判处。 上九,或锡之鞶(pan)带,终朝三褫(chi)之。【译】上九,因打官司获胜,君王偶然赏赐给饰有皮束衣带的华贵衣服,但在一天之 内却几次被剥下身来。 《象》曰:以讼受服,亦不足敬也。【译】《象辞》说:因为打官司获胜而得到赏赐,没有什么可以值得尊敬的。"},{"title":"需卦 | 易经","date":"2017-10-10T12:12:21.000Z","path":"2017/10/10/yi-5-xu/","text":"需:有孚,光亨,贞吉,利涉大川。【译】《需卦》象征等待:具有诚实守信的品德,光明正大,做事才会亨通顺利,占 12 问的结果是吉祥的,出外远行,渡过宽阔的河流会很顺利。 《象》曰:云上于天,需;君子以饮食宴乐。【译】《象辞》说:《需卦》的卦象是乾(天)下坎(水)上,为水在天上之表象。水 汽聚集天上成为云层,密云満天,但还没有下雨,需要等待;君子在这个时候需要吃喝, 饮酒作乐,即在等待的时候积蓄力量。 初九,需于郊,利用恒,无咎。【译】初九,在郊外等待,必须有恒心,长久耐心地静候时机,不会有什么祸患。 《象》曰:“需于郊”,不犯难行也;“利用恒,无咎”,未失常也。【译】《象辞》说:“在郊外等待”,表明不能冒险轻率前行;“长久耐心地等候时机, 不会有什么祸患”,表明没有偏离正道,没有偏离天地恒常之理。 九二,需于沙,小有言,终吉。【译】九二,在沙滩上等待,虽然要受到别人的一些非难指责,耐心等待终究会获得 吉祥。 《象》曰:“需于沙”,衍在中也;虽有小言,以终吉也。【译】《象辞》说:“在沙滩上等待”,表明宽宏大量不急躁;虽然受到一些非难和指 责,但终久能获得吉祥。 九三,需于泥,致寇至。【译】九三,在泥泞中等待,结果抢劫的强徒乘机而至。 ￼￼《象》曰:“需于泥”,灾在外也;自我致寇,敬慎不败也。【译】《象辞》说:“在泥泞中等待”,说明灾祸还在外面,尚未殃及本身;自己招引 来强盗,说明要处处谨慎小心才能避开危险。 六四,需于血,出自穴。【译】六四,在血泊中等待,不小心陷进深穴,用尽全力才逃脱出来。 《象》曰:“需于血”,顺以听也。【译】《象辞》说:“在血泊中等待”,表明此时必须沉着冷静,顺应时势,听天由命, 以等待转机。 九五,需于酒食,贞吉。【译】九五,准备好酒食招待客人,占问的结果是吉祥的。 《象》曰:“酒食贞吉”,以中正也。【译】《象辞》说:“准备好酒食招待客人,占问的结果是吉祥的”,说明此时处于中 位,完美无缺。 上六,入于穴,有不速之客三人来;敬之,终吉。【译】上六,落入了洞穴之中,忽然有不请自来的三位客人到来;对他们恭恭敬敬, 以礼相待,终久会得到吉祥的结果。 ￼￼《象》曰:“不速之客来,敬之终吉”。虽不当位,未大失也。【译】《象辞》说:“不请自来的三位客人到来,对他们恭敬而且热情地招待,终久获 得吉祥”,表明此时尽管处在不适当的地位,但还没有遭受大的损失。"},{"title":"蒙卦 | 易经","date":"2017-10-10T11:55:54.000Z","path":"2017/10/10/yi-4-meng/","text":"蒙:亨。匪我求童蒙,童蒙求我;初筮(shi)告,再三渎,渎则不告。利贞。【译】《蒙卦》象征启蒙:亨通。不是我有求于幼童,而是幼童有求于我,第一次向 我请教,我有问必答,如果一而再、再而三地没有礼貌地乱问,则不予回答。利于守正 道。 《象》曰:山下出泉,蒙;君子以果行育德。【译】《象辞》说:《蒙卦》的卦象是坎(水)下艮(山)上,为山下有泉水之表象, 但要想发现甘泉,必须设法准确地找出泉水的位置,即意味着先必须进行启蒙教育。君 子必须行动果断,才能培养出良好的品德。 初六,发蒙,利用刑人,用说桎梏;以往吝。【译】初六,要进行启蒙教育,贵在树立典型,以便防止罪恶发生;如不专心求学, 而是急功冒进,将来必然会后悔。 《象》曰:利用刑人,以正法也。【译】《象辞》说:用树立典型的办法来进行启蒙教育,是为了确立正确的法度,以便遵循。 九二,包蒙,吉。纳妇,吉;子克家。【译】九二,周围都是上进心很强的蒙童,希望获得知识,这是很吉利的。如果迎娶 新媳妇,也是吉祥的。由于渴望接受教育,上进心很强,所以连孩子们已经能够治家了。 《象》曰:“子克家”,刚柔接也。【译】《象辞》说:“由于渴望接受教育,上进心很强,所以连孩子们都已经能够治家 了”,这是因为刚柔相济,孩子们受到了很好的启蒙教育的结果。 六三,勿用取女,见金夫,不有躬,无攸利。【译】六三,不能娶这样的女子,她的心目中只有美貌的郎君,不能守礼仪,也难以 保住自己的节操,娶这样的女子是没有什么好处的。 《象》曰:“勿用取女”,行不顺也。【译】《象辞》说:“不能娶这个女子”,主要是指这个女子的行为是不合乎礼仪的, 即这个女子没有受过良好的启蒙教育。 六四,困蒙,吝。【译】六四,人处于困难的境地,不利于接受启蒙教育,因而孤陋寡闻,结果是不大 好的。 ￼￼《象》曰:“困蒙之吝”,独远实也。【译】《象辞》说:“人处于困难的境地,不利于接受启蒙教育”,是因为疏远有真才 实学的老师。 六五,童蒙,吉。【译】六五,蒙童虚心地向老师求教,这是很吉祥的。 《象》曰:“童蒙之吉”,顺以巽(xun)也。【译】《象辞》说:“蒙童虚心地向老师求教,这是很吉祥的”,这是因为蒙童对老师 采取了谦逊的态度。蒙童谦逊,则老师乐教,其教育结果自然是比较有效的,当然也是 吉祥的。 上九,击蒙,不利为寇,利御寇。【译】上九,启蒙教育要及早实行,要针对蒙童的缺点,先发治人。不要等到蒙童的 问题彻底暴露再去教育,而要防患于未然,事先进行启蒙教育。 《象》曰:“利用御寇”,上下顺也。【译】《象辞》说:“启蒙教育要及早实行,要针对蒙童的缺点,先发治人”,因为只 有这样,才能使老师和蒙童互相配合,才能达到治病救人、上下一心的目的。"},{"title":"屯卦 | 易经","date":"2017-10-10T11:43:58.000Z","path":"2017/10/10/yi-3-tun/","text":"屯(tun):元,亨,利,贞;勿用有攸往,利建侯。【译】《屯卦》象征初生:元始,亨通,和谐,贞正。不要急于发展,首先要立君建 国。《象》曰:云雷屯,君子以经纶。【译】《象辞》说:《屯卦》的卦象是震(雷)下坎(水)上,为雷上有水之表象,水在上表示雨尚未落,故释为云。云雷大作,是即将下雨的征兆,故《屯卦》象征初生。 这里表示天地初创,国家始建,正人君子应以全部才智投入到创建国家的事业中去。 初九,磐(pan)桓,利居贞,利建侯。【译】初九,万事开头难,在初创时期困难特别大,难免徘徊不前,但只要能守正不 阿,仍然可建功立业。 《象》曰:虽磐桓,志行正也。以贵下贱,大得民也。【译】《象辞》说:虽然徘徊不前,但志向和行为纯正。只要能下定决心,深入基层, 仍然会大得民心的。 六二,屯如邅(zhan)如,乘马班如。匪寇婚媾(gou),女子贞不字,十年乃字。【译】六二,为难而团团转,乘马旋转不进,不是盗寇,是来求婚的。女子贞静自守, 不嫁人,要过十年才许嫁。 《象》曰:六二之难,乘刚也。“十年乃字”,反常也。【译】《象辞》说:六二爻之所以出现困难,是由于阳刚一方所造成的。“十年才许 嫁”,是很反常的现象。 六三,即鹿无虞,惟入于林中,君子几,不如舍,往吝。【译】六三,追逐鹿时,由于缺少管山林之人的引导,致使鹿逃入树林中去。君子此 时如仍不愿舍弃,轻率地继续追踪,则必然会发生祸事。 ￼￼《象》曰:“即鹿无虞”,以从禽也。君子舍之,往吝穷也。【译】《象辞》说:“追逐鹿缺少管山林之人引导”,是因为获鹿之心过于急切。君子 应及时放弃,否则必有祸事或导致穷困。 六四,乘马班如,求婚媾,往吉,无不利。【译】六四,四马前进,步调不一,但如坚定不移地去求婚,则结果必然是吉祥顺利 的。 《象》曰:求而往,明也。【译】《象辞》说:坚定不移地去追求,是明智之举。 九五,屯其膏,小贞吉,大贞凶。【译】九五,只顾自己囤积财富而不注意帮助别人,是很危险的,那样做,办小事虽 有成功的可能,但办大事则必然会出现凶险。 《象》曰:“屯其膏”,施未光也。【译】《象辞》说:“只顾自己囤积财富而不注意帮助别人”,这样的人即使想有所作 为,其前景也不大光明。 上六,乘马班如,泣血涟如。【译】上六,四马前进,步调不一,进退两难,悲伤哭泣,泣血不止。 《象》曰:“泣血涟如”,何可长也?【译】《象辞》说:“悲伤哭泣,泣血不止”,这种状况怎能维持长久呢?"},{"title":"坤卦 | 易经","date":"2017-10-10T11:03:58.000Z","path":"2017/10/10/yi-2-kun/","text":"坤:元,亨,利牝(pin)马之贞。君子有攸往,先迷,后得主,利。西南得朋,东北丧朋。安贞吉。【译】《坤卦》象征地:元始,亨通,如果像雌马那样柔顺,则是吉利的。君子从事 某项事业,虽然开始时不知所从,但结果会是有利的。如往西南方,则会得到朋友的帮 助。如往东南方,则会失去朋友的帮助。如果保持现状,也是吉利的。《象》曰:地势坤,君子以厚德载物。【译】《象辞》说:坤象征大地,君子应效法大地,胸怀宽广,包容万物。 初六,履霜,坚冰至。【译】初六,脚踏上了霜,气候变冷,冰雪即将到来。 《象》曰:“履霜坚冰”,阴始凝也;驯致其道,至坚冰也。【译】《象辞》说:“脚踏上了霜,气候变冷,冰雪即将到来”,说明阴气开始凝聚;按照这种情况发展下去,必然迎来冰雪的季节。 六二,直方大,不习无不利。【译】六二,正直、端正、广大,具备这样的品质,即使不学习也不会有什么不利。 ￼￼《象》曰:六二之动,直以方也,“不习无不利”,地道光也。【译】《象辞》说:六二爻若是出现变化的话,总是表现出正直、端正的性质。“即使 不学习也不会有什么不利”,是因为地德广大,包容万物的缘故。 六三,含章可贞,或从王事,无成有终。【译】六三,胸怀才华而不显露,如果辅佐君主,能克尽职守,功成不居。 《象》曰:“含章可贞”,以时发也;“或从王事”,知光大也。【译】《象辞》说:“胸怀才华而不显露”,是要把握时机才发挥,“如果辅佐君主”, 必能大显身手,一展抱负。 六四,括囊(nang),无咎无誉。【译】六四,扎紧袋口,不说也不动,这样虽得不到称赞,但也免遭祸患。 《象》曰:“括囊无咎”,慎不害也。【译】《象辞》说:“扎紧袋口,不说也不动,可以免遭祸患”,说明小心谨慎从事, 是不会有害的。 六五,黄裳,元吉。【译】六五,黄色的衣服,最为吉祥。 《象》曰:“黄裳元吉”,文在中也。【译】《象辞》说:“黄色的衣服,最为吉祥”,是因为黄色代表中,行事以中道为准则,当然是吉祥的。 上六,龙战于野,其血玄黄。【译】上六,阴气盛极,与阳气相战郊外,天地混杂,乾坤莫辨,后果是不堪设想的。 《象》曰:“龙战于野”,其道穷也。【译】《象辞》说:“阴气盛极,与阳气相战于郊外”,说明阴气已经发展到尽头了。 用六,利永贞。【译】“用六”这一爻,利于永远保持中正。 《象》曰:用六“永贞”,以大终也。【译】《象辞》说:用六的爻辞说“利于永远保持中正”,即是指阴盛到了极点就会向 阳转化。"},{"title":"乾卦 | 易经","date":"2017-10-10T07:55:26.000Z","path":"2017/10/10/yi-1-qian/","text":"乾:元,亨,利,贞。【译】《乾卦》象征天:元始,亨通,和谐,贞正。￼《象》曰:天行健,君子以自强不息。【译】《象辞》说:天道运行周而复始,永无止息,谁也不能阻挡,君子应效法天道, 自立自强,不停地奋斗下去。 初九,潜龙勿用。【译】初九,龙尚潜伏在水中,养精蓄锐,暂时还不能发挥作用。 《象》曰:潜龙勿用,阳在下也。【译】《象辞》说:龙象征阳。“龙尚潜伏在水中,养精蓄锐,暂时还不能发挥作用”, 是因为此爻位置最低,阳气不能散发出来的缘故。 九二,见龙在田,利见大人。【译】九二,龙已出现在地上,利于出现德高势隆的大人物。 《象》曰:“见龙在田”,德施普也。【译】《象辞》说:“龙已出现在地上”,犹如阳光普照,天下人普遍得到恩惠。 九三,君子终日乾乾,夕惕若,厉无咎(jiu)。【译】九三,君子整天自强不息,晚上也不敢有丝毫的懈怠,这样即使遇到危险也会 逢凶化吉。 《象》曰:“终日乾乾”,反复道也。【译】《象辞》说:“整天自强不息”,是因为要避免出现反复,不敢有丝毫大意。 九四,或跃在渊,无咎。【译】九四,龙或腾跃而起,或退居于渊,均不会有危害。 ￼￼《象》曰:“或跃在渊”,进无咎也。【译】《象辞》说:“龙或腾跃而起,或退居于渊,均不会有危害”,因为能审时度势, 故进退自如,不会有危害。 九五,飞龙在天,利见大人。【译】九五,龙飞上了高空,利于出现德高势隆的大人物。 《象》曰:“飞龙在天”,大人造也。【译】《象辞》说:“龙飞上了高空”,象征德高势隆的大人物一定会有所作为。 上九,亢(kang)龙有悔。【译】上九,龙飞到了过高的地方,必将会后悔。 《象》曰:“亢龙有悔”,盈不可久也。【译】《象辞》说“龙飞到了过高的地方,必将会后悔”,因为物极必反,事物发展到 了尽头,必将走向自己的反面。 用九,见群龙无首,吉。【译】用九,出现群龙也不愿意为首的现象,是很吉利的。 《象》曰:“用九”,天德不可为首也。【译】《象辞》说:“用九”的爻象说明,天虽生万物,但却不居首、不居功。"},{"title":"初学 | 易经","date":"2017-10-10T07:12:45.000Z","path":"2017/10/10/yi-start/","text":"初步学习易经，记录要点与心得。易经，包括’经’与’传’两部分。‘经’包括六十四卦和三百八十四爻，及其说明(卦辞与爻辞)。‘传’，又称’十翼’，为孔子所作。 先天八卦“天地定位，山泽通气，雷风相薄，水火不相射，八卦想错。数往者顺，知来者逆，是故易逆数也”《说卦第二章》 后天八卦“帝出乎震，齐乎巽，相见乎离，致役乎坤，说言乎兑，战乎乾，劳乎坎，成言乎艮”《说卦第五章》 六十四卦由八经卦互组而成，爻从最低到最上，称”初，二，三，四，五，上”。另外，最顶两爻代表天，中间两爻代表人，最低两爻代表地。"},{"title":"Linux安装Git环境","date":"2017-10-09T07:43:41.000Z","path":"2017/10/09/linux-git-env/","text":"目标：为Linux服务器安装Git环境，配置安全协议SSH安装Git sudo apt-get update sudo apt-get install git 查看版本，检测是否安装成功 git --version 生成SSH KEY，默认安装(若有选择，按回车继续) ssh-keygen -t rsa -b 4096 -C lian1925@126.com 启动 ssh-agent: eval $(ssh-agent -s) 为 ssh-agent 添加 SSH key ssh-add ~/.ssh/id_rsa 获取 SSH KEY内容，填写到GitLab账号 $ pbcopy &lt; ~/.ssh/id_rsa.pub # Copies the contents of the id_rsa.pub file to your clipboard"},{"title":"Linux安装NodeJS环境","date":"2017-10-09T06:07:48.000Z","path":"2017/10/09/linux-node-env/","text":"目标：为Linux(Ubuntu)服务器，安装nodejs环境，用于运行JavaScript。安装nvm curl -o- https://raw.githubusercontent.com/creationix/nvm/v0.33.5/install.sh | bash 查看当前已安装哪些node版本 nvm ls 安装node nvm install v6.10.1 查看版本，测试是否安装成功 node -v npm -v 安装部署工具PM2 npm i -g pm2 进入项目目录,安装依赖，并启动项目 cd /helloExpress npm install pm2 start api.js 升级数据库，打卡helloExpress/api.js文件根据自己的情况，修改如下参数： global.mysql_info = { host: '120.25.192.73', user: 'root', password: 'luobo2017', database: 'question' };"},{"title":"Linux下处理MySQL错误","date":"2017-10-09T04:29:11.000Z","path":"2017/10/09/linux-mysql-error/","text":"目标：在Linux服务器部署，运行程序，对外提供服务时，MySQL数据库会遇到一些问题，现将实践遇到的问题及解决思路记录。1 mysqladmin flush-hosts 错误当后端程序试图连接MySQL，出现错误提示如下： root@iZwz92o5ndq3w3w5buade0Z:/home/helloExpress# node api.js 2017-10-09 12:23:29 api start. port:8080 (node:2888) UnhandledPromiseRejectionWarning: Unhandled promise rejection (rejection id: 1): Error: Host '120.25.192.73' is blocked because of many connection errors; unblock with 'mysqladmin flush-hosts' (node:2888) DeprecationWarning: Unhandled promise rejections are deprecated. In the future, promise rejections that are not handled will terminate the Node.js process with a non-zero exit code. events.js:163 throw er; // Unhandled 'error' event ^ Error: Connection lost: The server closed the connection. at Socket.&lt;anonymous> (/home/helloExpress/node_modules/mysql2/lib/connection.js:111:35) at emitNone (events.js:91:20) at Socket.emit (events.js:188:7) at endReadableNT (_stream_readable.js:975:12) at _combinedTickCallback (internal/process/next_tick.js:80:11) at process._tickCallback (internal/process/next_tick.js:104:9) 解决方案停止MySQL的运行： sudo /etc/init.d/mysql stop 以安全模式进入： sudo mysqld_safe --skip-grant-tables &amp; 进入MySQL： mysql -uroot -p 显示当前最大错误连接数： show variables like '%max_connections%'; 修改连接数值 SET GLOBAL max_connect_errors=10000; 退出MySQL exit 重新安装mysql2 library npm i mysql2"},{"title":"书单","date":"2017-10-05T15:19:08.000Z","path":"2017/10/05/reading-list/","text":"宁静庭落，一方书桌，一缕清风，一杯淡茶，手捧一卷书，闲坐一傍晚，何其美哉。好书于我更甚美味佳肴，特将喜爱之书梳理纪念。 21天搞定电影剧本 美食祈祷恋爱 你的剧本逊毙了 深入理解计算机系统 太极拳体用全书 万物解释者 研究是一门艺术 富爸爸穷爸爸 别闹了，费曼先生 程序员的自我修养 代码大全 故事：材质、结构、风格和银幕剧作的原理 关键冲突：如何把人际关系危机转化为合作共赢 关键对话：如何高效沟通 影响力 哈佛非虚构写作课 解忧杂货店 经济史的趣味 奇特的一生 围城 人月神话 山海经 嫌疑人X的献身 小岛经济学 小王子 小说课:折磨读者的秘密 演讲的力量 一本小小的红色写作书 一本小小的蓝色逻辑书 JavaScript权威指南 JavaScript高级程序设计"},{"title":"博客添加评论功能","date":"2017-10-05T11:28:01.000Z","path":"2017/10/05/blog-comments-feature/","text":"目标：为博客添加评论功能，方便访客留言。 工具畅言，使用微信账号登录。 备案使用畅言评论，需要对域名进行备案。故于阿里云新买域名www.liangyl.top，进行绑定 企业邮箱腾讯免费企业邮箱，使用微信登录 在页面的合适位置引入评论代码此处需要填写id和key，在畅言的管理后台获取。 &lt;div id=\"SOHUCS\">&lt;/div> &lt;script type=\"text/javascript\"> (function(){ var appid = '您的appid'; var conf = '您的appkey'; var width = window.innerWidth || document.documentElement.clientWidth; if (width &lt; 960) { window.document.write('&lt;script id=\"changyan_mobile_js\" charset=\"utf-8\" type=\"text/javascript\" src=\"http://changyan.sohu.com/upload/mobile/wap-js/changyan_mobile.js?client_id=' + appid + '&amp;conf=' + conf + '\">&lt;\\/script>'); } else { var loadJs=function(d,a){var c=document.getElementsByTagName(\"head\")[0]||document.head||document.documentElement;var b=document.createElement(\"script\");b.setAttribute(\"type\",\"text/javascript\");b.setAttribute(\"charset\",\"UTF-8\");b.setAttribute(\"src\",d);if(typeof a===\"function\"){if(window.attachEvent){b.onreadystatechange=function(){var e=b.readyState;if(e===\"loaded\"||e===\"complete\"){b.onreadystatechange=null;a()}}}else{b.onload=a}}c.appendChild(b)};loadJs(\"http://changyan.sohu.com/upload/changyan.js\",function(){window.changyan.api.config({appid:appid,conf:conf})}); } })(); &lt;/script> 图片"},{"title":"博客添加图标样式","date":"2017-10-05T06:16:02.000Z","path":"2017/10/05/blog-icon-style/","text":"目标：为博客添加好看的图标样式，提示阅读体验。 图标库阿里巴巴矢量图标库,可以使用GitHub账号登录 第一步，在图标库中搜索所需的图标第二步，将选好的图标加入项目，如:blog第三步，在HTML和css文件中引用 获取项目生成的css文件链接，加入html文件的头部&lt;link rel=\"stylesheet\" href=\"//at.alicdn.com/t/font_407924_kx6yx3r9q4m6xbt9.css\"> 选择所需的图标，获取其class名字，应用于页面&lt;i class=\"iconfont icon-sousuo\">&lt;/i> blog项目图标参考搜索icon-sousuo微博icon-weibogithubicon-githubtwittericon-twitterfacebookicon-facebook斜线icon-xiexian1双箭头icon-shuangjiantou-copy"},{"title":"Nginx 502 错误","date":"2017-10-05T04:15:03.000Z","path":"2017/10/05/nginx-502-error/","text":"最近，部署于阿里云的服务接口，用户请求数据时遭遇502错误的困扰。本文用于记录解决该问题的经过。查看Nginx的错误日志error.log，记录如下：片段1 2017/10/05 11:50:51 [error] 6430#0: *1815 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/course_submit_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/course_submit_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 11:50:51 [error] 6430#0: *1809 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/submit_check HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/submit_check\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 11:50:51 [error] 6430#0: *1816 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/auth/check_manager HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/auth/check_manager\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 11:50:51 [error] 6430#0: *1807 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/subscribe_state HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/subscribe_state\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 片段2 2017/10/05 09:44:51 [error] 6430#0: *1084 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/submit_check HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/submit_check\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 09:44:51 [error] 6430#0: *1083 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/auth/check_manager HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/auth/check_manager\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 09:44:51 [error] 6430#0: *1064 recv() failed (104: Connection reset by peer) while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/subscribe_state HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/subscribe_state\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 09:44:51 [error] 6430#0: *1063 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/course_submit_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/course_submit_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 查看请求日志，记录如下： 116.25.250.1 - - [05/Oct/2017:11:52:56 +0800] \"POST /educate/user/info HTTP/1.1\" 200 441 \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" \"wechatdevtools appservice port/9974\" 116.25.250.1 - - [05/Oct/2017:11:52:56 +0800] \"POST /educate/manager/course_list HTTP/1.1\" 200 5056 \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" \"wechatdevtools appservice port/9974\" 116.25.250.1 - - [05/Oct/2017:11:58:32 +0800] \"POST /educate/manager/course_list HTTP/1.1\" 200 5056 \"https://servicewechat.com/wx2ef86638fe2ab2eb/0/page-frame.html\" \"Mozilla/5.0 (iPhone; CPU iPhone OS 9_0 like Mac OS X) AppleWebKit/601.1.46 (KHTML, like Gecko) Mobile/13A342 MicroMessenger/6.5.18 NetType/4G Language/zh_CN\" 116.25.250.1 - - [05/Oct/2017:11:58:32 +0800] \"POST /educate/user/info HTTP/1.1\" 200 441 \"https://servicewechat.com/wx2ef86638fe2ab2eb/0/page-frame.html\" \"Mozilla/5.0 (iPhone; CPU iPhone OS 9_0 like Mac OS X) AppleWebKit/601.1.46 (KHTML, like Gecko) Mobile/13A342 MicroMessenger/6.5.18 NetType/4G Language/zh_CN\" 40.77.167.0 - - [05/Oct/2017:12:13:51 +0800] \"GET / HTTP/1.1\" 200 59 \"-\" \"Mozilla/5.0 (compatible; bingbot/2.0; +http://www.bing.com/bingbot.htm)\" 103.206.22.250 - - [05/Oct/2017:12:23:13 +0800] \"GET http://azenv.net/ HTTP/1.1\" 200 28 \"-\" \"Mozilla/5.0 (compatible; MSIE 6.0; Windows NT 5.1; Trident/5.0)\" 103.206.22.250 - - [05/Oct/2017:12:23:13 +0800] \"CONNECT www.baidu.com:443 HTTP/1.1\" 400 181 \"-\" \"-\" 方案一，将代理服务的失效时间延长 proxy_connect_timeout 600; proxy_send_timeout 600; proxy_read_timeout 600; send_timeout 600; 方案二，添加缓存功能 proxy_cache_path /home/nginx_cache_dir levels=1:2 keys_zone=cache_one:100m inactive=60m max_size=5g ; location / { proxy_cache_valid 200 302 1h; proxy_cache_valid 301 1d; proxy_cache_valid any 1m; proxy_cache cache_one; expires 10m; add_header X-Proxy-Cache $upstream_cache_status; } 方案三，增加缓存空间，延长时间 keepalive_timeout 600; types_hash_max_size 2048; fastcgi_buffers 8 16k; fastcgi_buffer_size 32k; fastcgi_connect_timeout 300; fastcgi_send_timeout 300; fastcgi_read_timeout 300; 新增报错日志：片段3 2017/10/05 15:46:59 [error] 23492#0: *585 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 upstream prematurely closed connection while reading response header from upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *585 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *585 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *585 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *585 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *585 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\"2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:46:59 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:47:00 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:47:00 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:47:00 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/user/info HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/user/info\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" 2017/10/05 15:47:00 [error] 23492#0: *552 connect() failed (111: Connection refused) while connecting to upstream, client: 116.25.250.1, server: , request: \"POST /educate/manager/course_list HTTP/1.1\", upstream: \"http://127.0.0.1:8080/educate/manager/course_list\", host: \"www.luobocode.com\", referrer: \"https://servicewechat.com/wx2ef86638fe2ab2eb/devtools/page-frame.html\" nginx参考配置文件： events { worker_connections 768; # multi_accept on; } http { access_log /var/log/nginx/access.log; error_log /var/log/nginx/error.log; proxy_cache_path /var/cache/nginx levels=1:2 keys_zone=one:8m max_size=3000m inactive=600m; proxy_temp_path /var/tmp; include mime.types; default_type application/octet-stream; sendfile on; keepalive_timeout 65; gzip on; gzip_comp_level 6; gzip_vary on; gzip_min_length 1000; gzip_proxied any; # gzip_types text/plain text/html text/css application/json application/x-javascript text/xml application/xml application/xml+rss text/javascript; gzip_buffers 16 8k; # ssl_certificate /some/location/luobocode.com.bundle.crt; # ssl_certificate_key /some/location/luobocode.com.key; # ssl_protocols SSLv3 TLSv1; # ssl_ciphers HIGH:!aNULL:!MD5; upstream www.luobocode.com { server 127.0.0.1:8080; keepalive 64; } # server { # listen 80; # rewrite ^(.*) https://$host$1 permanent; # } server { listen 80; listen [::]:80; server_name www.luobocode.com; return 301 https://www.luobocode.com$request_uri; } server { listen 443 ssl; listen [::]:443 ssl; server_name www.luobocode.com; ssl on; ssl_certificate 1_www.luobocode.com_bundle.crt; ssl_certificate_key 2_www.luobocode.com.key; ssl_session_timeout 5m; ssl_protocols TLSv1 TLSv1.1 TLSv1.2; #按照这个协议配置 ssl_ciphers ECDHE-RSA-AES128-GCM-SHA256:HIGH:!aNULL:!MD5:!RC4:!DHE;#按照这个套件配置 ssl_prefer_server_ciphers on; location / { proxy_redirect off; proxy_set_header X-Real-IP $remote_addr; proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for; proxy_set_header X-Forwarded-Proto $scheme; proxy_set_header Host $http_host; proxy_set_header X-NginX-Proxy true; proxy_set_header Connection \"\"; proxy_http_version 1.1; proxy_cache one; proxy_cache_key sfs$request_uri$scheme; proxy_pass http://www.luobocode.com; } } }"},{"title":"博客添加代码高亮特性","date":"2017-10-04T21:15:19.000Z","path":"2017/10/05/blog-code-highlight-feature/","text":"目标：为博客添加代码高亮特性，让代码部分的观赏性加分。 工具hexo-prism-plugin 安装npm i -S hexo-prism-plugin 配置在博客的配置文件_config.yml，加入配置语句： prism_plugin: mode: 'preprocess' # realtime/preprocess theme: 'duotone-light' line_number: false # default false 禁止默认 highlight配置： highlight: enable: false 修改样式将代码块设为圆角，添加浅浅边框，修改后视觉效果更加柔和美观。这里我们只需要修改pre选项，因为所有的代码块都包含在pre节点内,为避免干扰其他使用pre的样式，可加.page前缀。 .page pre { border: 1px solid rgba(0, 0, 0, 0.3); border-radius: 10px; } 清除缓存并启动hexo clean hexo s"},{"title":"网络存储","date":"2017-10-03T12:05:03.000Z","path":"2017/10/03/web-storage/","text":"设备 威联通（QNAP）TS-231P 1G 内存 2盘位NAS网络存储器 双核1.7GHz处理器 2个网络端口 初始化安装"},{"title":"博客实现搜索功能","date":"2017-10-02T16:10:09.000Z","path":"2017/10/03/blog-search-feature/","text":"目标：为博客添加搜索功能，方便用户快速查找对应的文章。实现搜索功能，有两种途径：1）使用第三方搜索公司提供的服务；2）通过自己获取网站数据和关键字匹配，实现搜索功能 第三方服务Algolia可采用Github账号登录使用 自定义搜索功能第一步，我们要获取博客网站的数据，放入文件中，作为搜索功能的数据源。对此我们选用的工具是：hexo-generator-json-content安装方式： npm i -S hexo-generator-json-content 配置在博客配置 _config.yml,添加上面插件的配置语句： jsonContent: meta: false pages: false posts: title: true date: true path: true text: true raw: false content: false slug: false updated: false comments: false link: false permalink: false excerpt: false categories: false tags: false 启动 hexo serve 将自动生成 content.json文件，格式如下： [{ //-> only published posts title: post.title, date: post.date, text: post.content, //-> only text minified ;) path: post.path }] 第二步，通过关键字，获取数据源中的匹配文章。这里我们将提供一个搜索函数search()，传入关键字，返回相匹配的文章列表。 function search(keywords){ // 关键字 => 正则，空格隔开的看作多个关键字 // a b c => /a|b|c/gmi var result = []; var regExp = new RegExp(key.replace(/[ ]/g, '|'), 'gmi'); loadData(function(data){ result = data.filter(function(post){ return matcher(post,regExp); }) }) } 定义数据源读取函数loadData() var searchData; function loadData(success) { if (!searchData) { var xhr = new XMLHttpRequest(); xhr.open('GET', '/content.json', true); xhr.onload = function() { if (this.status >= 200 &amp;&amp; this.status &lt; 300) { var res = JSON.parse(this.response || this.responseText); searchData = res instanceof Array ? res : res.posts; success(searchData); } else { console.error(this.statusText); } }; xhr.onerror = function() { console.error(this.statusText); }; xhr.send(); } else { success(searchData); } } 定义正则匹配函数 function matcher(post, regExp) { // 匹配优先级：title > tags > text return regtest(post.title, regExp) || post.tags.some(function(tag) { return regtest(tag.name, regExp); }) || regtest(post.text, regExp); } function regtest(raw, regExp) { regExp.lastIndex = 0; return regExp.test(raw); }"},{"title":"相册功能","date":"2017-09-22T08:31:58.000Z","path":"2017/09/22/gallery/","text":"目标：为博客添加酷炫的相册功能 工具PhotoSwipe 用法引入js和css文件 &lt;!-- Core CSS file --> &lt;link rel=\"stylesheet\" href=\"path/to/photoswipe.css\"> &lt;!-- Skin CSS file (styling of UI - buttons, caption, etc.) In the folder of skin CSS file there are also: - .png and .svg icons sprite, - preloader.gif (for browsers that do not support CSS animations) --> &lt;link rel=\"stylesheet\" href=\"path/to/default-skin/default-skin.css\"> &lt;!-- Core JS file --> &lt;script src=\"path/to/photoswipe.min.js\">&lt;/script> &lt;!-- UI JS file --> &lt;script src=\"path/to/photoswipe-ui-default.min.js\">&lt;/script> 在页面合适的地方，放置photoswipe &lt;!-- Root element of PhotoSwipe. Must have class pswp. --> &lt;div class=\"pswp\" tabindex=\"-1\" role=\"dialog\" aria-hidden=\"true\"> &lt;!-- Background of PhotoSwipe. It's a separate element as animating opacity is faster than rgba(). --> &lt;div class=\"pswp__bg\">&lt;/div> &lt;!-- Slides wrapper with overflow:hidden. --> &lt;div class=\"pswp__scroll-wrap\"> &lt;!-- Container that holds slides. PhotoSwipe keeps only 3 of them in the DOM to save memory. Don't modify these 3 pswp__item elements, data is added later on. --> &lt;div class=\"pswp__container\"> &lt;div class=\"pswp__item\">&lt;/div> &lt;div class=\"pswp__item\">&lt;/div> &lt;div class=\"pswp__item\">&lt;/div> &lt;/div> &lt;!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. --> &lt;div class=\"pswp__ui pswp__ui--hidden\"> &lt;div class=\"pswp__top-bar\"> &lt;!-- Controls are self-explanatory. Order can be changed. --> &lt;div class=\"pswp__counter\">&lt;/div> &lt;button class=\"pswp__button pswp__button--close\" title=\"Close (Esc)\">&lt;/button> &lt;button class=\"pswp__button pswp__button--share\" title=\"Share\">&lt;/button> &lt;button class=\"pswp__button pswp__button--fs\" title=\"Toggle fullscreen\">&lt;/button> &lt;button class=\"pswp__button pswp__button--zoom\" title=\"Zoom in/out\">&lt;/button> &lt;!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR --> &lt;!-- element will get class pswp__preloader--active when preloader is running --> &lt;div class=\"pswp__preloader\"> &lt;div class=\"pswp__preloader__icn\"> &lt;div class=\"pswp__preloader__cut\"> &lt;div class=\"pswp__preloader__donut\">&lt;/div> &lt;/div> &lt;/div> &lt;/div> &lt;/div> &lt;div class=\"pswp__share-modal pswp__share-modal--hidden pswp__single-tap\"> &lt;div class=\"pswp__share-tooltip\">&lt;/div> &lt;/div> &lt;button class=\"pswp__button pswp__button--arrow--left\" title=\"Previous (arrow left)\"> &lt;/button> &lt;button class=\"pswp__button pswp__button--arrow--right\" title=\"Next (arrow right)\"> &lt;/button> &lt;div class=\"pswp__caption\"> &lt;div class=\"pswp__caption__center\">&lt;/div> &lt;/div> &lt;/div> &lt;/div> &lt;/div> 初始化gallery var pswpElement = document.querySelectorAll('.pswp')[0]; // build items array var items = [ { src: 'https://placekitten.com/600/400', w: 600, h: 400 }, { src: 'https://placekitten.com/1200/900', w: 1200, h: 900 } ]; // define options (if needed) var options = { // optionName: 'option value' // for example: index: 0 // start at first slide }; // Initializes and opens PhotoSwipe var gallery = new PhotoSwipe( pswpElement, PhotoSwipeUI_Default, items, options); gallery.init(); 图片工具fancyBox3快速入门 &lt;!-- 1. Add latest jQuery and fancyBox files --> &lt;script src=\"//code.jquery.com/jquery-3.2.1.min.js\">&lt;/script> &lt;link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/fancybox/3.1.25/jquery.fancybox.min.css\" /> &lt;script src=\"https://cdnjs.cloudflare.com/ajax/libs/fancybox/3.1.25/jquery.fancybox.min.js\">&lt;/script> &lt;!-- 2. Create links --> &lt;a data-fancybox=\"gallery\" href=\"big_1.jpg\">&lt;img src=\"small_1.jpg\">&lt;/a> &lt;a data-fancybox=\"gallery\" href=\"big_2.jpg\">&lt;img src=\"small_2.jpg\">&lt;/a> &lt;!-- 3. Have fun! -->"},{"title":"Hello World","date":"2013-07-14T09:01:34.000Z","path":"2013/07/14/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new \"My New Post\" More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment"}]